{
  "code":440,
  "date":"October 31, 2013",
  "changelog":"Refreshed interface with white elements instead of blue.\nClock no longer shows bold hours; all digits are thin. The H, M, and S markings for the stopwatch and timer have been removed, leaving just the numbers.\nAbility for applications to trigger translucency in the navigation and status bars.[150]\nAbility for applications to use \"immersive mode\" to keep the navigation and status bars hidden while maintaining user interaction.[151]\nAction overflow menu buttons are always visible, even on devices with a \"Menu\" key, which was officially deprecated by Android 4.0.[152]\nWrite access disabled for user-installed applications om external storage (i.e. MicroSD), except for their own directories inside Android/data.[153][154]\nPurging of app data directories in user storage (internal user storage and MicroSD) upon uninstallation[154]\nOptimizations for performance on devices with lower specifications, including zRAM support and \"low RAM\" device API.[146]\nWireless printing capability.[146]\nNFC host card emulation, enabling a device to replace smart cards.[146]\nWebViews are now based on the Chromium engine (feature parity with Chrome for Android 30).\nExpanded functionality for notification listener services.[146]\nPublic API for developing and managing text messaging clients.[155]\nStorage Access Framework, an API allowing apps to retrieve files in a consistent manner. As part of the framework, a new system file picker allows users to access files from various sources (including those exposed by apps, such as online storage services).[86]\nNew framework for UI transitions.\nSensor batching, step detector and counter APIs.[146]\nSettings application now makes it possible to select default text messaging and the home (launcher) application.\nAudio tunneling, audio monitoring and loudness enhancer.[156]\nBuilt-in screen recording feature (primarily for developers, as usage of ADB is required).[157]\nNative infrared blaster API.\nVerified boot.\nEnforcing SELinux.\nExpanded accessibility APIs and system-level closed captioning settings.\nAndroid Runtime (ART) introduced as a new experimental application runtime environment, not enabled by default, as a replacement for the Dalvik virtual machine.[158]\nBluetooth Message Access Profile (MAP) support.[159]\nDisabled access to battery statistics by third-party applications.[160]\nSettings application no longer uses a multi-pane layout on devices with larger screens.\nWi-Fi and mobile data activity (TX/RX) indicators are moved to quick settings.[161]\nDisables text wrapping in the WebView browser component.[162]"
}
