{
  "code":500,
  "date":"November 12, 2014",
  "changelog":"Android Runtime (ART) with ahead-of-time (AOT) compilation and improved garbage collection (GC), replacing Dalvik that combines bytecode interpretation with trace-based just-in-time (JIT) compilation.[181][183]\nSupport for 64-bit CPUs.\nOpenGL ES 3.1 and Android Extension Pack (AEP) on supported GPU configurations.\nRecent activities screen with tasks instead of applications, up to a configured maximum of tasks per application.\nVector drawables, which scale without losing definition.\nSupport for print previews.\nMaterial design, bringing a restyled user interface and “ripple effect” for buttons.\nRefreshed lock screen, no longer supporting widgets.[184]\nRefreshed notification tray and quick settings pull-down.\nProject Volta, for battery life improvements.\nSearches can be performed within the system settings for quicker access to particular settings.\nLock screen provides shortcuts to application and notification settings.[185]\nGuest logins and multiple user accounts are available on more devices, such as phones.[186]\nAudio input and output through USB devices.\nThird-party applications regain the ability to read and modify data located anywhere on external storage, such as on SD cards. However, those must be adapted to the storage access framework of Android API level 21 or higher.[187][188]\nPinning of an application's screen for restricted user activity.[185]\nRecently used applications are remembered even after restarting the device.[185]\nWebViews receive updates independently through Google Play for security reasons, instead of relying on system-wide vendor updates.[189]\nAddition of 15 new languages: Basque, Bengali, Burmese, Chinese (Hong Kong), Galician, Icelandic, Kannada, Kyrgyz, Macedonian, Malayalam, Marathi, Nepali, Sinhala, Tamil and Telugu.[190]\nTap and Go allows users to quickly migrate to a new Android device, using NFC and Bluetooth to transfer Google Account details, configuration settings, user data and installed applications.[185]\nA flashlight-style application is included, working on supported devices with a camera flash.[185]\nUser-customizable priorities for application notifications.[191]\nSmart lock feature.[192]\nSELinux in enforcing mode for all domains.\nUpdated emoji.[193]\nImproved accessibility support (e.g. switch access support).[194][194]\nBlock-based over-the-air (OTA) updates for new devices.[195]\nTask listing access disabled for third-party applications"
}
