{
  "code":900,
  "date":"August 6, 2018",
  "changelog": "New user interface for the quick settings menu.[245]\nThe clock has moved to the left of the notification bar.[246]\nThe \"dock\" now has a semi-transparent background.[246]\nBattery Saver no longer shows an orange overlay on the notification and status bars.[245]\nA \"screenshot\" button has been added to the power options.[246]\nA new \"Lockdown\" mode which disables biometric authentication once activated.\nRounded corners across the UI.\nNew transitions for switching between apps, or activities within apps.\nRicher messaging notifications, where a full conversation can be seen within a notification, full-scale images, and smart replies akin to Google's new app, Reply.\nSupport for display cutouts.\nRedesigned volume slider.\nBattery percentage now shown in Always-On Display.\nLock screen security changes include the possible return of an improved NFC Unlock.\nExperimental features (which are currently hidden within a menu called Feature Flags) such as a redesigned About Phone page in settings, and automatic Bluetooth enabling while driving.\nDNS over TLS.[247]\nA new optional gesture-based system interface, allowing users to navigate the OS using swipes more often than the traditional UI.\nRedesigned multitask app switcher with the Google search bar and app drawer built-in.\nAndroid Dashboard, which tells the user how much time they are spending on their device and in apps, and allows the user to set time limits on apps.\n\"Shush\", an enhanced version of Do Not Disturb mode activated by placing the phone face down, which mutes standard notifications.\n\"Adaptive Battery\" prediction, which makes use of Doze to hibernate user apps the OS determines the user will not use.\nAuto-Brightness feature modifies screen brightness based on user habits.\nWind Down option lets Android users set a specific bedtime that enables Do Not Disturb and turns the entire phone's interface gray to discourage further use at night.\nVulkan 1.1 support.\nCall recording options fully disabled[248]"
}
