[
  {
    "args" : {
      "Builds" : "",
      "Removed devices" : "",
      "Supported devices" : "",
      "Initial devices" : "",
      "header" : "true"
    },
    "version" : "iPhone OS",
    "logs" : "",
    "date" : ""
  },
  {
    "args" : {
      "Build" : "1A543a",
      "Initial devices" : "iPhone (1st gen)"
    },
    "version" : "1.0",
    "logs" : "-   Installed apps:\n    -   Text app to send and receive SMS messages\n    -   Calendar app, for creating and viewing events\n    -   Photos app, to view photos taken\n    -   Camera app, to take pictures with the iPhone's camera\n    -   YouTube app, to view YouTube videos\n    -   Stocks app, to view stocks\n    -   Maps app, for directions\n    -   Weather app, to view weather in selected areas\n    -   Clock app, to set alarms, timers, and stopwatches\n    -   Calculator app\n    -   Notes app, to record notes\n    -   Settings app, for configuring device settings\n    -   Phone app, to initiate phone calls\n    -   Mail app, to send and receive emails\n    -   Safari app, for web browsing\n    -   iPod app, to play back music added to the iPhone via iTunes\n-   Other features\n    -   Ability to switch between [cellular networks](https://en.wikipedia.org/wiki/Cellular_network \"Cellular network\") ([EDGE](https://en.wikipedia.org/wiki/EDGE \"EDGE\") only) and [Wi-Fi](https://en.wikipedia.org/wiki/Wi-Fi \"Wi-Fi\").",
    "date" : "June 29, 2007"
  },
  {
    "args" : {
      "Build" : "1C25",
      "Supported devices" :"iPhone (1st gen)"
    },
    "version" : "1.0.1",
    "logs" : "-   Security update for Safari (including cross-site scripting, URL spoofing, and remote code execution)",
    "date" : "July 31, 2007"
  },
  {
    "args" : {
      "Build" : "1C28",
      "Supported devices" :"iPhone (1st gen)"
    },
    "version" : "1.0.2",
    "logs" : "-   Bug fixes:\n    -   Items deleted on a user's iPhone are no longer re-synced after they have been deleted.\n    -   Multi-line addresses can now be processed in Maps.\n    -   Custom ringtones are no longer lost when an iPhone is restored.\n\n*Official release notes only say: \"Bug fixes\". No official security notes.",
    "date" : "August 21, 2007"
  },
  {
    "args" : {
      "Builds" : "3A100a\n3A101a",
      "Initial devices" : "iPod Touch (1st gen)"
    },
    "version" : "1.1",
    "logs" : "Not available for iPhone.  \n-   Adds the iTunes Store app, allowing on-device purchase of music, movies, and ringtones.",
    "date" : "September 14, 2007"
  },
  {
    "args" : {
      "Builds" : "3A109a\n3A110a",
      "Supported devices" : "iPhone (1st gen)\niPod Touch (1st gen)"
    },
    "version" : "1.1.1",
    "logs" : "-   Added iTunes Wi-Fi Music Store\n-   Louder volume on speakerphone and receiver.\n-   Added home button double-click shortcut to phone favorites or to music controls.\n-   Double-tapping spacebar inserts a full-stop and space (\". \")\n-   Mail attachments can now be viewed in landscape, not just portrait.\n-   Stocks can be reordered in the Stocks app; cities can be reordered in the Weather app\n-   Battery level of the [iPhone Bluetooth Headset](https://en.wikipedia.org/wiki/IPhone_Bluetooth_Headset \"IPhone Bluetooth Headset\") is now shown in the status bar.\n-   Support for TV video out.\n-   Added \"Data Roaming\" on-off switch, to disable EDGE/GPRS when roaming internationally\n-   Changed time intervals for which the lock screen is disabled after repeated incorrect passcode inputs.\n-   Alert volume can be changed in Settings.\n-   The interface for the Calculator was redesigned.\n-   If the iPhone was jailbroken, all third-party apps installed through Installer.app are removed by the update.\n-   Fixes a bug that allowed an attacker in Bluetooth range to gain remote arbitrary code execution\n-   Fixes a bug where going to a link preceded by \"tel:\" in Mail will dial a phone number without confirmation\n-   Fixes a bug where disabling JavaScript in Safari would not take effect until Safari was restarted\n-   Fixes multiple bugs where visiting a malicious website led to cross-site scripting",
    "date" : "September 27, 2007"
  },
  {
    "args" : {
      "Build" : "3B48b",
      "Supported devices" : "iPhone (1st gen)\niPod Touch (1st gen)"
    },
    "version" : "1.1.2",
    "logs" : "-   iTunes now shows the device's current battery level.\n-   International language and keyboard support.\n-   Patched the TIFF security bug.\n-   Adds custom ringtone field.\n-   Bug fixes.",
    "date" : "November 12, 2007"
  },
  {
    "args" : {
      "Build" : "4A93",
      "Supported devices" : "iPhone (1st gen)\niPod Touch (1st gen)"
    },
    "version" : "1.1.3",
    "logs" : "Free update on iPhone, $19.95 fee on iPod Touch; commonly called the iPhone \"January '08 Update\" and January Software Upgrade by Apple.  \n-   Recent calls contact details now show most recent call times.\n-   'Locate Me' feature for Maps; determines the phone's approximate location using a combination of cellular triangulation and Wi-Fi data from Skyhook Wireless. Also adds hybrid map support, traffic information, and the 'Drop Pin' feature.\n-   Apps on the home screen can be rearranged and placed on multiple home screens (up to nine).\n-   iTunes gift cards can be redeemed on the iTunes Store.\n-   Movies downloaded through iTunes have chapter support.\n-   Music now supports lyrics.\n-   Web Clips can be added to (and subsequently removed from) the home screen.\n-   SMS messages can be sent to multiple contacts in the Messages app.\n-   SMS storage capacity increased from 1,000 to 75,000 messages.\n-   Defaults to IMAP for new Gmail accounts (formerly defaulted to POP3).\n-   Multi-touch keyboard (e.g. simultaneously pressing \"Shift\" + \"a\").\n-   The clock timer now remembers the last used options (bug fix).\n-   Incoming SMS messages now prompts the user to \"Close\" or \"Reply\" (formerly \"Ignore\" or \"Reply\"). Pressing either option now marks the message as \"seen\".\n-   Labels for contact data can now be deleted.\n-   Applications on the phone no longer run as root; they run as the user \"mobile\" instead.\n-   The ability to listen to music through a Bluetooth headset by going to Voicemail and choosing \"Bluetooth\" as the audio source no longer works (still works as long as phone is not locked or voicemail screen is active).\n-   Content on iPhone and iPod touch can now be manually managed in iTunes",
    "date" : "January 15, 2008"
  },
  {
    "args" : {
      "Build" : "4A102",
      "Supported devices" : "iPhone (1st gen)\niPod Touch (1st gen)"
    },
    "version" : "1.1.4",
    "logs" : "-   Bug fixes and enhancements.\n-   SMS scramble order fix.\n-   More carriers names now fit without scrolling (for roaming on other carriers).\n-   The camera received several performance improvements.\n-   Interface speed improvements.",
    "date" : "February 26, 2008"
  },
  {
    "args" : {
      "Build" : "4B1",
      "Supported devices" : "iPhone (1st gen)\niPod Touch (1st gen)"
    },
    "version" : "1.1.5",
    "logs" : "Security update for iPod Touch users who chose not to pay $9.95 to upgrade to the previously released iPhone OS 2.0.",
    "date" : "July 15, 2008"
  },
  {
    "args" : {
      "Build" : "5A347",
      "Supported devices" : "iPhone (1st gen)\niPod Touch (1st gen)",
      "Initial devices" : "iPhone 3G"
    },
    "version" : "2.0",
    "logs" : "*Initial release on iPhone 3G; $9.95 upgrade for iPod touch*\n\n-   Added language support.\n    -   Norwegian, Swedish, Danish, Finnish, Polish, Dutch, Korean, and Brazilian Portuguese are now supported on iPhone after having been available on iPod Touch since the version 1.1.1 update.\n    -   More keyboard languages including Chinese, Korean, and Russian.\n    -   Support for Traditional and Simplified Chinese handwriting recognition.\n-   Mail, contacts, calendars\n    -   Grouped settings.\n    -   Mail\n        -   Added support for Push e-mail.\n        -   Ability to select an outgoing email account within Mail application.\n        -   Support for blind carbon copy (BCC) in Mail.\n        -   Added the ability to move / delete multiple emails.\n        -   Added the ability to view Microsoft Office attachments.\n        -   Added the ability to view iWork attachments, including Pages, Numbers, and Keynote.\n    -   Contacts\n        -   Contacts icon on \"Home\" screen (iPhone only, it was formerly on the iPod Touch).\n        -   Ability to search contacts.\n        -   Global Address List.\n        -   Push contacts.\n        -   Ability to import SIM contacts.\n    -   Calendar\n        -   Multiple calendars supported in Calendar with colour-coding (desktop colours only preserved if using Mobile Me).\n        -   New \"Calendar\" section in \"Settings\".\n        -   Push calendar.\n-   Enterprise enhancements\n    -   Enforced security policies.\n    -   Device configuration.\n    -   Remote wipe.\n-   iPod app\n    -   Video can be shown in either landscape orientation (instead of just landscape left).\n    -   Videos in playlists and music videos can be shown in portrait or landscape orientation.\n    -   Sound fade-out when exiting a video.\n-   Other\n    -   App Store, a digital storefront allowing users to buy or download apps.\n    -   Certificates and Identities.\n    -   WPA2 / 802.1X.\n    -   Ability to turn Wi-Fi back on while in Airplane mode.\n    -   Cisco IPsec VPN support.\n    -   Ability to take screen captures.\n    -   Ability to save pictures from Safari or Mail to Photos.\n    -   Support for the Bonjour service discovery protocol.\n    -   Support for the SVG vector graphics format.\n    -   Addition of Parental controls.\n    -   Password letters are momentarily visible while typing.\n    -   Ability to turn Location Services on or off.\n    -   Applications that use Location Services now prompt user for confirmation 3 times.\n    -   Tapping status bar to scroll to top shortcut.\n    -   Updated calculator with extra features in portrait mode, a scientific calculator in landscape mode and an updated icon.\n    -   Updated iTunes with a new icon and reordered category icons within iTunes application.\n    -   Camera now supports Geotagging.\n    -   YouTube plugin for Safari.",
    "date" : "July 11, 2008"
  },
  {
    "args" : {
      "Build" : "5B108",
      "Supported devices" : "iPhone (1st gen)\niPhone 3G\niPod Touch (1st gen)"
    },
    "version" : "2.0.1",
    "logs" : "**Bug fixes**\n\n-   Performance and stability of the Contacts and Calendar applications dramatically improved.\n-   Performance while flipping into landscape mode in Safari has been improved.\n-   Performance in Mail app has been improved.\n-   Release improves application crash rates.\n-   Faster keyboard responsiveness.",
    "date" : "August 4, 2008"
  },
  {
    "args" : {
      "Build" : "5C1",
      "Supported devices" : "iPhone (1st gen)\niPhone 3G\niPod Touch (1st gen)"
    },
    "version" : "2.0.2",
    "logs" : "**Bug fixes**\n\n-   Improved the communication with 3G networks.\n-   Transition from music list to Cover Flow has changed.\n-   Tilt to left from landscape no longer switch to portrait when watching video, fixes 2.0 bug.\n-   The \"Update All\" button in the App Store's update tab has been removed.",
    "date" : "August 18, 2008"
  },
  {
    "args" : {
      "Builds" : "5F136\n5F137\n5F138",
      "Supported devices" : "iPhone (1st gen)\niPhone 3G\niPod Touch (1st gen)",
      "Initial devices" : "iPod Touch (2nd gen)"
    },
    "version" : "2.1",
    "logs" : "*Initial release on iPod Touch (2nd gen) (as 2.1.1); free of charge for iPod Touch users who upgraded to iPhone OS 2.0.'*\n\n-   Bug Fixes and Improvements\n    -   Security fix for the double-click home button exploit.\n    -   Fixed hangs and crashes for users with many third-party applications.\n    -   Faster installation speed and update speed of third-party apps.\n    -   Updating applications keeps their icons in place on the home screen.\n    -   Improvements to Mail stability.\n    -   Improved email reliability with POP and Exchange accounts.\n    -   Faster loading and searching of contacts.\n    -   Auto-correct now appears above the text instead of below (fixing a usability problem people were having where auto-correct would appear above the first row of keys).\n    -   Faster browsing in Safari, particularly when scrolling up or down on a web page.\n    -   Better battery life for most users.\n    -   Decrease in call set-up failures and calls dropping.\n    -   More accurate display of 3G signal strength.\n    -   Bug in the Calculator app that affected calculations involving Pi was fixed.\n-   24-hour clock is now usable with English (UK) language\n-   OS enhancements\n    -   Triple-click on the control button of headphones now jumps music to prior track played.\n    -   SMS app can alert up to two additional times if the user doesn't acknowledge an incoming text message (will play the alert sound/vibrate again after a period of time as if a new message just came in).\n    -   Update supporting languages.\n    -   Option to wipe all data from device after ten failed passcode attempts (after 5 attempts, the device will disable itself for 1 minute. After the 6th attempt, it will disable itself for 5 minutes. In the 10th attempt, it will wipe all data).\n    -   3G, EDGE, and GPRS indicators changed.\n    -   The camera can now be turned off within the restrictions page.\n    -   When taking a screenshot, there is now the camera shutter noise.\n    -   iPhone never gets locked when placed in dock or playing music.\n-   New application features\n    -   iPod: ability to create Genius playlists\n    -   More information provided within iPod Music lists (artist and album are now shown below song title when selecting music in addition to remaining time on podcasts).\n    -   More information is provided for audiobooks, such as displaying time left in active audiobook.\n    -   New podcasts and videos had \"filled\" blue bubbles next to them to indicate that they were new, now if the user has \"half-played\" a podcast or video, it will include a half filled blue bubble.\n    -   Sound from iPod now fades out if the user starts syncing device with iTunes.\n    -   Bookmarked home screen apps open in full screen.\n-   iPod Touch only\n    -   Settings for individual speaker sounds. Sounds can no longer be turned off en masse. All sounds must be turned off individually to mute sounds.\n    -   New speaker sound effect when sending mail.\n-   iPod Touch (2nd gen) only\n    -   Nike+iPod support.\n-   Improved the communication with 3G networks.\n-   Transition from music list to Cover Flow has changed.\n-   Tilt to left from landscape no longer switch to portrait when watching video, fixes 2.0 bug.\n-   The \"Update All\" button in the App Store's update tab has been removed.",
    "date" : "September 9-12, 2008"
  },
  {
    "args" : {
      "Builds" : "5G77\n5G77a",
      "Supported devices" : "iPhone (1st gen)\niPhone 3G\niPod Touch (1st gen)\niPod Touch (2nd gen)"
    },
    "version" : "2.2",
    "logs" : "*Free update for iPod Touch owners that upgraded to iPhone OS 2.0 or 2.1.*\n\n-   Maps\n    -   Google Street View.\n    -   Public transit and walking directions.\n    -   Display address of dropped pins.\n    -   Share location via email.\n    -   Cache of recent locations.\n-   Mail\n    -   Resolve isolated issues with scheduled fetching of email.\n    -   Improved formatting of wide HTML email.\n-   App Store\n    -   \"Categories\" section has been altered to display icons instead of a list.\n    -   Individual applications pages now have 'Tell A Friend' and 'Report A Problem' buttons.\n    -   In an app's description, multiple screen shots can now be viewed, instead of just one.\n    -   \"Update All\" button added to \"Updates\" section.\n    -   Option added to rate an application that is about to be deleted.\n    -   Improved touch response when purchasing or downloading an application.\n    -   Application icons display the install progress \"in place\" while updating, rather than on the last position of the page.\n-   Safari\n    -   Improved stability and performance of Safari.\n    -   Layout changes for the address bar in Safari\n-   iPod\n    -   The edit/clear icons on the on-the-go playlist have been changed.\n    -   Podcasts now are being shown in catalogs.\n    -   Users can no longer delete audiobooks via the device.\n    -   Audiobooks without artwork are now shown with a book icon instead of a note icon.\n-   Contacts\n    -   US phone numbers now group correctly (e.g., 1111 2222, formerly this would have shown as 1 111222 2).\n-   Other\n    -   Podcasts are now available for download or stream in the iTunes application (over Wi-Fi and cellular networks).\n    -   Decrease in call set-up failures and call drops.\n    -   Improved sound quality of visual voicemail messages.\n    -   Visual voicemail unavailability is shown in a screen instead of voicemail button not working.\n    -   Improved performance overall, especially noticeable in Notes and Camera applications.\n    -   Emoji for SoftBank users in Japan. Can also be enabled in all other countries using apps from the App Store.\n    -   Pressing the Home button from any Home screen goes to the first Home screen.\n    -   Preference to turn on/off keyboard auto-correction.\n    -   New languages are supported.\n    -   Shows Update/Restore progress when update using iTunes.\n    -   Security improvement.\n    -   Developers can pipe video out to an external device.\n    -   Better shift-key behavior.\n    -   Automatic WebClip icon change.\n    -   Locked screen screenshots.\n    -   Ability to record from devices connected through the dock port.\n-   iPod Touch (2nd gen) only\n-   Line-in recording / audio has been enabled through the headphone jack.\n    -   The Remote button has been added to Nike + iPod, allowing control of other devices, such as the Apple TV.",
    "date" : "November 21, 2008"
  },
  {
    "args" : {
      "Builds" : "5H11\n5H11a",
      "Supported devices" : "iPhone (1st gen)\niPhone 3G\niPod Touch (1st gen)\niPod Touch (2nd gen)"
    },
    "version" : "2.2.1",
    "logs" : "-   Fixed Safari crashes\n-   Images saved from Mail now appear correctly in the Camera Roll.\n-   Updates the baseband to patch security exploit that allowed unofficial SIM-unlock of the [iPhone 3G](https://en.wikipedia.org/wiki/IPhone_3G \"IPhone 3G\")\n-   iPod Touch only\n    -   Fixed issue that caused some Apple Lossless (ALAC) audio files to skip during playback.",
    "date" : "January 27, 2009"
  },
  {
    "args" : {
      "Build" : "7A341",
      "Supported devices" : "iPhone (1st gen)\niPhone 3G\niPod Touch (1st gen)\niPod Touch (2nd gen)",
      "Initial devices" : "iPhone 3GS"
    },
    "version" : "3.0",
    "logs" : "*Initial release on iPhone 3GS; paid $4.95 upgrade on iPod Touch*\n\n-   Cut, copy, paste added\n    -   Tap and hold for select/select all menu (copy menu in photos).\n    -   Double tap for cut/copy/paste menu all over iOS (SMS, email, Notes, etc.).\n        -   Two point draggable selection handles displayed to better make a selection.\n    -   Undo by shaking.\n    -   In Photos options menu select the copy button to select multiple photos to copy.\n-   More/System/Navigation\n    -   Turn-by-turn Navigation.\n    -   Lithium-ion polymer battery usage up to 5% better.\n    -   A-GPS accuracy improved (+5% better).\n    -   Earth magnetic compass support.\n        -   Compass App.\n-   Maps\n    -   Features iPhone users got in iPhone OS 2.2 were added for the iPod Touch in iPhone OS 3.0 (e.g. Google Street View, public transit and walking directions, displaying the address of a dropped pin, sharing location via email, and a cache of recent locations). Changed behavior when routing directions and showing steps.\n-   Stocks\n    -   Landscape mode that enabled viewing detailed price and change information by dragging one or two fingers across the full-screen chart.\n    -   Metadata display for detailed information about the symbol, including full company/fund name, market capitalization, price to earning ratio, dividend yield, and statistics about the day and year price range.\n    -   Table of news stories from various internet sources related to the selected symbol.\n-   YouTube\n    -   Can now log into account.\n        -   View subscriptions, Favorites, My Videos, History, and Playlists\n        -   Comment on videos, rate videos\n-   Phone\n    -   Recent Calls now show more details (call length, etc.).\n    -   Ability to change/set \"own number\" (my number) in the SIM card. Will be displayed in the Contacts list and iTunes, and possibly used for MMS identification.\n    -   Contacts are editable via Recent Calls.\n-   Photos\n    -   Videos can be trimmed directly from Camera app.\n    -   Photos options menu changed (new UI, added copy button).\n        -   Can now delete multiple photos at once.\n-   Camera\n    -   Video recording in Camera app.\n    -   Camera gets autofocus. To change focus target, users tap on a different object.\n    -   Thumbnail of the prior photo captured on the camera roll shortcut.\n-   Camera Roll\n    -   Categorization by All, Photos and Videos.\n-   App Store\n    -   Installs new apps from the second home page on. They can still be moved to the first homepage manually.\n    -   Screenshot browsing method has changed.\n-   SMS application renamed to Messages\n    -   Application icon was slightly modified, it no longer has the letters \"SMS\".\n    -   Sending progress bar has been moved to the title bar and does not cover up the screen.\n    -   Sending queue (compose a new message(s) while sending others).\n    -   Select single or multiple messages to forward or delete.\n    -   SMS entry text box have unlimited lines (actually limited by the screen).\n    -   MMS functionality including sending [vCards](https://en.wikipedia.org/wiki/VCard \"VCard\"), pictures, audio files, video (depends on mobile network availability).\n        -   Optional Subject line in the Messages settings.\n        -   Photos can be taken/sent directly from the Messages app.\n        -   MMS messages are played/viewed in the Messages app.\n-   Mail, contacts, calendars, MobileMe\n-   MobileMe now has a \"Find My iPhone\" option, allowing MobileMe users (via the online service) to remotely locate device and wipe data.\n    -   CalDAV Calendar support.\n    -   LDAP Contacts support.\n    -   iCalendar Subscription support.\n    -   \"Load Remote Image\" option for mail, to prevent spam.\n    -   iWork '09 attachment support.\n    -   Mail several photos in the same message.\n    -   Mail can now be composed in other apps without leaving the current app (only if the developer allows this).\n    -   It's now possible to store IM account information for a contact for the following services: AOL Instant Messenger, Yahoo! Messenger, MSN Messenger, ICQ, and XMPP.\n    -   Users can now view or create 'Invitees' on a Calendar event.\n-   Safari\n    -   Better support for Internet standards and now scores a 97/100 in the Acid3 test.\n    -   Renders JavaScript from 3 to 16 times faster depending on circumstances.\n    -   Support for HTML5.\n    -   New features in Settings such as AutoFill, and Anti phishing.\n    -   Pressing and holding a link gives three options: Open, Open in New Page and Copy.\n    -   View subscriptions.\n    -   The last page is now closable, which will result in a new blank page opening (won't save page info on exit, increases available memory).\n-   Bluetooth\n    -   Bluetooth enabled for iPod Touch (2nd gen).\n    -   AVRCP: Play/Pause/Stop for iPod app (no Next/Back yet).\n        -   Device side audio control still enabled but does not affect audio stream.\n    -   PBAP: wireless phone book access (for use with vehicle head units).\n    -   PAN: personal networking for tethering and ad hoc connections between mobile devices (multi-player gaming).\n-   iPod\n    -   Shake to shuffle songs in iPod app.\n    -   Search through iPod.\n    -   Scrubbing through tracks can now be done at 4 variable rates as user moves finger down the screen, and the speed is displayed on screen (\"Hi-Speed\", \"Half Speed\", \"Quarter Speed\", \"Fine\").\n    -   (When Bluetooth is enabled and a paired audio device is present) Audio output menu added to \"Now Playing\" screen and Home button iPod controls.\n    -   Location dot while playing video/music now glows while scrubbing the track/video.\n    -   Podcasts\n        -   More details shown: time remaining, etc.\n        -   Can be played at \"1â„2x\", 1x, or \"2x\" speed (actual speeds are 0.8x, 1x, and 1.5x).\n        -   30 second rewind button.\n        -   Can be emailed.\n-   Improved language support.\n    -   Added support for new languages such as Arabic, Greek, Hebrew, Indonesian, Malay, Portuguese, Romanian, Thai, and more.\n    -   Foreign language keyboards extended to cover additional characters.\n-   New Developer APIs\n    -   Push notifications for 3rd party applications.\n    -   Support for new Bluetooth services and profiles including A2DP, LDAP, peer-to-peer file sharing, and Bonjour\n    -   New APIs in the Maps application allow developers to build it into software.\n    -   Developers can now use the CoreLocation API to create applications with Turn-by-Turn Navigation.\n    -   API support for serial I/O through the Dock Connector.\n    -   3rd party apps now have access to iPod music library.\n    -   Support for outbound audio and video streaming.\n    -   In-App Purchase (IAP) API for paid applications (free apps always remain free).\n        -   Sign in with iTunes account.\n        -   Buy service subscriptions or app add-ons.\n-   Spotlight Search\n    -   Saves its last search results and offers options for excluding applications from searches.\n    -   Partial search for mail, iPod, contacts, events, notes, apps, and web clips.\n-   iTunes/sync.\n    -   iTunes version 8.2.\n    -   iTunes account creation on device.\n        -   Can now sign out of iTunes account and use a different iTunes account.\n        -   iTunes account info can be accessed and edited.\n        -   Can now read and write reviews for content on iTunes.\n        -   Movies, TV shows, audiobooks, and iTunes U content can now be purchased on iTunes Wi-Fi store.\n    -   Notes syncing.\n    -   Voice memos syncing (audio files added to a \"Voice Memos\" playlist).\n    -   Backups can now be encrypted and password protected.\n-   Tethering over USB and Bluetooth (depends on mobile network ability).\n    -   USB tethering auto activated when connected to USB on iTunes 8.2+ (if tethering is enabled in iPhone settings and by phone's carrier).\n    -   iTunes 8.2 now includes a USB driver for iPhone tethering.\n    -   Full access to iPhone possible while tethered.\n    -   (In Windows) iPhone shows up as a standard ethernet connection.\n-   Accessibility settings (for the visually/aurally impaired) (iPhone 3GS only).\n    -   VoiceOver gesture-based screen reader. Touch screen to hear a description of the item under your finger, then double-tap, drag, or flick to control iPhone. Speaks 21 languages and works with all apps.\n    -   Zoom, magnifies entire screen on any app up to 5 times normal size. Move left, right, up, and down to view any portion of the screen close-up.\n    -   White on Black, changes display to white on black (instead of the normal black on white), works in any app, and alongside Zoom and VoiceOver.\n    -   Mono Audio, if users hearing is limited in one ear, routes both right- and left-channel audio into both earbuds, so both channels can be heard in either ear.\n    -   Speak Auto-text, works with VoiceOver to automatically speak auto-corrections and auto-capitalizations.\n-   Other\n    -   Devices can now connect to Wi-Fi hotspots that use authentication automatically.\n    -   Locate Me for the iPod Touch accuracy improved.\n    -   Restrictions have been updated and now block \"Current Location\" and allows setting what content is appropriate for iPod music/videos/TV shows and apps.\n    -   11 home screen pages instead of 9. Now can store 180 apps (including native applications. i.e. Phone, iPod, Safari).\n    -   Adds Voice Control (ability to voice dial and control iPod).\n    -   Nike+ Support.\n    -   Stopwatch now shows both the total running time and the current lap time in the upper part of the clock app.\n    -   Landscape mode added to several applications---Messages (SMS), Mail, Stocks, Contacts, and Notes.\n    -   Right to left support.\n    -   Numeric battery percentage view.\n    -   Holding the home button will no longer force quit an unresponsive application. To force quit an application in 3.0 hold the sleep/wake button until the red power off slider appears. Then hold down the home button to quit the unresponsive application.\n    -   Screen captures are no longer numbered separately from photos taken with the camera application; all new images in the camera roll now use a common numbering sequence.\n    -   Allows app developers to access third-party accessories attached to iPhone\n    -   Voice Memos\n        -   New native app.\n        -   Voice memos can be trimmed directly from app.",
    "date" : "June 17, 2009"
  },
  {
    "args" : {
      "Build" : "7A400",
      "Supported devices" : "iPhone (1st gen)\niPhone 3G\niPhone 3GS\niPod Touch (1st gen)\niPod Touch (2nd gen)"
    },
    "version" : "3.0.1",
    "logs" : "-   Patched SMS vulnerability\n-   Bug fixes",
    "date" : "July 31, 2009"
  },
  {
    "args" : {
      "Build" : "7A400",
      "Supported devices" : "iPhone (1st gen)\niPhone 3G\niPhone 3GS\niPod Touch (1st gen)\niPod Touch (2nd gen)"
    },
    "version" : "3.0.1",
    "logs" : "-   Patched SMS vulnerability\n-   Bug fixes",
    "date" : "July 31, 2009"
  },
  {
    "args" : {
      "Builds" : "7C144\n7C145\n7C146",
      "Supported devices" : "iPhone (1st gen)\niPhone 3G\niPhone 3GS\niPod Touch (1st gen)\niPod Touch (2nd gen)",
      "Initial devices" : "iPod Touch (2nd gen 8GB)\niPod Touch (3rd gen)"
    },
    "version" : "3.1",
    "logs" : "*Initial release on iPod Touch (2nd gen 8 GB) and iPod Touch (3rd gen). Version 3.1.1 on iPod Touch (3rd gen). Free for iPhone OS 3.0 users; $4.95 for iPod Touch users who stayed on iPhone OS 2.0*\n\n-   Improved Wi-Fi for iPhone 3G with Bluetooth turned on.\n-   Ask to Join Networks toggle is hidden unless Wi-Fi is on.\n-   Faster boot up time and various speed improvements.\n-   Trimming video clips on the iPhone 3GS now offers the ability to save the edited version as a copy rather than simply overwriting the original file.\n-   Safari now has a toggle for \"Fraud Protection\" under its Settings pane.\n-   The Bulgarian keyboard now uses the Bulgarian State/National Standard layout instead of the QWERTY layout.\n-   On iPod Touch (2nd gen) the Voice Memos app now successfully records audio if a microphone is connected after starting the application.\n-   Numbers inside Notes have more options when tap and hold is triggered: Call, Text Message, Create New Contact, Add to Existing Contact.\n-   Voice control over Bluetooth is now available, allowing users to initiate calls and control music playback via Bluetooth headsets (however, voice control while plugged into car audio systems no longer works).\n-   Improves reception.\n-   Fast forward and rewind from headphones.\n-   Improved Exchange calendar syncing.\n-   Home screens can be customized on iTunes 9.\n-   Developer Extras.\n    -   Improvements to OpenGL and Quartz.\n    -   APIs allow third party apps to access videos and edit them.\n        -   Gives programmers their choice of video recording quality.\n    -   A pair of new app interface classes that are known to relate to graphics, but which haven't had their functions identified.\n-   New camera APIs.\n-   Calendar event alerts will be shown also with a pop-up, much like push notifications.\n-   Enables connectivity to devices for development purposes wirelessly instead of needing tethering via the dock connector.\n-   Ability to save videos from Mail or MMS.\n-   Ability to copy and paste full quality videos from camera into email.\n-   Anti-phishing in Safari.\n-   Under usage tab in settings, can view data sent and received over tethering.\n-   Instruments over Wi-Fi.\n-   New enhancements to Core Audio in iPhone.\n-   Failover support for HTTP live streaming.\n-   iPod Touch (3rd gen) features:\n    -   Voice control\n    -   Accessibility features from iPhone 3GS, such as VoiceOver.\n-   Accessibility features can be toggled on or off by triple-clicking the Home button.\n-   Option to practice VoiceOver gestures.\n-   Fixed an issue that caused app icons to display incorrectly.\n-   Genius Mixes.\n-   Genius Recommendations for Apps.\n-   Sync videos to albums.\n-   iTunes U content organization.\n-   Redeem Gift Cards in App Store.\n-   Display available iTunes account credit.\n-   Enhanced iTunes support.\n-   Ability to copy and paste telephone numbers in dialer application.\n-   Sponsored links in Maps.\n-   Direct copy of contact info.\n-   Bug fixes.\n-   Security improvements.\n-   Now fully supports device encryption for Exchange.\n-   Uses a new baseband which patches the exploit formerly used to unlock the iPhone 3G/3GS.\n-   Adds separate usage metering for tethering data.",
    "date" : "September 9, 2009"
  },
  {
    "args" : {
      "Build" : "7D11",
      "Supported devices" : "iPhone (1st gen)\niPhone 3G\niPhone 3GS\niPod Touch (1st gen)\niPod Touch (2nd gen)\niPod Touch (2nd gen 8GB)\niPod Touch (3rd gen)"
    },
    "version" : "3.1.2",
    "logs" : "-   Attempt to resolve sporadic issue that may cause iPhone / iPod Touch to not wake from sleep.\n-   Fixes intermittent issue that may interrupt cellular network services until restart.\n-   Fixes bug that could cause occasional crash during video streaming.",
    "date" : "October 8, 2009"
  },
  {
    "args" : {
      "Build" : "7E18",
      "Supported devices" : "iPhone 3G\niPhone 3GS\niPod Touch (2nd gen)\niPod Touch (2nd gen 8GB)\niPod Touch (3rd gen)",
      "Removed devices" : "iPhone (1st gen)\niPod Touch (1st gen)"
    },
    "version" : "3.1.3",
    "logs" : "*Final release supported on iPhone (1st gen) and iPod Touch (1st gen)*\n\n-   Improves accuracy of reported battery level on iPhone 3GS.\n-   Fixes issue where third-party apps would not launch in some instances.\n-   Fixes bug that may cause an app to crash when using the Japanese Kana keyboard layout.\n-   Fixes security bugs in Core Audio, ImageIO, Recovery Mode and WebKit.\n-   Uses a new baseband which patches an exploit formerly used for jailbreaking the iPhone 3G/3GS.",
    "date" : "February 2, 2010"
  },
  {
    "args" : {
      "Build" : "7B367",
      "Initial devices" : "iPad (1st gen)"
    },
    "version" : "3.2",
    "logs" : "*Initial release on iPad (1st gen).*\n\n-   Initial support for landscape home screens.\n-   Includes new frameworks for recognizing custom gestures, custom keyboards, etc.\n-   Allows display output to an externally connected display for compatible 3rd party apps.\n-   Allows user to change home screen background.\n-   Adds Terrain view in Maps application.\n-   Location-based services rely on Apple's own databases instead services of Google and Skyhook Wireless.\n-   Allows transferring files between a computer and the device for a shared (per app) document store that all applications can access (iOS file sharing). Only available for the iPad.\n-   Allows use of Apple Bluetooth keyboard (possibly other keyboards).\n-   Includes a built-in dictionary which can be used in iWork, iBooks, and possibly other apps.\n-   The Dock can now hold up to six icons.\n-   The iPod app allows users to create and name custom playlists.\n-   Safari's new thumbnail view allows users to navigate to up to nine active pages (similar to Top Sites on Safari for [OS X](https://en.wikipedia.org/wiki/OS_X \"OS X\")).\n-   Places in the Photos app allows the user to view their photos by location (needs iPhoto '09).\n-   720p HD videos are available in the YouTube app.\n-   Share YouTube videos to Facebook.\n-   Wallpaper support for iPad (1st Generation).",
    "date" : "April 3, 2010"
  },
  {
    "args" : {
      "Build" : "7B405",
      "Supported devices" : "iPad (1st gen)"
    },
    "version" : "3.2.1",
    "logs" : "-   Better Wi-Fi connection.\n-   Bug fix in Mail so it does not crash any more when doing copy-and-paste from a one-page PDF document.\n-   Bug fix in Video playback so that videos no longer freeze in certain situations.\n-   Better reliability when using the iPad Dock Adapter to VGA.\n-   Added Bing as a search engine in Safari.",
    "date" : "July 15, 2010"
  },
  {
    "args" : {
      "Build" : "7B500",
      "Supported devices" : "iPad (1st gen)"
    },
    "version" : "3.2.2",
    "logs" : "-   Patches PDF exploit which allowed jailbreaking through Safari.",
    "date" : "August 11, 2010"
  },
  {
    "args" : {
      "Builds" : "",
      "Removed devices" : "",
      "Supported devices" : "",
      "Initial devices" : "",
      "header" : "true"
    },
    "version" : "iOS",
    "logs" : "",
    "date" : ""
  },
  {
    "args" : {
      "Build" : "8A293",
      "Supported devices" : "iPhone 3G\niPhone 3GS\niPod Touch (2nd gen)\niPod Touch (2nd gen 8GB)\niPod Touch (3rd gen)\niPad (1st gen)",
      "Initial devices" : "iPhone 4"
    },
    "version" : "4.0",
    "logs" : "*Initial release on [iPhone 4](https://en.wikipedia.org/wiki/IPhone_4 \"IPhone 4\")*\n\n*Drops support for [iPhone (1st gen)](https://en.wikipedia.org/wiki/IPhone_(1st_gen) \"IPhone (1st gen)\") and [iPod Touch (1st gen)](https://en.wikipedia.org/wiki/IPod_Touch_(1st_gen) \"IPod Touch (1st gen)\")*\n\n-   Multitasking \n    -   User interface for app switching by double clicking Home button.\n    -   Portrait orientation lock.\n    -   iPod control widget.\n-   FaceTime direct video calling ability over Wi-Fi (iPhone 4 and later, iPod Touch (4th gen), and OS X users).\n-   iBooks sync support through iTunes for iPhone and iPod Touch.\n-   iAd mobile advertising network.\n-   Settings\n    -   App-specific location settings.\n    -   Cellular data toggle (on-off).\n    -   \"Complex Password\" setting: passwords with alphabet characters and numbers.\n    -   Simple Passcode Lock (4 digit number) option.\n    -   New wallpapers.\n    -   Wallpaper available for Home screen.\n    -   New wallpaper preview for Home screen and lock screen.\n    -   Support for Internet tethering.\n    -   New Gmail and Exchange icons in Mail, Contacts, Calendars account settings.\n    -   Support multiple Exchange accounts.\n    -   Custom Dictionary.\n    -   Airplane Mode for iPod Touch.\n    -   Separated Sounds settings from General settings.\n-   Home screen\n    -   Ability to categorize apps into folders with default folder naming based on category name in App Store.\n    -   Up to 2,160 instead of 180 visible apps (12 apps per folder).\n    -   Folder name supports up to 13 characters.\n    -   Custom Home screen wallpaper.\n    -   Dock redesigned to that of the iPad dock.\n    -   Rate on deleting app removed.\n    -   Default Utilities folder which contains the Clock, Calculator, Voice Memos and Compass apps.\n    -   Revised scrolling on the Home Screen.\n-   Camera\n    -   Up to 5x digital (as opposed to optical) zoom feature on the Camera app.\n    -   Tap to focus during video.\n-   Photos\n    -   Categorized by Albums, Faces, Events and Places (under iPhoto in OS X).\n    -   Support landscape mode.\n-   Camera Roll\n    -   Support landscape mode.\n-   App Store\n    -   Ability to gift apps.\n-   Maps\n    -   Unified \"locate me\" icon.\n    -   Background location icon shown on status bar.\n-   iPod\n    -   Playlist creation on device.\n    -   Nested playlists.\n    -   Lyrics and Podcast info in Settings.\n    -   Bluetooth headsets now support volume control.\n    -   Album art displayed in Album view.\n-   Notes\n    -   Notes syncing with MobileMe, Gmail IMAP and Yahoo! Mail.\n    -   Accounts management appears if syncing is enabled.\n    -   Notes setting below Mail, Contacts, Calendars Settings if syncing is enabled.\n    -   Moved search box into title bar.\n-   Calendar\n    -   Birthday calendar.\n    -   CalDAV invitations.\n    -   Ability to edit which calendar an event is located in after the initial saving.\n    -   Ability to select any combination of calendar categories to view.\n-   Contacts\n    -   Unified info by linking contacts from different accounts.\n    -   CardDAV.\n    -   Streamlined \"New Contact\" screen.\n-   Spotlight\n    -   Search on the Web or Wikipedia.\n    -   Search Messages.\n-   Safari\n    -   Bing is now an official search option, along with Google and Yahoo!.\n    -   Recent searches below search field.\n    -   Top hit in search.\n    -   Suggestions appear below search field for all 3 search engines.\n    -   Unified \"Search\" keyboard button when search field being used.\n    -   In-page audio playback.\n-   Voice control\n    -   The ability to ask what the current time is.\n-   YouTube\n    -   Rotate and zoom videos in vertical and horizontal position.\n    -   Latest 480p for smoother and quicker video playback.\n-   Accessibility\n    -   Larger fonts in Contacts, Mail, Messages and Notes.\n-   Message\n    -   Include a Search bar.\n    -   Character count (can be enabled or disabled in Settings > Messages screen).\n    -   Failed SMS notification.\n    -   Option to toggle off the ability to send group messages.\n-   Added a new app dock\n-   Mail\n    -   Unified inboxes.\n    -   Edit from outbox.\n    -   Support for multiple Exchange accounts.\n    -   File and delete Mail search results.\n    -   Organize by thread in Mail.\n    -   Quick look attachments.\n    -   Open attachments by registered filetype with corresponding apps from the App Store.\n    -   Smart links for dates and addresses.\n    -   Contact pictures in emails.\n    -   Create Calendar events from dates within emails.\n-   International\n    -   Spell check.\n    -   Added Cangjie and Wubihua keyboards for Simplified and Traditional Chinese.\n    -   Text replacement between Simplified and Traditional Chinese.\n    -   Switch keyboard shortcut (holding the \"Earth\" button on keyboard for a while).\n    -   Added support for Danish voice control.\n    -   New languages added (Catalan, Hungarian, Vietnamese).\n-   Other\n    -   Support for Apple Bluetooth keyboards.\n    -   Persistent Wi-Fi.\n    -   Added support for iBooks application.\n    -   Wake on wireless.\n    -   Auto-join and auto-login and IPv6 on individual Wi-Fi networks setting.\n    -   Enhanced data protection.\n    -   Wireless app distribution.\n    -   Mobile device management.\n    -   SSL VPN support (both Juniper and Cisco).\n    -   Microsoft Exchange Server 2010 support.\n    -   Improved Bluetooth driver for A2DP devices.\n    -   Improved iOS animations.",
    "date" : "June 21, 2010"
  },
  {
    "args" : {
      "Build" : "8A306",
      "Supported devices" : "iPhone 3G\niPhone 3GS\niPhone 4"
    },
    "version" : "4.0.1",
    "logs" : "*iPhone only*\n\n-   Updated carrier signal strength display.\n    -   Increase in the length of the smaller signal bars.\n    -   The method in which signal strength is calculated was modified.\n-   Fixed Exchange ActiveSync issues.\n-   Only official SIM card number can be used for FaceTime identification.",
    "date" : "July 15, 2010"
  },
  {
    "args" : {
      "Build" : "8A400",
      "Supported devices" : "iPhone 3G\niPhone 3GS\niPhone 4\niPod Touch (2nd gen)\niPod Touch (2nd gen 8GB)\niPod Touch (3rd gen)"
    },
    "version" : "4.0.2",
    "logs" : "-   Patches a PDF exploit which allowed jailbreaking through Safari.",
    "date" : "August 11, 2010"
  },
  {
    "args" : {
      "Build" : "8B117",
      "Supported devices" : "iPhone 3G\niPhone 3GS\niPhone 4\niPod Touch (2nd gen)\niPod Touch (2nd gen 8GB)\niPod Touch (3rd gen)"
    },
    "version" : "4.1",
    "logs" : "-   Improved calendar colors.\n-   Bug fixes\n    -   iPhone 4 proximity sensor issues.\n    -   Bluetooth connectivity.\n    -   Improved performance on iPhone 3G.\n    -   Nike + iPod fixes and the Retina Display (iPhone 4 only).\n    -   Fixes white balance issue with iPhone 4 under certain lighting conditions.\n    -   Fixes FaceTime error where iPhone 3G and iPhone 3GS users could enter \"facetime://\" URLs in Safari.\n-   Game Center.\n-   Security updates to accessibility, FaceTime, ImageIO and WebKit.\n-   Enables FaceTime call connection via email contacts (e.g. for iPod Touch (4th generation) users who won't have a phone number) and through favorites.\n-   Nike + iPod statistics submissions over Wi-Fi.\n-   High dynamic range imaging (HDR) (only available for the iPhone 4).\n-   High-definition video uploads over Wi-Fi; iPhone 4 and iPod Touch (4th generation) only.\n-   iTunes adds iTunes Ping, a social music network and discovery tool (only available in countries with iTunes Store).\n-   TV show rentals (only available for iTunes US Store).\n-   Can move an existing appointment from one calendar to another.\n-   Notes syncing removed from iPhone 3G due to reported performance problems.\n-   Restores Field test mode.",
    "date" : "September 8, 2010"
  },
  {
    "args" : {
      "Build" : "8C148",
      "Supported devices" : "iPhone 3GS\niPhone 4\niPod Touch (3rd gen)\niPad (1st gen)",
      "Removed devices" : "iPhone 3G\niPod Touch (2nd gen)"
    },
    "version" : "4.2.1",
    "logs" : "*Final release supported on iPhone 3G and iPod Touch (2nd generation)*\n\n-   Bug fixes\n    -   Birthdays calendar does not display birthdays starting more than 77 years ago.\n    -   Fixes glitch that can let a user get into the Phone app while the phone is locked via \"Emergency Call\" by dialing a random number and quickly pressing the lock button after dialing that call.\n    -   Fixes the alarm bug caused by daylight saving time changing, affected on a part of iPhone and iPod Touch owners living in various countries.\n-   AirPlay (replacement of AirTunes, AirPlay will offer stream video, music, and photos over Wi-Fi).\n-   AirPrint wireless printing with Print Center (select models).\n-   Import .ics calendar files directly for events.\n-   Improved battery performance.\n-   Birthdays icon has been changed in the Calendar app.\n-   Text search on web pages.\n-   2 new fonts for Notes in Settings (Helvetica and Chalkboard).\n-   Added support for Chinese URL over Safari.\n-   Added an indicator in the App Store which shows if an app supports Game Center.\n-   Support for CoreMIDI.\n-   YouTube voting.\n-   Minor improvements in UI graphics.\n-   New parental controls for deleting apps, changing mail accounts and location services.\n-   The font size of text in Calendar can now be changed in the Accessibility settings.\n-   Security fixes.\n-   Network-controlled fast dormancy implemented in baseband to improve battery life and reduce network congestion.\n-   Fixes intermittent Wi-Fi issues in iOS 4.2 beta 3, which remained in the iOS 4.2 GM.\n-   Fixes Voice over IP (VoIP) issues.\n-   Find My iPhone location feature is free (iPhone 4, iPod Touch (4th generation), and iPad) running on iOS 4.2.1.\n-   iOS 4 features for iPad (multitasking, folders, etc.).\n    -   Up to 4,400 icons instead of 220 (20 apps a folder).\n-   Updated carrier signal strength display (3G iPad only).\n    -   Increase in the length of the smaller signal bars.\n    -   The method in which signal strength is calculated has been enhanced.\n-   Additions to the multitasking tray.\n    -   Brightness.\n    -   Volume control.\n    -   AirPlay controls.\n    -   Screen rotation lock switch.\n-   Physical iPad screen rotation lock switch is converted into a sound/silent switch in iOS 4.2 (just like on the iPhones), with a virtual screen rotation lock switch added to the multitasking tray.\n-   More than 30 new keyboards and dictionaries, including Arabic, Greek, and Hebrew.\n-   New animation for Multitasking.\n-   New bookmarks design (iPhone and iPod Touch only).\n-   Additions to multitasking tray.\n    -   Volume controls.\n    -   AirPlay controls.\n-   New Voice Memos icon.\n-   Ability to initiate FaceTime calls from Voice Control.\n-   FaceTime shortcut from Messages app (iPhone 4 only).\n-   New text tone alerts (New and Original tone lists) (iPhone 4 only).\n-   Ringer and alerts on/off switch (Settings > Sounds) for volume buttons (iPhone only).\n-   Assign different text tone alerts to each contact.\n-   Restores full field test mode.",
    "date" : "November 22, 2010"
  },
  {
    "args" : {
      "Build" : "8E128",
      "Supported devices" : "iPhone 4"
    },
    "version" : "4.2.5",
    "logs" : "*Initial release on iPhone 4 (CDMA, Verizon version); deployed to demo and review units only, wasn't publicly released.*\n\n-   Adds Personal Hotspot.",
    "date" : "January 11, 2011"
  },
  {
    "args" : {
      "Build" : "8E200",
      "Supported devices" : "iPhone 4"
    },
    "version" : "4.2.6",
    "logs" : "**CDMA (Verizon) iPhone 4 only; released before the device's launch.**\n\n*Bug fixes*\n\n-   Bug fixes for Personal Hotspot.",
    "date" : "January 31, 2011"
  },
  {
    "args" : {
      "Build" : "8E303",
      "Supported devices" : "iPhone 4"
    },
    "version" : "4.2.7",
    "logs" : "**CDMA (Verizon) iPhone 4 only**\n\n-   Security update.\n-   Baseband update.",
    "date" : "April 14, 2011"
  },
  {
    "args" : {
      "Build" : "8E401",
      "Supported devices" : "iPhone 4"
    },
    "version" : "4.2.8",
    "logs" : "**CDMA (Verizon) iPhone 4 only**\n\n*Bug fixes*\n\n-   Reduced size of the iOS crowd-sourced location database cache.\n-   No longer backs the cache up to iTunes.\n-   Deletes it entirely when Location Services is turned off.",
    "date" : "May 4, 2011"
  },
  {
    "args" : {
      "Build" : "8E501",
      "Supported devices" : "iPhone 4"
    },
    "version" : "4.2.9",
    "logs" : "**CDMA (Verizon) iPhone 4 only; security update.**\n\n-   Fixed two PDF exploits that can lead to crashes or arbitrary code execution.\n-   Fixed a privilege escalation issue.",
    "date" : "July 15, 2011"
  },
  {
    "args" : {
      "Build" : "8E600",
      "Supported devices" : "iPhone 4"
    },
    "version" : "4.2.10",
    "logs" : "**CDMA (Verizon) iPhone 4 only; security update.**\n\n-   Fixes a security issue with certificate validation.",
    "date" : "July 25, 2011"
  },
  {
    "args" : {
      "Builds" : "8F190\n8F191",
      "Supported devices" : "iPhone 3GS\niPhone 4\niPod Touch (3rd gen)\niPod Touch (4rd gen)\niPad (1st gen)",
      "Initial devices" : "iPad (2nd gen)"
    },
    "version" : "4.3",
    "logs" : "*Initial release on [iPad (2nd gen)](https://en.wikipedia.org/wiki/IPad_2 \"IPad 2\")*\n\n*Drops support for [iPhone 3G](https://en.wikipedia.org/wiki/IPhone_3G \"IPhone 3G\") and [iPod Touch (2nd generation)](https://en.wikipedia.org/wiki/IPod_Touch_(2nd_generation) \"IPod Touch (2nd generation)\")*\n\n-   AirPlay video support for third party apps.\n-   HTTP Live Streaming statistics.\n-   New font in Notes app (\"Noteworthy\").\n-   Improved Safari performance with the Nitro JavaScript engine.\n-   Redesigned \"account\" section under the Store menu.\n-   Ability to switch on automatic downloads (for iTunes Music and App Store applications).\n-   Location services have been shifted from General to Settings menu.\n-   New parental controls for use with iTunes Ping.\n-   New menu for scrubbing in videos.\n    -   Fine scrubbing: adjust by seconds / frames.\n    -   Quarter scrubbing: second.\n    -   Half speed scrubbing: adjust by minute(s).\n    -   Hi-speed scrubbing: run fast through minutes.\n-   Ability to cancel and delete an app which is currently downloading. Before iOS 4.3, it was only possible to delete an app which had already downloaded.\n-   Stream from an iTunes library to iOS using Home Sharing.\n-   In-app purchases always ask for a password, even if one was entered before.\n-   Internal system clock gets network time updated more often via NITZ (part of the official GSM standard since phase 2+ release 96) and gives a more accurate time for the device, it updates about every five days (iPhone only).\n-   Personal Hotspot feature (Wi-Fi hotspot with up to 5 simultaneous devices (Wi-Fi hotspot iPhone 4 only) on supported carriers.\n-   Ability to set the number of times a text tone repeats (up to 10 times).\n-   In field test mode refresh button has been removed and updated information has been displayed in bottom of the screen (it updates every 4--6 seconds).\n-   Slideshow options moved to Photos app.\n-   New look for taking a picture for a Contact.\n-   When receiving a text message, the iPhone now vibrates 2 times.\n-   Some SMS tones have been shortened (iPod Touch only).\n-   New FaceTime icon (iPod Touch (4th generation) only).\n-   Added FaceTime command in voice control (iPod Touch (4th generation) only).\n-   New look for taking a picture for a Contact (iPod Touch (4th generation) only).\n-   SMS App access through <sms:num> links is disabled (iPad only).\n-   Ability to choose function of iPad's physical switch between rotation lock or mute.\n-   Fullscreen iAd banner format.\n-   Photo Booth and FaceTime app bug fixes (iPad (2nd gen) only).\n-   Fixed issue that prevented controls from being dismissed in some cases.\n-   Addressed issue where the keyboard could not be brought back when highlighting and swiping through search results.\n-   VoiceOver now reads the entire chart in Stocks app while in landscape mode.\n-   Fixed slideshow stop after 15 images when using AirPlay.\n-   Enabled traffic volume indicator for IE (iPhone and iPad Wi-Fi + 3G only).\n-   Fixed canceled recurring calendar events still showing on the event list.\n-   Fixed deleting a recurring event make the alarm go away.\n-   Fixed all-day alarm fired an hour early.\n-   Fixed missing accented letters in European keyboard popups.\n-   Increase font size for China and Pinyin inputs.\n-   Fixed auto-correction issue when switch back from Emoji to English keyboard.\n-   Fixed orientation of mail application not following device orientation under specific conditions.\n-   Fixed mail message view and orientation when quickly selecting a message and hitting edit mode.\n-   Fixed MMS messages with vCards scrolling up.\n-   Added Address Space Layout Randomization (ASLR).\n-   Added new icon for Wi-Fi tethering for personal hotspot on status bar.\n-   Fixed issue that caused Safari and other apps to crash after loading certain heavy Web sites.\n-   Fixed Personal Hotspot password failure with 22+ characters.\n-   Added support for \"find\" in Safari.\n-   Fixed wallpaper titles for VoiceOver.",
    "date" : "March 9, 2011"
  },
  {
    "args" : {
      "Build" : "8G4",
      "Supported devices" : "iPhone 3GS\niPhone 4\niPod Touch (3rd gen)\niPod Touch (4rd gen)\niPad (1st gen)\niPad (2nd gen)"
    },
    "version" : "4.3.1",
    "logs" : "*Bug fixes*\n\n-   Fixed graphics glitches on iPod Touch (4th generation).\n-   Baseband updates for the iPhone 3GS and iPad (1st generation).\n-   Fixed memory hang that results in memory corruption when reading large files from USIM filesystem.\n-   Fixed problem with NTLM authentication in apps and on websites.\n-   Fixed issue with the Springboard and 3rd party apps not recognizing the gyroscope on the iPad (2nd gen).\n-   Fixed connection and activation issues with some cellular networks.\n-   Fixes image flicker with the Apple Digital AV Adapter.\n-   Fixes an issue authenticating with some enterprise web services.\n-   Changes the behavior of the battery percentage.",
    "date" : "March 25, 2011"
  },
  {
    "args" : {
      "Builds" : "8H7\n8H8",
      "Supported devices" : "iPhone 3GS\niPhone 4\niPod Touch (3rd gen)\niPod Touch (4rd gen)\niPad (1st gen)\niPad (2nd gen)"
    },
    "version" : "4.3.2",
    "logs" : "*Bug fixes*\n\n-   Fixed graphics glitches on iPod Touch (4th generation).\n-   Baseband updates for the iPhone 3GS and iPad (1st generation).\n-   Fixed memory hang that results in memory corruption when reading large files from USIM filesystem.\n-   Fixed problem with NTLM authentication in apps and on websites.\n-   Fixed issue with the Springboard and 3rd party apps not recognizing the gyroscope on the iPad (2nd gen).\n-   Fixed connection and activation issues with some cellular networks.\n-   Fixes image flicker with the Apple Digital AV Adapter.\n-   Fixes an issue authenticating with some enterprise web services.\n-   Changes the behavior of the battery percentage.",
    "date" : "April 14, 2011"
  },
  {
    "args" : {
      "Builds" : "8J2\n8J3",
      "Supported devices" : "iPhone 3GS\niPhone 4\niPod Touch (3rd gen)\niPod Touch (4rd gen)\niPad (1st gen)\niPad (2nd gen)"
    },
    "version" : "4.3.3",
    "logs" : "*Bug fixes*\n\n*This update contains changes to the iOS crowd-sourced location database cache:*\n\n-   Data is kept for a shorter amount of time.\n-   Cache is no longer backed up to iTunes\n-   Cache is deleted when Location Services is turned off.\n\nUsers can no longer remove apps that have not been completely downloaded.",
    "date" : "May 4, 2011"
  },
  {
    "args" : {
      "Build" : "8K2",
      "Supported devices" : "iPhone 3GS\niPhone 4\niPod Touch (3rd gen)\niPod Touch (4rd gen)\niPad (1st gen)\niPad (2nd gen)"
    },
    "version" : "4.3.4",
    "logs" : "-   Re-introduced the ability to cancel or delete apps that are currently downloading.\n-   Security fixes for jailbreaking exploits.\n-   Fixed two PDF exploit that can cause crashes or unauthorized code execution.\n-   Disabled \"incomplete signing attacks\", blocking \"Untethered\" jailbreak.",
    "date" : "July 15, 2011"
  },
  {
    "args" : {
      "Build" : "8L1",
      "Supported devices" : "iPhone 3GS\niPhone 4\niPod Touch (3rd gen)\niPod Touch (4rd gen)\niPad (1st gen)\niPad (2nd gen)"
    },
    "version" : "4.3.5",
    "logs" : "*Security Update*\n\n*Final version of iOS 4 for iPhone 3GS, iPhone 4, iPod Touch, iPad (1st generation), iPad (2nd gen), and iPod Touch (3rd and 4th generations).*\n\n-   Fixes security issue with certificate validation.",
    "date" : "July 25, 2011"
  },
  {
    "args" : {
      "Build" : "9A334",
      "Supported devices" : "iPhone 3GS\niPhone 4\niPod Touch (3rd gen)\niPod Touch (4rd gen)\niPad (1st gen)\niPad (2nd gen)",
      "Initial devices" : "iPhone 4S"
    },
    "version" : "5.0",
    "logs" : "*Initial release on iPhone 4S*\n\n-   All notifications concentrated to Notification Center: swipe downwards from the status bar to open it. Notification center shows a list of all notifications and widgets (widgets available only on iPhone and iPod Touch).\n    -   Notification order can be arranged.\n    -   Choose Notification Type: Banner notifications, the classic pop-up notifications, or no notification at all (selectable on an app-by-app basis).\n    -   Notification list on lock screen. Swipe an icon to unlock and go to the specific notification.\n    -   Notifications announcing earthquakes with 2 minutes (only in Japan).\n-   Messages\n    -   Messaging between all iOS devices running iOS 5 through Wi-Fi or 3G. Allows to send text, photos, videos, contacts, and locations.\n    -   All iMessages and conversations will be synced between all iOS devices linked under a single Apple ID. A conversation can be started on one device and continued on another.\n    -   Can message between multiple people simultaneously (group messaging).\n    -   Shows when other person(s) is typing.\n    -   Delivery receipts.\n    -   Optional read receipts (enable in Settings).\n    -   Animated GIF image support for iMessage.\n    -   Ability to set how many times an alert will be shown when a new message is received (ranges from once to ten times).\n    -   The name of the person that responds appears in small light blue text directly above the response when SMS is sent to a group.\n    -   Slight redesign for text messages. Font and time-stamp layout.\n    -   Hide keyboard; hidden by downwards scrolling in message screen (after being used to type a message). Unhidden again by tapping in text entry field.\n-   Newsstand\n    -   A new icon on the Home Screen, which opens to an iBooks-inspired folder which shows all papers and magazines downloaded from the App Store.\n    -   Subscriptions to newspapers and magazines available for browsing and downloading in a dedicated section of the App Store, stored in the Newsstand folder.\n-   Reminders\n    -   \"To-Do list\" functionality in Reminders app.\n    -   Date-based reminder notifications.\n    -   Location-based reminder notifications that can be set to when the user leaves, or arrives at a specified area.\n-   Twitter integration\n    -   Tweeting from native applications: Photos, Camera, YouTube, Maps, and Safari using new Tweet Sheet which supports multiple accounts.\n-   Music\n    -   iPod app now split and renamed to Music and Videos (iPhone and iPad only; was always split on the iPod Touch).\n    -   Video podcasts can only be found in the Videos app.\n    -   Ability to play content while the device is synchronizing with iTunes.\n    -   Ability to delete songs from device (by swiping over the corresponding song).\n    -   Tap and hold on a song to view extended song information (iPhone and iPod Touch only).\n    -   Long names scrolling in now playing.\n    -   Album artwork now displays in full resolution (Retina Display only) on Now Playing screen.\n    -   Broadcast songs information on devices (e.g. car stereo) when connected over Bluetooth.\n    -   Improved Sound Check for Music.\n    -   \"Group by Album Artist\" option for Music.\n    -   iTunes Store button has been added to the Music app.\n    -   Removed ability to view lyrics (on iPad).\n-   Camera\n    -   Volume-up key as shutter release button to take photos (also works using headphone remote volume up button). Also works for starting/stopping recording of videos.\n    -   Shortcut to Camera app from lock screen, accessed by double-clicking the home button (iPhone 3GS and later and iPod Touch 4th generation only).\n    -   Grid composition aide (3x3).\n    -   Spread to zoom-in, pinch to zoom-out.\n    -   Swipe left to reveal camera roll.\n    -   Tap and hold to lock/unlock Auto Exposure and Auto Focus.\n    -   Options button added, HDR toggle and Grid composition aide toggle.\n    -   New Camera button on Photos app that returns to Camera instead of a \"Done\" button (was on OS before this) to close the Camera Roll.\n    -   Face detection and video stabilization.\n-   Maps\n    -   Print maps.\n    -   Alternate routes.\n-   Calendar\n    -   Can now create, rename, and delete calendars right on the device.\n    -   Tap and hold or double-tap to create a new event.\n    -   Tap and hold in \"all-day events\" to create a new all-day event.\n    -   Drag appointments to a new time slot.\n    -   Drag handles to change start and end times.\n    -   Creating new Event, now an \"Invitees\" field; takes to screen for multiple email address entry, emails sent to all invitees once event is saved.\n        -   Invitee can \"Accept\"/\"Decline\"/\"Maybe\"; reply sent to iCloud servers then reflected for all invitees to see.\n        -   Calendar event on device lists those invitees accepting event.\n        -   All users on iOS 5.x devices get notification when event is nearing.\n    -   Ability to specify a time zone to events.\n    -   Ability to add URLs to events.\n    -   Current time on Calendar if in landscape mode.\n    -   Navigate in day view by swiping.\n    -   Event attachments can now be viewed directly in the app.\n    -   Share calendars through iCloud with friends and family. Edits made by subscribers to that calendar are updated and pushed to other subscribers of that calendar (can be disabled by the creator of the calendar and locked so others cannot make edits).\n    -   Japanese or Buddhist calendars support.\n-   Mail\n    -   Rich text formatting (bold, italics, and underline).\n    -   Indentation control.\n    -   Ability to mark multiple mail items as read.\n    -   Ability to flag emails.\n    -   Draggable mail address in the recipients field.\n    -   Alert if the subject line is blank.\n    -   Search now includes body of messages.\n    -   Delete mails while in Airplane mode.\n    -   Exchange ActiveSync Email can now be deleted offline.\n    -   Can create new email folders.\n    -   Mail sidebar.\n    -   S/MIME support.\n    -   Ability to show 1000 recent messages; 25 message option removed.\n    -   Ability to create additional @me.com email address within the Mail settings.\n    -   Ability to increase quote level in Mail settings.\n    -   New and updated tiny icons on Mail for Windows Live Mail, Gmail, Exchange, etc.\n    -   Hotmail accounts now have new icons and folders.\n    -   While reading an email the user can swipe right to open a list of messages and swipe left to bring back the open email message again.\n    -   If the user has multiple email accounts configured in Mail.app, swipe left or right from one's mailboxes folder list, it will take the user to another account's mailboxes.\n    -   Support for three popular Chinese email services: Tencent's QQ Mail, and Netease's 163.com and 126.com mail inboxes.\n-   Photos\n    -   Built-in basic photo editing: crop, red-eye, auto-enhance and rotate photos.\n    -   Ability to create and edit local photo albums folders (only those that aren't synced with iTunes).\n    -   Ability to sync pictures taken on one iOS device automatically with other iOS 5 devices using Photo Stream.\n    -   Ability to select all when adding pictures to an album.\n    -   Slight re-design for video time-line under Photos app.\n-   Safari\n    -   Safari Reader: new \"Reader\" icon appears in address bar if Safari detects a webpage article, removing need to click-through to each page. Scrollable window sheet appears over current webpage showing all article pages together separated by page breaks, removing ads and page clutter.\n    -   Ability to change font size in reader mode.\n    -   Reading List: a new area of the bookmarks window has been added, purposed for pages the user might want to read later. New pages can be added from a new option in the action menu or when long-pressing on a link.\n    -   Items from the Reading List can be synced to iCloud to be pushed to all of the user's other iOS devices.\n    -   Safari bookmarks can be synced to iCloud.\n    -   Ability to open pages in background or in new page (change in Settings).\n    -   Ability to replace a word with a word from a list of similarly spelled words spellings when typing in a text box on a web page.\n    -   Private Browsing; interface colours change from blue to black (change in Settings).\n    -   Ability to remove custom website data.\n    -   CSS fixed position support.\n    -   Slight fade out at end of long URLs (instead of ellipses) in the address bar.\n    -   HTML5 drawing is faster.\n    -   Kinetic scrolling within text fields in Safari.\n-   iCloud\n    -   iTunes, iBooks (books and progress), App Store, Photo, Contacts, Calendar, Notes, Reminders, Mail, Safari (Bookmarks and Reading List), Settings, app data, iWork, and backup data; saved in iCloud to automatically or manually download to all linked devices (iOS and Mac/Windows PCs).\n    -   All iMessages and conversations will be synced between all iOS devices linked under a single Apple ID. The user can start a conversation on one device and continue it on another.\n    -   Backup home screen layout on iCloud.\n    -   Document sync.\n    -   Ability to buy more storage.\n    -   Free upgrade to 256 kbit/s bit rate for iTunes purchased songs if backing up on iCloud.\n    -   File names in iCloud Storage are case-sensitive.\n    -   Documents/data can now be selected to sync with iCloud account.\n    -   Option to disable iCloud Sync via cellular network to save cost, especially if roaming.\n-   Game Center\n    -   Photos for Friends.\n    -   Ability to make the user's Profile public or private.\n    -   Points in Game Center: shows how many points the user has on the home screen of Game Center.\n    -   Sort and view Friends on the basis of Points.\n    -   Friend recommendations.\n    -   Game recommendations.\n    -   Games can be purchased from within Game Center.\n    -   New Friend requests screen.\n    -   Native support for turn based games.\n-   Settings\n    -   Help Center: learn more about every option under settings app to explore more about it.\n    -   New menu under Location Services, named System Services, where some services can be toggled on or off (such as setting the time-zone, location-based iAds, Diagnostics, etc.).\n    -   Hearing Aid Mode.\n    -   Ability to rename the device.\n    -   Ability to set up an AirPort base station or Time Capsule devices.\n    -   Ability to organise Notification Center items \"Manually\" or \"By Time\".\n    -   Can select which apps can be included in Notification Center.\n    -   Can select which type of notification will be used for each app: banner notification, classic pop-up style notification, or no notification.\n    -   Ability to turn off app badges.\n    -   On the \"Ringtone\" and \"Text Tone\" page, instead of showing \"new\", they are all in one category now.\n    -   Custom sounds for New Message, New Voicemail, New Mail, Sent Mail and Reminders alerts.\n    -   Ability to purchase text, email, and voicemail alert tones.\n    -   Under \"Mail, Contacts, Calendars\", on the bottom it shows \"Reminders\" and gives an option to Sync.\n    -   In the \"Messages\" section, the \"Alerts\", \"Show Preview\", and \"Repeat Alert\" options have been removed.\n    -   The Usage screen is improved and now shows how much of the memory is consumed by each app.\n    -   Storage usage clean up.\n    -   Backup to iCloud shortcut added.\n    -   Software Update menu added. This allows easier and faster updating of devices independently, without a computer with iTunes installed; the update downloads directly to the iOS device; needs Wi-Fi or cellular network connection.\n    -   Photo Stream settings.\n    -   New purchases Settings; automatically download new purchases made on other devices (for music, apps, and books). This can also be enabled or disabled for use on cellular when not connected to Wi-Fi.\n    -   Twitter sign-in OS-wide with support for multiple Twitter accounts.\n    -   Ability to set left or right for mono audio.\n    -   Ability to turn on/off sending of iOS diagnostic data to Apple.\n-   Keyboard\n    -   Ability to create keyboard shortcuts to replace custom phrases. By default includes \"omw\" which expands to \"On my way!\".\n    -   Emoji keyboard no longer needs an app to enable it (regarding non-Japanese devices).\n    -   Define the user's own words in Offline Dictionary.\n    -   New keyboard with prominent # (hash-tag) and @ (mention) buttons for Twitter app similar to the \".com\" button when entering an address into the Safari address bar.\n    -   New Chinese-Pinyin keyboard spreading.\n    -   Quick Chinese input method.\n    -   List of associated words show on the top of Chinese input keyboard.\n    -   Function to convert voice to text\n-   PC-Free\n    -   iTunes/USB no longer needed to activate new devices via a computer.\n    -   New welcome screen when using the device for the first time (or after resetting a device).\n    -   Ability to start fresh with no need to tether it to iTunes. Option to restore all data on a device from an iCloud backup through a simple [iCloud](https://en.wikipedia.org/wiki/ICloud \"ICloud\") sign in.\n    -   Ability to wirelessly sync to iTunes over Wi-Fi added (an initial tethered sync is needed to pair them together and the setting must be enabled in iTunes).\n    -   [OTA](https://en.wikipedia.org/wiki/Over-the-air_programming \"Over-the-air programming\") [delta](https://en.wikipedia.org/wiki/Delta_encoding \"Delta encoding\") updates: from iOS 5 forward, devices can now self-update the system software right on the device itself through Wi-Fi or 3G; no iTunes or computer needed.\n-   YouTube\n    -   Ability to play 480p/720p videos over 3G (iPhone only).\n    -   Scrolling titles for YouTube videos.\n    -   Seek bar fine scrubbing visual notification has been added.\n-   FaceTime\n    -   Improved video quality.\n    -   Ability to set the FaceTime caller-ID to be the user's email or phone number.\n    -   Ability to mirror the FaceTime call on large screen.\n-   iTunes/App Store\n    -   iTunes Tone Store.\n    -   New Purchased History section.\n    -   Genius support for finding songs and apps similar to ones users have purchased formerly.\n    -   Ability to completely disable in-app purchases.\n    -   iTunes password prompt.\n    -   Restrictions with password needed for purchases if enabled.\n    -   Shows \"Install\" instead of the price for formerly purchased apps. Shows \"Installed\" for installed apps.\n    -   Additional \"iForgot\" button on App Store if a user has forgotten their Apple ID password.\n    -   Simultaneous app downloads.\n    -   Custom tones for almost everything under \"Sounds\" with \"Buy more tones\" button.\n    -   Music app now has a \"Store\" button that goes to the iTunes Store.\n-   Contacts\n    -   Add family relations (\"related names\") to contacts.\n    -   Add social media info into contacts.\n-   VoiceOver\n    -   VoiceOver item chooser.\n    -   VoiceOver action support.\n    -   Arabic language support for VoiceOver.\n    -   Option to speak text selection.\n    -   New voices for VoiceOver.\n-   Bluetooth\n    -   AVRCP 1.4 supported (sends track and artist info to supported devices).\n-   Minor improvements/bug fixes\n    -   New rounded UI switch graphic.\n    -   Ability to use the device while syncing.\n    -   Spotlight search now includes Reminders and searches through Messages.\n    -   Built-in system-wide dictionary; in the typical Cut/Copy/Paste pop-up when selecting text, there is a new option to \"Define\". Define brings up a view with definition of the selected word.\n    -   Ability to delete app data.\n    -   Fixed a bug that caused a song to crash for a second while switching to another application in the multitasking tray.\n    -   Apps fade to home screen when they crash, rather than flicking off.\n    -   Option to automatically set the time (new for Wi-Fi-only devices).\n    -   Switching the ringer switch to \"on\", the indicator now shows the volume level bar (iPhone and iPad only).\n    -   Screenshots are saved using the device's orientation (formerly, all screenshots were saved as if the device was in portrait mode).\n    -   [Hindi](https://en.wikipedia.org/wiki/Hindi \"Hindi\") virtual keyboard based on standard [InScript](https://en.wikipedia.org/wiki/InScript_keyboard \"InScript keyboard\") layout. (iPhone and iPod Touch only).\n-   Notification Center\n    -   Option to display Stock and Weather widgets in Notification Center. Swipe weather left or right to get five-day forecast.\n-   Calendar\n    -   Week view in landscape orientation.\n-   Clock\n    -   Ability to pause Timer.\n    -   Tbilisi, Georgia added to World Clock.\n-   Weather\n    -   Weather for user's current location.\n    -   Hourly updated weather of 5-day forecasts.\n-   Stocks\n    -   Real-time stock updates.iPhone only\n-   Siri voice control. Classed as beta software during whole of iOS 5.x.\n    -   Voice commands are now executable for different users on device.\n    -   Device can now translate voice into text and vice versa.\n    -   Available in English (UK, US, and Australia), French, and German.\n-   Phone\n    -   Enable/disable option for voice-dial if the device is set to security with passcode lock.\n    -   Delete individual calls in \"Recents\" Phone app. Clear button is now Edit button.\n    -   Make FaceTime calls without a micro-SIM card.\n    -   \"Unsecured Calls\" warning lets users know if they are talking on unencrypted networks.\n    -   Shows city name or area/county in addition to number for unknown calls.\n    -   Time-mid call invitation alerts.\n-   Messages\n    -   Option to have iMessages sent as SMS when iMessage is unavailable (enable in Settings).\n    -   Placeholder text indicates whether sending \"iMessage\" or \"Text Message\" (i.e. SMS/MMS message) in Messages.\n    -   SMS/MMS bubbles are green in colour, iMessage bubbles are baby blue.\n-   General\n    -   Customised vibrate alert patterns (can be set per-contact).\n    -   LED flash alerts. \n    -   Assistive touch gestures (iPod Touch only).\n-   New \"Message\" option to use iMessage using an email ID, in Settings (for iPod Touch and iPad only).\n-   Keyboard\n    -   Split keyboard: swipe up or pull apart to split keyboard in half.\n    -   Undock keyboard option: keyboard can now be moved up and down the screen.\n-   Mail\n    -   Swipe right to reveal Inbox when in portrait orientation.\n-   Calendar\n    -   Swipe left and right to change months.\n    -   Year view with heat map colours to show busy/free status.\n-   Safari\n    -   Tabbed browsing.\n    -   Tapping and holding the back or forward buttons in Safari will show recently visited website history.\n    -   Tapping and holding the new tab button will show a list of recently closed tabs.\n-   Music\n    -   All-new user interface.\n    -   Quickly skip to prior or next track by swiping left or right (respectively) on album art when in the Now Playing screen in the Music app.\n-   Picture frame\n    -   Ability to pick an event.\n-   Multitasking gestures with 4 or 5 fingers: (iPad (2nd gen) only until iOS 5.0.1)\n    -   Pinch to return to the Home screen.\n    -   Swipe up to open multitasking tray.\n    -   Swipe left or right to move between open apps.\n-   AirPlay mirroring\n    -   Ability to connect with AirPlay to an Apple TV; whatever is displayed on an iOS devices screen is mirrored on the TV.\n-   Videos\n    -   Ability to play 1080p content.",
    "date" : "October 12, 2011"
  },
  {
    "args" : {
      "Builds" : "9A405\n9A406",
      "Supported devices" : "iPhone 3GS\niPhone 4\niPhone 4S\niPod Touch (3rd gen)\niPod Touch (4rd gen)\niPad (1st gen)\niPad (2nd gen)"
    },
    "version" : "5.0.1",
    "logs" : "*Bug fixes, security update*\n\n-   Fixes several battery drain bugs.\n-   Fixes bugs affecting iCloud mail push.\n-   Adds multitasking gestures (for original iPad).\n-   Fixes Documents in the Cloud bugs.\n-   Better voice recognition for Australian English (Dictation feature).\n-   Contains security improvements.\n-   Activates the LED camera flash, whether the speaker is muted or not, for incoming calls and messages, when activated within the Accessibility sub-menu.\n-   Introduces a new way for developers to specify files that should not be backed up.iPhone 4S only (Build 9A406)\n-   Attempts to fix \"Invalid Sim\" and \"No SIM card installed\" issues.\n-   Baseband update.",
    "date" : "November 10, 2011"
  },
  {
    "args" : {
      "Builds" : "9B176\n9B179",
      "Supported devices" : "iPhone 3GS\niPhone 4\niPhone 4S\niPod Touch (3rd gen)\niPod Touch (4rd gen)\niPad (1st gen)\niPad (2nd gen)",
      "Initial devices" : "iPad (3rd gen)"
    },
    "version" : "5.1",
    "logs" : "*Initial release on iPad (3rd generation).*\n\n-   App Store\n    -   App Store download limit over 3G was increased to 50 MB from 20 MB.\n-   Clock\n    -   \"Sleep iPod\" function in clock application changed to \"Stop Playing\", this function also works for applications other than Music.\n-   Camera\n    -   Redesigned Camera app (for iPad). \n    -   Camera shortcut on lock screen now always present, and has a new slide-up gesture to activate (iPhone and iPod Touch only). \n    -   Face detection and video stabilization \n    -   Camera face detection now highlights all detected faces \n-   General\n    -   License column added under the About menu.\n    -   Improved Location Services.\n-   Maps\n    -   Minor UI changes in Maps.\n-   Music\n    -   Fixed slowdown when changing to landscape (Cover Flow) in Music app.\n    -   Shake-to-shuffle bug fix, which formerly caused the Music app to freeze.\n    -   Smart playlists bug fix.\n    -   Added Genius Mixes and Genius playlists for iTunes Match subscribers.\n    -   Added controls to change playback speed and rewind by 30 seconds to Podcasts (iPad).\n-   Network\n    -   Baseband updates for some devices.\n    -   Carrier updates (e.g. AT&T 12.0, Verizon 12.0).\n    -   4G icon shown when on AT&T's HSPA+ network\n    -   Fixes iPhone 4S support for Caller ID Name Display (on supported carriers -- e.g. Rogers and Fido in Canada).\n    -   Restores the 3G switch\n-   Phone\n    -   Combined Voice/Data Roaming Switch (on iPhone).\n-   Photos\n    -   Added the ability to delete photos from Photo Stream.\n-   Safari\n    -   Safari address bar now has \"Go to this address\" instead of a blank bar.\n    -   Bookmarks list no longer automatically displayed on browser opening if there are no open pages in Safari.\n-   Security Updates\n    -   A string format exploit in an application named racoon that allowed executing unsigned code at boot-up is fixed.\n    -   A ROP exploit that allowed executing payloads vnimage is now fixed.\n    -   A flaw that was executed by mounting a maliciously crafted disk image and may lead to a device shutdown or arbitrary code execution is now fixed.\n    -   A logic issue with debug system calls that could bypass the iOS sandbox restrictions is fixed.\n    -   WebKit security updates.\n    -   A format string vulnerability related to the handling of virtual private network (VPN) configuration files is now fixed.\n    -   CFNetwork security updates.\n-   Siri\n    -   Enhanced Siri dictation support during text input \"on supported devices\" (iPhone 4S in 2011, iPad (3rd generation) in 2012).\n    -   Japanese language support for Siri (availability may be limited during initial rollout).\n-   Video\n    -   TV shows and movies have better audio quality and are louder (on iPad).\n-   Other\n    -   Setup Assistant bug fix.\n    -   Attempts at fixing battery life; results are mixed.\n    -   Bluetooth status bar indicator bug fix.\n    -   Improved Assistive Touch.\n    -   Fixed bug that allowed nested folders (folders within folders), including Newsstand.\n    -   Fixed bug that caused stuck keys on Apple Bluetooth Keyboards during wakeup from low power states.\n    -   Redesigned fonts for a few non-Latin languages.",
    "date" : "March 7, 2012"
  },
  {
    "args" : {
      "Builds" : "9B206\n9B208",
      "Supported devices" : "iPhone 3GS\niPhone 4\niPhone 4S\niPod Touch (3rd gen)\niPod Touch (4rd gen)\niPad (1st gen)\niPad (2nd gen)\niPad (3rd gen)"
    },
    "version" : "5.1.1",
    "logs" : "*Final release supported on iPad (1st generation) and iPod Touch (3rd generation)*\n\n*Bug fixes, security update*\n\n-   Fixes battery drain bug.\n-   Fixes HDR bug when taking photos using the Lock Screen shortcut.\n-   Fixes bugs with the automatic switching between 2G and 3G networks\n-   Fixes bugs with AirPlay video playback\n-   Fixes bugs with Safari bookmarks and Reading List syncing.\n-   Fixes bug where an \"Unable to purchase\" popup appeared even after a successful purchase.\n-   Added a decline button to calls.\n-   Podcast playback position now synced between iOS devices (presumably via iCloud).iPhone 4 and iPhone 4S only\n-   Attempt to fix bugs with echoes in calls.",
    "date" : "May 7, 2012"
  },
  {
    "args" : {
      "Builds" : "10A403\n10A405\n10A406",
      "Supported devices" : "iPhone 3GS\niPhone 4\niPhone 4S\niPod Touch (4rd gen)\niPad (2nd gen)\niPad (3rd gen)",
      "Initial devices" : "iPhone 5\niPod touch (5th gen)\niPad mini (1st gen)\niPad (4th gen)"
    },
    "version" : "6.0",
    "logs" : "*Final release supported on iPad (1st generation) and iPod Touch (3rd generation)*\n\n*Bug fixes, security update*\n\n-   Fixes battery drain bug.\n-   Fixes HDR bug when taking photos using the Lock Screen shortcut.\n-   Fixes bugs with the automatic switching between 2G and 3G networks\n-   Fixes bugs with AirPlay video playback\n-   Fixes bugs with Safari bookmarks and Reading List syncing.\n-   Fixes bug where an \"Unable to purchase\" popup appeared even after a successful purchase.\n-   Added a decline button to calls.\n-   Podcast playback position now synced between iOS devices (presumably via iCloud).iPhone 4 and iPhone 4S only\n-   Attempt to fix bugs with echoes in calls.*Initial release on [iPhone 5](https://en.wikipedia.org/wiki/IPhone_5 \"IPhone 5\"), [iPod touch (5th generation)](https://en.wikipedia.org/wiki/IPod_Touch_(5th_generation) \"IPod Touch (5th generation)\"), [iPad mini (1st generation)](https://en.wikipedia.org/wiki/IPad_Mini_(1st_generation) \"IPad Mini (1st generation)\"), and [iPad (4th generation)](https://en.wikipedia.org/wiki/IPad_(4th_generation) \"IPad (4th generation)\")*\n\n*Drops support for [iPad (1st generation)](https://en.wikipedia.org/wiki/IPad_(1st_generation) \"IPad (1st generation)\") and [iPod Touch (3rd generation)](https://en.wikipedia.org/wiki/IPod_Touch_(3rd_generation) \"IPod Touch (3rd generation)\")*\n\n-   Introduces Apple Maps, to replace Google Maps.\n-   Siri can now tell you sport related information.\n-   Facebook has now been integrated into Settings.\n-   FaceTime calls can now be done over cellular data on iPhone 4S, iPhone 5, and iPad 3 (Wi-Fi + Cellular).\n-   Do Not Disturb can be activated to suppress incoming calls and notifications.\n-   Adds a Reply with Message feature if a call is declined.\n-   Adds the Clock app to the iPad.\n-   Custom vibrations can be set for alerts on iPhone.\n-   Fixes a bug that allows a local attacker to learn what third-party app was in use before the device was locked.\n-   Fixes bugs that allowed a local attacker to bypass a device locked with a passcode.\n-   Fixes a bug that allowed a local attacker to initiate a FaceTime call on a locked device.\n-   Fixes a bug that allowed users to make purchases without inputting Apple ID credentials.\n-   Fixes a bug that caused SMS messages to disrupt cellular connectivity.",
    "date" : "September 19, 2012"
  },
  {
    "args" : {
      "Builds" : "10A523\n10A525\n10A8426",
      "Supported devices" : "iPhone 3GS\niPhone 4\niPhone 4S\niPhone 5\niPod Touch (4rd gen)\niPod touch (5th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)"
    },
    "version" : "6.0.1",
    "logs" : "-   Fixes a bug that prevented iPhone 5 from installing updates wirelessly.\n-   Fixes a bug that prevented camera flash from activating.\n-   Fixes a bug that prevented cellular connectivity from being available.\n-   Fixes a bug that allowed a maliciously crafted website to execute arbitrary code",
    "date" : "November 1, 2012"
  },
  {
    "args" : {
      "Builds" : "10A550\n10A551\n10A8500",
      "Supported devices" : "iPhone 5\niPad mini (1st gen)"
    },
    "version" : "6.0.2",
    "logs" : "**[iPhone 5](https://en.wikipedia.org/wiki/IPhone_5 \"IPhone 5\") and [iPad mini (1st generation)](https://en.wikipedia.org/wiki/IPad_Mini_(1st_generation) \"IPad Mini (1st generation)\") only**\n\n-   Fixes a bug that prevented Wi-Fi from working",
    "date" : "November 1, 2012"
  },
  {
    "args" : {
      "Builds" : "10B141\n10B142\n10B143\n10B144",
      "Supported devices" : "iPhone 3GS\niPhone 4\niPhone 4S\niPhone 5\niPod Touch (4rd gen)\niPod touch (5th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)"
    },
    "version" : "6.1",
    "logs" : "-   Adds support for more [LTE](https://en.wikipedia.org/wiki/LTE_(telecommunication) \"LTE (telecommunication)\") cellular carriers\n-   Integrates [Siri](https://en.wikipedia.org/wiki/Siri \"Siri\") and [Fandango](https://en.wikipedia.org/wiki/Fandango_(company) \"Fandango (company)\") to allow Siri to purchase movie tickets (U.S. only).\n-   Adds the Reset Advertising Identifier button in Settings.\n-   iTunes Match subscribers can download individual songs from iCloud.",
    "date" : "January 28, 2013"
  },
  {
    "args" : {
      "Build" : "10B145",
      "Supported devices" : "iPhone 4S"
    },
    "version" : "6.1.1",
    "logs" : "**[iPhone 4S](https://en.wikipedia.org/wiki/IPhone_4S \"IPhone 4S\") only**\n\n-   Improves cellular reliability for iPhone 4S.",
    "date" : "February 11, 2013"
  },
  {
    "args" : {
      "Builds" : "10B146\n10B147",
      "Supported devices" : "iPhone 3GS\niPhone 4\niPhone 4S\niPhone 5\niPod Touch (4rd gen)\niPod touch (5th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)"
    },
    "version" : "6.1.2",
    "logs" : "-   Fixes a bug in Exchange calendar that increased network activity and reduced battery life",
    "date" : "February 19, 2013"
  },
  {
    "args" : {
      "Build" : "10B329",
      "Supported devices" : "iPhone 3GS\niPhone 4\niPhone 4S\niPhone 5\niPod Touch (4rd gen)\niPod touch (5th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)"
    },
    "version" : "6.1.3",
    "logs" : "-   Fixes a bug that allowed a passcode lock screen bypass to access the Phone app.\n-   Improves the Maps app in Japan.\n-   Fixes a bug that allowed a user to execute unsigned code.",
    "date" : "March 19, 2013"
  },
  {
    "args" : {
      "Build" : "10B350",
      "Supported devices" : "iPhone 5"
    },
    "version" : "6.1.4",
    "logs" : "**[iPhone 5](https://en.wikipedia.org/wiki/IPhone_5 \"IPhone 5\") only**\n\n-   Fixes a speakerphone bug for iPhone 5",
    "date" : "May 2, 2013"
  },
  {
    "args" : {
      "Build" : "10B400",
      "Supported devices" : "iPod Touch (4rd gen)"
    },
    "version" : "6.1.5",
    "logs" : "**[iPod Touch (4th generation)](https://en.wikipedia.org/wiki/IPod_Touch_(4th_generation) \"IPod Touch (4th generation)\") only**\n\nFixes a bug for iPod Touch 4 that caused FaceTime calls to fail.",
    "date" : "November 14, 2013"
  },
  {
    "args" : {
      "Build" : "10B500",
      "Removed devices" : "iPhone 3GS\niPod Touch (4th gen)"
    },
    "version" : "6.1.6",
    "logs" : "**[iPhone 3GS](https://en.wikipedia.org/wiki/IPhone_3GS \"IPhone 3GS\") and [iPod Touch](https://en.wikipedia.org/wiki/IPod_Touch \"IPod Touch\") (4th generation) only**\n\n*Final release supported on [iPhone 3GS](https://en.wikipedia.org/wiki/IPhone_3GS \"IPhone 3GS\") and [iPod Touch (4th generation)](https://en.wikipedia.org/wiki/IPod_Touch_(4th_generation) \"IPod Touch (4th generation)\")*\n\n-   Fixes the infamous `goto fail;` [SSL](https://en.wikipedia.org/wiki/Transport_Layer_Security \"Transport Layer Security\") verification bug.",
    "date" : "February 21, 2014"
  },
  {
    "args" : {
      "Builds" : "11A465\n11A466",
      "Supported devices" : "iPhone 4\niPhone 4S\niPhone 5\niPod touch (5th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)",
      "Initial devices" : "iPhone 5C\niPhone 5S"
    },
    "version" : "7.0",
    "logs" : "*Initial release on [iPhone 5C](https://en.wikipedia.org/wiki/IPhone_5C \"IPhone 5C\") and [iPhone 5S](https://en.wikipedia.org/wiki/IPhone_5S \"IPhone 5S\")*\n\n*Drops support for [iPhone 3GS](https://en.wikipedia.org/wiki/IPhone_3GS \"IPhone 3GS\") and [iPod Touch (4th generation)](https://en.wikipedia.org/wiki/IPod_Touch_(4th_generation) \"IPod Touch (4th generation)\")*\n\n-   [UI](https://en.wikipedia.org/wiki/User_interface \"User interface\")\n    -   Added support for 64-bit apps. The 32-bit subsystem loads when launching a 32-bit app as the 64-bit subsystem is now used with this version and future versions of iOS.\n    -   Revamped the UI and UX and every icon to have a more flat and simple design. This was meant to move away from [skeuomorphism](https://en.wikipedia.org/wiki/Skeuomorph \"Skeuomorph\") in from past versions a(exceptions do exist -- for a move towards more skeuomorphism, see for example the Countdown with a new skeuomorphic 3D animation of a spinning wheel).\n    -   System [Helvetica](https://en.wikipedia.org/wiki/Helvetica \"Helvetica\") Neue Regular font.\n    -   Full Screen apps that make use of the system status bar and navigation bar.\n    -   [Translucent](https://en.wikipedia.org/wiki/Translucent \"Translucent\") design in tab bar, navigation bar, status bar, system keyboard, Control Center, and Notification Center (some translucent layers not on the iPhone 4, the iPad 2 and the iPad 3 due to hardware constraints).\n    -   Opaque design in Alert view, Action Sheet and Share Sheet.\n    -   Borderless buttons in general.\n    -   Back navigation gesture by swiping from left edge of the screen.\n    -   New UI for arranging tab-bar icons.\n    -   System-wide dynamic font size, configurable in Settings.\n    -   Enhance the viewing experience of non-iPad apps on iPad 2 and iPad Mini, remove the 1x and 2x toggle, apps are opened in '2x' mode by default on iPad 2 and Mini.\n-   Home Screen\n    -   Spotlight Search is now accessible on each screen by pulling it down.\n    -   The \"New\" banner on newly installed apps has been replaced with small blue dots.\n    -   New icons for built-in apps.\n    -   Newsstand is now a dedicated app instead of an open folder.\n-   Control Center\n    -   A unified screen to quickly access toggles and controls for system settings and services, and for using [AirDrop](https://en.wikipedia.org/wiki/AirDrop \"AirDrop\") and [AirPlay](https://en.wikipedia.org/wiki/AirPlay \"AirPlay\").\n    -   System wide, accessible by swiping upward from the bottom of the screen.\n    -   Accessible in the lock screen.\n    -   Flashlight (device-specific features that come with physical camera) toggle button.\n    -   Landscape support.\n    -   A grabber in full screen apps.\n    -   Mute/silent toggle button in iPad.\n-   [AirDrop](https://en.wikipedia.org/wiki/AirDrop \"AirDrop\")\n    -   Integrates Apple's ad hoc Wi-Fi sharing feature AirDrop (iPhone 5 and later, iPod Touch (5th generation) and later, iPad (4th generation) and later, and iPad Mini (1st generation) and later).\n    -   Alert view, for receive invitation from other devices, option to accept/cancel.\n    -   Options to set discoverable: Off/Contacts only/Everyone.\n-   Inter-app Audio\n    -   Register audio streams to share with other apps.\n    -   Provides for [MIDI](https://en.wikipedia.org/wiki/MIDI \"MIDI\") control of audio [rendering](https://en.wikipedia.org/wiki/Software_rendering \"Software rendering\"), remotely launching other registered Inter-App Audio apps.\n-   Notification Center\n    -   Accessible in the lock screen.\n    -   Today tab, for previewing the events calendar, stocks, and tomorrow's events; provides traffic info on oft-visited places.\n    -   Missed filter: can filter list to see notifications that occurred when phone was not actively in use.\n    -   Bounces when swiped down quickly.\n-   Folders\n    -   Unlimited number of apps via folder subpages.\n    -   Newsstand app can now be moved into a folder.\n    -   Transparent background.\n    -   Folders change color when apps are downloading and clock-like animated progress graphic is superimposed over folders that have actively downloading apps.\n-   Alert\n    -   A countdown for snooze.\n-   Calculator\n    -   New feedback when pressing a key.\n    -   Toggle landscape mode button.\n-   Spotlight\n    -   Accessible on every page of the Home screen by swiping downward from anywhere.\n    -   New animation.\n-   Multitasking\n    -   Redesigned switcher, with horizontal scrolling for previewing all running apps, and swipe upward gesture to stop any running apps.\n    -   Can close multiple apps simultaneously by swiping with multiple fingers.\n    -   Landscape switcher.\n    -   Background App Refresh; fetches data in the background based on network connectivity and user habits.\n    -   Use apps while the app is updating.\n-   Wallpapers\n    -   New wallpapers.\n    -   Dynamic wallpapers.\n    -   Gyroscope-responsive [parallax](https://en.wikipedia.org/wiki/Parallax \"Parallax\") wallpaper effect, based on user's movement.\n-   Weather\n    -   Dynamic animation for different weathers (iPhone 4S and later and iPod Touch (5th generation)).\n    -   Shows sunrise/sunset humidity, chance of precipitation, and wind speed.\n    -   Can see multiple locations simultaneously when the menu icon is selected.\n    -   Can select GPS icon at bottom to immediately see weather for current location.\n-   Phone\n    -   Block list.\n    -   Contact pictures on Favorites.\n    -   Transparency in the number pad button when pressing.\n    -   Phone History and Voicemail Info options allow one to return the call in multiple ways including call back, FaceTime and Messaging.\n-   [Contacts](https://en.wikipedia.org/wiki/Contacts_(application) \"Contacts (application)\")\n    -   New fields in Contacts: \"Add Social Profile\", and \"Add Instant Message\".\n    -   \"Chat\", \"FaceTime\", \"Mail\" buttons next to the contact information; no longer need to scroll down to the bottom.\n    -   Send contacts through AirDrop.\n-   [FaceTime](https://en.wikipedia.org/wiki/FaceTime \"FaceTime\")\n    -   [FaceTime Audio](https://en.wikipedia.org/wiki/FaceTime#FaceTime_Audio \"FaceTime\").\n    -   Block list.\n    -   A dedicated app on the iPhone, like the prior version on iPod Touch and iPad.\n-   [Messages](https://en.wikipedia.org/wiki/Messages_(Apple) \"Messages (Apple)\")\n    -   [Long SMS](https://en.wikipedia.org/wiki/Concatenated_SMS \"Concatenated SMS\").\n    -   Block list.\n    -   No longer have to scroll to the top to access \"Call\", \"FaceTime\", and \"Info\".\n    -   Contact pictures in group chats.\n    -   Ability to see exact time of when each message was sent by dragging conversation bubbles to the left.\n    -   Event and address detection in the message context, tap to open in Calendar and Maps.\n    -   A contact with a nickname will appear in Messages under the nickname, rather than the full name.\n    -   New animation when compressing video to be shared.\n-   [Safari](https://en.wikipedia.org/wiki/Safari_(web_browser) \"Safari (web browser)\")\n    -   Full screen browsing in portrait mode (formerly only available in landscape).\n    -   Unified text field for both [URL](https://en.wikipedia.org/wiki/Uniform_resource_locator \"Uniform resource locator\") and search.\n    -   Bookmarked website thumbnail icons appear when text field is activated.\n    -   Top-hit, [Google](https://en.wikipedia.org/wiki/Google \"Google\") suggest, Bookmarks, and History appear on the unified text field while typing.\n    -   Preview tabs on iPhone and iPod Touch are no longer limited to 8.\n    -   Preview tabs use new 3D vertical animation for previewing the opened tabs; long press to edit positions, swipe to remove.\n    -   [Reading List](https://en.wikipedia.org/wiki/Safari_(web_browser)#Features \"Safari (web browser)\") shows website thumbnails on the right.\n    -   Scrolls articles one-by-one vertically from Reading List, as per [OS X Mavericks](https://en.wikipedia.org/wiki/OS_X_Mavericks \"OS X Mavericks\").\n    -   Swipe gestures for back/prior history, as per [OS X](https://en.wikipedia.org/wiki/OS_X \"OS X\").\n    -   Parental controls.\n    -   Private button: enables \"Do not track me\" feature per website within the app; formerly, configuration appeared in Settings for every website.\n    -   Recent links: a reading list of all user's friends on Facebook or Twitter post.\n    -   Reading List button: new round [glasses](https://en.wikipedia.org/wiki/Glasses \"Glasses\") icon pays tribute to [Steve Jobs](https://en.wikipedia.org/wiki/Steve_Jobs \"Steve Jobs\").\n    -   The .com button removed and replaced with a simple period button. The .com, .net, and .org domain extensions can be accessed by holding down on the button.\n    -   Bookmarks/Reading List/Shared Links tabs re-ordered/slightly tweaked.\n    -   Bolder loading bar, private browsing UI tweaks and tab/bookmark changes on the iPad .\n-   [iCloud](https://en.wikipedia.org/wiki/ICloud \"ICloud\")\n    -   Photo Stream video support, and more than one contributor per photo stream.\n    -   Notification Sync across different iCloud devices.\n-   [Maps](https://en.wikipedia.org/wiki/Apple_Maps \"Apple Maps\")\n    -   Automatic Day/Night Mode that responds to ambient light and current time to switch between day and night color schemes.\n    -   Turn-by-turn walking directions, with estimated time.\n    -   Maps bookmarks syncing.\n    -   Receives notification data sent from the new Maps app in [OS X Mavericks](https://en.wikipedia.org/wiki/OS_X_Mavericks \"OS X Mavericks\") (version 10.9).\n    -   A live compass at the right top corner.\n-   Clock\n    -   App icon reflects the live time.\n    -   Timer shows in the lock screen.\n    -   City shows how many hours ahead/behind from the current location.\n-   Music\n    -   New [iTunes Radio](https://en.wikipedia.org/wiki/ITunes_Radio \"ITunes Radio\") service.\n    -   Scrub along the song to get to a certain part directly from the lock screen.\n    -   Download full albums from iCloud from iTunes Match.\n    -   Tapping a song in the Now-Playing screen allows users to rate.\n    -   Cover Flow: Instead of swiping through individual albums, one can now swipe through multiple albums.\n    -   Reintroduced on-screen lyrics for iPads (this feature was absent in iOS 5 and iOS 6).\n-   [iTunes Radio](https://en.wikipedia.org/wiki/ITunes_Radio \"ITunes Radio\")\n    -   Slider/discovery feature.\n-   [App Store](https://en.wikipedia.org/wiki/App_Store_(iOS) \"App Store (iOS)\")\n    -   Automatic app updates: switch to enable/disable in Settings, under iTunes, App Store.\n    -   New catalogues for youngsters based on their age.\n    -   Genius tab replaced with \"Apps Near Me\" tab for app recommendations based on user's location.\n    -   Volume purchase.\n    -   Search tab redesigned, the number of results appears on the right of the search field.\n    -   Circular download progress animation during downloading/updating in Home Screen.\n    -   Add to wish list.\n    -   It is now possible to download older versions of apps (the last compatible version supported by the device legacy firmware).\n-   iTunes\n    -   Smart download of TV episodes.\n-   Photos\n    -   Albums are organized by Places, Moments, and Years, using the [EXIF](https://en.wikipedia.org/wiki/Exchangeable_image_file_format \"Exchangeable image file format\") data as the base of the collection.\n    -   Share Sheet shares photos to iCloud, social networks, and AirDrop (if available).\n    -   New default album \"Panorama Photos\".\n-   Camera\n    -   Control redesign: swipe horizontally to select the still images, videos, square photos, and Panorama modes (if available).\n    -   [New intuitive controls](https://en.wikipedia.org/wiki/IOS_7#Camera_controls \"IOS 7\") for adjusting [exposure value](https://en.wikipedia.org/wiki/Exposure_value \"Exposure value\") and exposure/focus fixing.\n    -   Live image filters.\n    -   SDK for 60 [FPS](https://en.wikipedia.org/wiki/Frame_rate \"Frame rate\") video recording.\n    -   Pinch to zoom while video recording.\n    -   Redeem iTunes gift card using front camera.\n    -   Panorama reduces when battery is low.\n    -   [Slow motion](https://en.wikipedia.org/wiki/Slow_motion \"Slow motion\") video recording with [720p](https://en.wikipedia.org/wiki/720p \"720p\") at 120 frames per second on the [iPhone 5s](https://en.wikipedia.org/wiki/IPhone_5s \"IPhone 5s\").1\n    -   [Burst mode](https://en.wikipedia.org/wiki/Burst_mode_(photography) \"Burst mode (photography)\").\n    -   [High-dynamic-range imaging](https://en.wikipedia.org/wiki/High-dynamic-range_imaging \"High-dynamic-range imaging\") (HDR) for iPad.\n-   [Calendar](https://en.wikipedia.org/wiki/Calendar_(Apple) \"Calendar (Apple)\")\n    -   New layout for Calendar list view on the iPhone.\n    -   Years view.\n    -   Week view.\n    -   Integration with Mail.\n    -   Integration with [Maps](https://en.wikipedia.org/wiki/Apple_Maps \"Apple Maps\"), users are notified with transit information when entering places information.\n    -   Can now hide or show declined events.\n    -   Will support custom calendar colors.\n    -   All Day toggle on the Add Event Screen instead of buried in the Select Time control.\n    -   Can snooze or View Event when an Event Reminder appears.\n    -   Can set up a second alert time for an event.\n    -   Can change Busy/Free Status.\n    -   Selecting the name of the calendar month shows the monthly calendar.\n-   [Game Center](https://en.wikipedia.org/wiki/Game_Center \"Game Center\")\n    -   Secure game scores.\n    -   Authenticated players.\n    -   Turn-based game modes.\n    -   Ranking-style leader boards.\n-   [Compass](https://en.wikipedia.org/wiki/Compass \"Compass\")\n    -   [Inclinometer](https://en.wikipedia.org/wiki/Inclinometer \"Inclinometer\").\n-   [Mail](https://en.wikipedia.org/wiki/Mail_(OS_X) \"Mail (OS X)\")\n    -   View PDF annotation.\n    -   New smart mailboxes.\n    -   Improved Mail search.\n    -   Hotmail is now Outlook when adding an account, using new Outlook icon.\n    -   Flagged, Unread, To or CC, Attachments, All drafts, All sent, All Trash smart mailboxes.\n    -   Shake to Undo to un-archive something.\n    -   When emailing a passbook pass, it appears as a pass.\n    -   New animation when compressing video to be shared.\n    -   New animation when moving mail into a folder.\n    -   When selecting a target folder while moving an email, an iconic image of the email above the folder selector appears.\n    -   Have the ability to move an email to Junk folder when flagging.\n    -   New Print option available when Reply option is selected.\n-   [Notes](https://en.wikipedia.org/wiki/Notes_(Apple) \"Notes (Apple)\")\n    -   New design, mostly white.\n    -   No longer change fonts in Notes.\n    -   Can AirDrop notes.\n-   Settings\n    -   Per app cellular data usage permission.\n    -   Per app using microphone privacy permission.\n    -   Per app using camera privacy permission.\n    -   Password needed to reset networking and contents.\n-   Accessibility\n    -   Head movement detection for different gestures.\n-   China features\n    -   [Tencent Weibo](https://en.wikipedia.org/wiki/Tencent_Weibo \"Tencent Weibo\") social network integration.\n    -   Chinese-English bilingual dictionary.\n    -   Improved Chinese input including T9 keyboard for pinyin (Added in Beta 4), and handwriting recognition for multiple Chinese characters.\n-   [Siri](https://en.wikipedia.org/wiki/Siri \"Siri\")\n    -   Updated voices, and a new male voice (in select regions/languages). English (US), French, and German will be available with the launch of iOS 7 (additional languages will be added over time).\n    -   Controls certain system settings, such as turning on/off Bluetooth, and changing display brightness.\n    -   Search from [Wikipedia](https://en.wikipedia.org/wiki/Wikipedia \"Wikipedia\") and [Bing](https://en.wikipedia.org/wiki/Bing_(search_engine) \"Bing (search engine)\") search engines.\n    -   Post to [Sina Weibo](https://en.wikipedia.org/wiki/Sina_Weibo \"Sina Weibo\").\n    -   Search tweets on [Twitter](https://en.wikipedia.org/wiki/Twitter \"Twitter\").\n    -   Option to open MLB scores in the MLB.com At Bat app.\n    -   Navigation, access and voice are more natural.\n-   [Reminders](https://en.wikipedia.org/wiki/Reminders_(application) \"Reminders (application)\")\n    -   Geofencing.\n    -   Ability to create repeating reminders has been removed.\n-   [Passbook](https://en.wikipedia.org/wiki/Passbook_(application) \"Passbook (application)\")\n    -   Scan and recognize [barcodes](https://en.wikipedia.org/wiki/Barcode \"Barcode\")/[QR codes](https://en.wikipedia.org/wiki/QR_code \"QR code\").\n    -   Add gift cards as a folder.\n-   Find My iPhone\n    -   Activation Lock: re-activation with iCloud account if the device have been wiped remotely using Find My iPhone service, to prevent unauthorized usage of the lost device.\n    -   Password needed to disable.\n-   Enterprise\n    -   Enterprise single sign-on.\n    -   Per app [VPN](https://en.wikipedia.org/wiki/Virtual_private_network \"Virtual private network\").\n    -   Managed app config, for more efficiently deploying and managing of iPhones and iPads.\n-   Accessories\n    -   Unauthorized [Lightning](https://en.wikipedia.org/wiki/Lightning_(connector) \"Lightning (connector)\") cables are blocked and can no longer be used.\n    -   Set up and configure Wi-Fi accessories, such as AirPlay speakers.\n    -   [iBeacons](https://en.wikipedia.org/wiki/IBeacon \"IBeacon\"), a new class of Bluetooth LE low-powered, low-cost transmitters that can notify devices of other nearby devices/services.\n    -   [Bluetooth LE](https://en.wikipedia.org/wiki/Bluetooth_low_energy \"Bluetooth low energy\") profiles; including time, notifications, keyboards, and stereo sound.\n    -   [MFi](https://en.wikipedia.org/wiki/MFi_Program \"MFi Program\") game controllers.\n-   Screenshot\n    -   No longer included in the AssistiveTouch, they appear on the layer of the image.\n-   Trusted Devices\n    -   User is warned when plugging their iOS device into their Mac/PC, \"Trust the currently connected computer? Trusting this computer will allow it to have full access to your device and all of its data.\"\n-   Voice Memo\n    -   New design.\n    -   Save to iCloud.\n    -   Share using AirDrop.\n-   Status bar\n    -   Translucent design.\n    -   [1xRTT](https://en.wikipedia.org/wiki/CDMA2000 \"CDMA2000\") icon on CDMA iPhones changed from \"o\" icon to \"1x\" icon.\n    -   [GPRS](https://en.wikipedia.org/wiki/General_Packet_Radio_Service \"General Packet Radio Service\") icon on GSM iPhones changed from \"o\" icon to \"GPRS\" icon.\n    -   Dots representations for cellular signal strength.\n    -   Icon size slightly increased for better readability on the lock screen.\n-   Lock screen\n    -   Charging the battery: rather than battery image on the lock screen, x% charged briefly appears under the clock, then reverts to the date.\n    -   Access to Notification Center and Control Center.\n    -   When playing music, the lock screen will now display the time.\n    -   iPad has Camera control on the lock screen, like the prior version on iPhone and iPod Touch.\n    -   Timer counting down is shown when the device is locked.\n    -   Scrubbing bar is now displayed on the lock screen.\n-   Wi-Fi\n    -   New Wi-Fi diagnostics mode.\n    -   Wi-Fi Hotspot 2.0.\n-   Other\n    -   New first-time set up menus.\n    -   The unlock sound from prior iOS releases up to iOS 6 is no longer present. From now on, whenever one either correctly inputs a passcode or simply slide to unlock on the lock screen, no sound will play when unlocking a device's lock screen.\n    -   Add Passcode Lock during Setup Assistant.\n    -   [Vimeo](https://en.wikipedia.org/wiki/Vimeo \"Vimeo\") and [Flickr](https://en.wikipedia.org/wiki/Flickr \"Flickr\") social network integrations.\n    -   Italian, Korean, and Dutch dictionaries.\n    -   New fade animation when pressing the power button.\n    -   Touch ID.\n    -   New ringtones and system sounds. In iOS 6, these are moved to a menu named \"Classic\".\n    -   in VoiceOver add best quality voice in languages\n    -   in VoiceOver Arabic voice has changed",
    "date" : "September 18, 2013"
  },
  {
    "args" : {
      "Build" : "11A470a",
      "Supported devices" : "iPhone 5C\niPhone 5S"
    },
    "version" : "7.0.1",
    "logs" : "**iPhone 5C and iPhone 5S only**\n\n*Bug fixes*\n\n-   Fixes a bug with the Touch ID sensor on the iPhone 5S.\n-   Fixes a bug with the App Store purchases system.",
    "date" : "September 19, 2013"
  },
  {
    "args" : {
      "Build" : "11A501",
      "Supported devices" : "iPhone 4\niPhone 4S\niPhone 5\niPhone 5C\niPhone 5S\niPod touch (5th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)"
    },
    "version" : "7.0.2",
    "logs" : "**iPhone 5C and iPhone 5S only**\n\n*Bug fixes*\n\n-   Fixes a bug with the Touch ID sensor on the iPhone 5S.\n-   Fixes a bug with the App Store purchases system.",
    "date" : "September 26, 2013"
  },
  {
    "args" : {
      "Build" : "11B511",
      "Supported devices" : "iPhone 4\niPhone 4S\niPhone 5\niPhone 5C\niPhone 5S\niPod touch (5th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)",
      "Initial devices" : "iPad Air\niPad Mini 2"
    },
    "version" : "7.0.3",
    "logs" : "*Initial release on [iPad Air](https://en.wikipedia.org/wiki/IPad_Air \"IPad Air\") and [iPad Mini 2](https://en.wikipedia.org/wiki/IPad_Mini_2 \"IPad Mini 2\")*\n\n*Bug fixes*\n\n-   Slide to Unlock is delayed while the Touch ID sensor is being pressed. ^[P5S](https://en.wikipedia.org/wiki/IOS_version_history#endnote_P5S)^\n-   Fixes iMessage activation and message sending bugs\n-   Fixed crashes in iWork apps.\n-   Improved accelerometer calibration\n-   Fixed Siri or VoiceOver quietness bug\n-   Fixed lock screen bypass\n\n*Features*\n\n-   Safari now supports the new [iCloud Keychain](https://en.wikipedia.org/wiki/ICloud_Keychain \"ICloud Keychain\") and Password Generator\n-   Spotlight now supports web search and Wikipedia search",
    "date" : "October 22, 2013"
  },
  {
    "args" : {
      "Build" : "11B554a",
      "Supported devices" : "iPhone 4\niPhone 4S\niPhone 5\niPhone 5C\niPhone 5S\niPod touch (5th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)\niPad Mini 2\niPad Air"
    },
    "version" : "7.0.4",
    "logs" : "*Bug fixes*\n\n-   Bug fixes (FaceTime)",
    "date" : "November 14, 2013"
  },
  {
    "args" : {
      "Build" : "11B601",
      "Supported devices" : "iPhone 5C\niPhone 5S"
    },
    "version" : "7.0.5",
    "logs" : "**iPhone 5C and iPhone 5S only**\n\n*Bug fixes*\n\n-   Updated carrier network settings for iPhone 5C and iPhone 5S sold in China.",
    "date" : "January 29, 2014"
  },
  {
    "args" : {
      "Build" : "11B651",
      "Supported devices" : "iPhone 4\niPhone 4S\niPhone 5\niPhone 5C\niPhone 5S\niPod touch (5th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)\niPad Mini 2\niPad Air"
    },
    "version" : "7.0.6",
    "logs" : "*Bug fixes*\n\n-   Fixes [CVE](https://en.wikipedia.org/wiki/CVE_(identifier) \"CVE (identifier)\")-[2014-1266](https://www.cve.org/CVERecord?id=CVE-2014-1266), a bug in Secure Transport that can cause it to fail to properly authenticate an [SSL/TLS](https://en.wikipedia.org/wiki/Transport_Layer_Security \"Transport Layer Security\") connection.",
    "date" : "February 21, 2014"
  },
  {
    "args" : {
      "Builds" : "11D167\n11D169",
      "Supported devices" : "iPhone 4\niPhone 4S\niPhone 5\niPhone 5C\niPhone 5S\niPod touch (5th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)\niPad Mini 2\niPad Air"
    },
    "version" : "7.1",
    "logs" : "-   Adds [CarPlay](https://en.wikipedia.org/wiki/CarPlay \"CarPlay\")\n    -   Providing iOS control to in-car control systems on some car models by selected vendors from 2014.\n    -   Includes Siri integration (eyes-free/hands-free modes), satellite navigation, telephone, music, and iMessage integration.\n    -   Can connect iPhone to a car through the [Lightning](https://en.wikipedia.org/wiki/Lightning_(connector) \"Lightning (connector)\") connector\n    -   Can make phone calls, send & receive messages, play audio, and use Maps\n    -   Support for resuming audio playback in Bluetooth car stereo systems(that do not support CarPlay) while using Turn-By-Turn navigation in Maps.\n-   [Siri](https://en.wikipedia.org/wiki/Siri \"Siri\") \n    -   Manually control when Siri listens by holding down the Home button while speaking, then releasing it when finished.\n    -   Improved voices (Chinese, UK English, Australian English, Japanese).\n-   [iTunes Radio](https://en.wikipedia.org/wiki/ITunes_Radio \"ITunes Radio\")\n    -   Buy albums directly from the Now Playing screen.\n-   Accessibility\n    -   Keyboard and calculator can now be bolded\n    -   Fixed Reduce Motion bugs\n    -   Added \"Reduce white point\" option\n-   Calendar\n    -   Option to display event list with the month view.\n    -   Added more country-specific holidays\n    -   List view has been redesigned.\n-   UI\n    -   Camera app has a new feature, \"HDR Auto\".\n    -   Photos and Camera tab in iOS Settings has a new option, \"Upload Burst Photos\" .\n    -   The Parallax effect can be disabled independently of other animations when setting up wallpaper.\n    -   Notification Center now displays \"No Notifications\" and \"No Missed Notifications\" for the \"All\" and \"Missed\" sections respectively when there are no notifications.\n    -   Redesigned the UI of a incoming phone call, which is now transparent, and now allows you to directly decline phone calls.\n    -   A new Yahoo logo, in both the Notification Center and the Weather and Stocks apps.\n    -   A new dialogue \"Touch ID requires your passcode when iPhone restarts\" displays when restarting.\n    -   New iPad wallpapers.\n    -   \"Touch ID and Passcode\" has been moved to the main menu in Settings.\n    -   Animations and transitions are faster.\n    -   Keyboard has new Shift and Backspace key highlights.\n    -   Control Center has a new \"spring\" animation upon opening.\n    -   Control Center sliders -- volume and brightness -- have momentum.\n    -   Icons for Phone, Messages and FaceTime apps have less vibrant colors.\n    -   Music app: Albums now in descending order when browsing by Artist.\n    -   The buttons are circular in shape and do not show the word of what the icon means.\n        -   The Phone and FaceTime apps have a new-look dialer and \"end call\" button.\n        -   The slide-to-power-off UI has been redesigned; the shape of the slider is circular and the thing that says \"slide to power off\" is oval in shape. Same with the \"slide to answer\" slider in the Phone and FaceTime apps.\n-   Bug fixes and improvements\n    -   Fixes a home screen crash bug.\n    -   Fixes bug with unread Mail badge above 10,000\n    -   [iCloud Keychain](https://en.wikipedia.org/wiki/ICloud_Keychain \"ICloud Keychain\") rollout in additional countries.\n    -   FaceTime call notifications disappear when the call is picked up on another iCloud-connected device.\n    -   [iBeacon](https://en.wikipedia.org/wiki/IBeacon \"IBeacon\") improvements.\n    -   Patches 41 security exploits, including those used by the [Evasi0n](https://en.wikipedia.org/wiki/Evasi0n \"Evasi0n\") 7 jailbreak. This firmware, along with iOS 7.1.1 and 7.1.2 can be jailbroken via the Pangu jailbreak.\n    -   *Reduce Motion* function in Settings app is introduced. This function reduces the motion of the UI and disables the parallax effects.\n    -   Removes the infamous \"[black screen of death](https://en.wikipedia.org/wiki/Black_screen_of_death \"Black screen of death\") (BkSoD)\" and \"White screen of death (WSoD)\" that appeared in iOS 7.0.x.\n-   Stability and Performance\n    -   Improves the performance on an iPhone 4.\n-   Software Update\n    -   This is the First update to iOS that enables beta versions to update [over-the-air](https://en.wikipedia.org/wiki/Over-the-air_programming \"Over-the-air programming\") to the final release.\n-   Issues\n    -   Touch ID fingerprint recognition is disabled when rebooting, turning Touch ID on and off; even restoring or resetting the device does not solve the problem.",
    "date" : "March 10, 2014"
  },
  {
    "args" : {
      "Build" : "11D201",
      "Supported devices" : "iPhone 4\niPhone 4S\niPhone 5\niPhone 5C\niPhone 5S\niPod touch (5th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)\niPad Mini 2\niPad Air"
    },
    "version" : "7.1.1",
    "logs" : "*Bug fixes*\n\n-   Stability and performance\n    -   Further improvements to Touch ID fingerprint recognition\n    -   Fixes bug that could make the keyboard sluggish\n    -   Fixes the bug in which the \"1\" badge was stuck on the Settings app even after updating to the latest version of iOS\n    -   Fixes an issue when using Bluetooth keyboards with VoiceOver enabled",
    "date" : "April 22, 2014"
  },
  {
    "args" : {
      "Build" : "11D257",
      "Supported devices" : "iPhone 4\niPhone 4S\niPhone 5\niPhone 5C\niPhone 5S\niPod touch (5th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)\niPad Mini 2\niPad Air",
      "Removed devices" : "iPhone 4"
    },
    "version" : "7.1.2",
    "logs" : "*Final release supported on the iPhone 4.*\n\n-   Bug fixes and security improvements\n    -   Improves the iBeacons connectivity and stability\n    -   Fixes a bug with data transfer for some 3rd party accessories, including bar code scanners\n    -   Corrects an issue with data protection class of Mail attachments",
    "date" : "April 22, 2014"
  },
  {
    "args" : {
      "Builds" : "12A365\n12A366",
      "Supported devices" : "iPhone 4S\niPhone 5\niPhone 5C\niPhone 5S\niPod touch (5th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)\niPad Mini 2\niPad Air",
      "Initial devices" : "iPhone 6\niPhone 6 Plus"
    },
    "version" : "8.0",
    "logs" : "*Initial release on [iPhone 6 and iPhone 6 Plus](https://en.wikipedia.org/wiki/IPhone_6 \"IPhone 6\")*\n\n*Drops support for [iPhone 4](https://en.wikipedia.org/wiki/IPhone_4 \"IPhone 4\") and Apple TV (2nd generation)*\n\n-   Adds Tap to Talk to send a voice recording, video, or photo with a swipe\n-   Group Messages can now be named\n-   Members can be added or removed during a Group Message rather than just at the beginning\n-   Photos' light and color levels can easily be edited with a swipe\n-   Controls are more fine-tuned\n-   Photos can be searched for by date, location, or album name\n-   Third-party photo filters and editing tools can be integrated into photos\n-   Time-lapse mode has been added to Camera\n-   Exposure can be adjusted with a nudge\n-   Panoramic photos can be taken with iPad Air and iPad mini 2\n-   Adds Continuity, for iPhone 5 or later, iPad 4, iPad Air 1, iPad mini 2, and iPod Touch 5\n    -   Calls and SMS/MMS messages can be made from an iPad or Mac\n    -   Instant Hotspots can be made to automatically share users' cellular connections to their other devices\n    -   Compatibility with OS X Yosemite has been added to AirDrop\n-   Siri can now purchase content from the iTunes Store\n-   \"Hey, Siri\" can now be used activate Siri using just a user's voice to recognize your voice when the device is plugged in\n-   Siri can use Shazam to identify the playing music\n-   Safari can now use DuckDuckGo as a search engine\n-   Notes can edit rich text\n-   Fixes a bug where an attacker can obtain Wi-Fi credentials\n-   Fixes a bug where a malicious application may be able to identify the Apple ID associated with the device\n-   Fixes a bug where the device may fail to lock the screen if AssistiveTouch is enabled\n-   Fixes a bug where a local attacker may be able to install unverified applications without permission\n-   Fixes a bug where an iOS device may think it is up to date\n-   Fixes a bug where clicking on a FaceTime link in Mail triggers an audio FaceTime call without prompting\n-   Fixes a bug where iCloud Activation Lock may be bypassed\n-   Encrypts location data sent by the Weather app\n-   Fixes a bug that allowed users to be tracked by their Wi-Fi MAC addresses",
    "date" : "September 17, 2014"
  },
  {
    "args" : {
      "Build" : "12A402",
      "Supported devices" : "iPhone 4S\niPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPod touch (5th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)\niPad Mini 2\niPad Air"
    },
    "version" : "8.0.1",
    "logs" : "*Update was pulled and replaced by 8.0.2 the following day due to a bug disabling cellular connectivity and [Touch ID](https://en.wikipedia.org/wiki/Touch_ID \"Touch ID\") on the iPhone 6 and 6 Plus.*\n\n-   Enables support for third-party applications in [HealthKit](https://en.wikipedia.org/wiki/HealthKit \"HealthKit\").\n-   Improves the reliability of the Reachability feature introduced with the iPhone 6 and 6 Plus.\n-   Fixes high data usage when SMS & MMS messages are received.",
    "date" : "September 24, 2014"
  },
  {
    "args" : {
      "Build" : "12A405",
      "Supported devices" : "iPhone 4S\niPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPod touch (5th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)\niPad Mini 2\niPad Air"
    },
    "version" : "8.0.2",
    "logs" : "-   Re-enables cellular connectivity and [Touch ID](https://en.wikipedia.org/wiki/Touch_ID \"Touch ID\") on the iPhone 6 and 6 Plus after they were disabled in 8.0.1 due to a bug.",
    "date" : "September 25, 2014"
  },
  {
    "args" : {
      "Builds" : "12B410\n12B411",
      "Supported devices" : "iPhone 4S\niPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPod touch (5th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)\niPad Mini 2\niPad Air",
      "Initial devices" : "iPad Air 2\niPad mini 3"
    },
    "version" : "8.1",
    "logs" : "*Initial release on [iPad Air 2](https://en.wikipedia.org/wiki/IPad_Air_2 \"IPad Air 2\") and [iPad mini 3](https://en.wikipedia.org/wiki/IPad_Mini_3 \"IPad Mini 3\")*\n\n-   Introduces [Apple Pay](https://en.wikipedia.org/wiki/Apple_Pay \"Apple Pay\") for [iPhone 6 and 6 Plus](https://en.wikipedia.org/wiki/IPhone_6 \"IPhone 6\") in the United States\n-   Adds support for [iCloud Photo Library (beta)](https://en.wikipedia.org/wiki/ICloud#iCloud_Photo_Library \"ICloud\"), allowing users to store photos in iCloud\n-   Restores the Camera Roll in Photos\n-   Alerts iPhone users that they are low on space before capturing Time-Lapse video\n-   Fixes a bug that prevented messages from being marked as read\n-   Adds the ability to select 2G, 3G, or LTE networks for cellular data^[[113]](https://en.wikipedia.org/wiki/IOS_version_history#cite_note-113)^\n-   Allows HealthKit apps to access Health data in the background\n-   Allows use of OS X Caching Server for iOS updates\n-   Fixes a bug where a maliciously crafted Bluetooth device may bypass pairing\n-   Fixes a bug where QuickType may learn users' credentials",
    "date" : "October 20, 2014"
  },
  {
    "args" : {
      "Builds" : "12B435\n12B436",
      "Supported devices" : "iPhone 4S\niPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPod touch (5th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)\niPad Mini 2\niPad mini 3\niPad Air\niPad Air 2"
    },
    "version" : "8.1.1",
    "logs" : "-   Increases performance for [iPhone 4S](https://en.wikipedia.org/wiki/IPhone_4S \"IPhone 4S\") and [iPad 2](https://en.wikipedia.org/wiki/IPad_2 \"IPad 2\")\n-   Fixes a bug where a local user can execute unsigned code\n-   Fixes a bug that allowed a malicious application to execute arbitrary code with kernel privileges\n-   Fixes a bug that allowed a local attacker to bypass the maximum incorrect passcode attempt count",
    "date" : "November 17, 2014"
  },
  {
    "args" : {
      "Build" : "12B440",
      "Supported devices" : "iPhone 4S\niPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPod touch (5th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)\niPad Mini 2\niPad mini 3\niPad Air\niPad Air 2"
    },
    "version" : "8.1.2",
    "logs" : "-  Fixes an issue where ringtones purchased through the [iTunes Store](https://en.wikipedia.org/wiki/ITunes_Store \"ITunes Store\") would be unexpectedly removed from an iOS device",
    "date" : "December 9, 2014"
  },
  {
    "args" : {
      "Build" : "12B466",
      "Supported devices" : "iPhone 4S\niPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPod touch (5th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)\niPad Mini 2\niPad mini 3\niPad Air\niPad Air 2"
    },
    "version" : "8.1.3",
    "logs" : "-   Reduces OTA software update size\n-   Fixes a bug that prevented some users from entering their Apple ID password to enable iMessage and FaceTime\n-   Fixes an issue that caused multitasking gestures to stop working on iPads",
    "date" : "January 27, 2015"
  },
  {
    "args" : {
      "Build" : "12D508",
      "Supported devices" : "iPhone 4S\niPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPod touch (5th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)\niPad Mini 2\niPad mini 3\niPad Air\niPad Air 2"
    },
    "version" : "8.2",
    "logs" : "-   Adds support for the [Apple Watch](https://en.wikipedia.org/wiki/Apple_Watch \"Apple Watch\") on iPhone 5 and later\n    -   Introduces the Watch app to pair and sync Watches\n    -   Introduces the Activity app to view fitness data and achievements; only appears when a Watch is paired\n-   Allows setting the unit of measurement for distance, body temperature, weight, high, and blood glucose levels\n-   Improves stability of many apps\n-   Fixes an issue where Maps failed to navigate correctly to Favorite locations\n-   Fixes an issue where duplicated iTunes purchases prevented an iCloud backup from completing\n-   Fixes an issue where music and playlists failed to sync from iTunes to Music\n-   Fixes an issue where all Calendar events appear in GMT instead of the user's local time zone\n-   Fixes an issue that prevented users from adding a photo in Medical ID\n-   Fixes units for vitamins and minerals\n-   Fixes a bug where a local attacker may be able to view the home screen of an unactivated device",
    "date" : "January 27, 2015"
  },
  {
    "args" : {
      "Builds" : "12F69\n12F70",
      "Supported devices" : "iPhone 4S\niPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPod touch (5th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)\niPad Mini 2\niPad mini 3\niPad Air\niPad Air 2"
    },
    "version" : "8.3",
    "logs" : "-   Improves launch performance for many applications\n-   Fixes a bug that caused users to be continually prompted for login credentials for Wi-Fi networks\n-   Fixes a random disconnect bug for Wi-Fi\n-   Fixes a bug that prevented a device from rotating its screen orientation from landscape to portrait\n-   Fixes a bug that caused screen rotation to appear upside down on iPhone 6 Plus\n-   Fixes a bug that caused group messages to split\n-   Redesigns the Emoji keyboard and adds over 300 new emojis\n-   iCloud Photo Library is now out of beta with OS X Yosemite 10.10.3\n-   Adds new languages to Siri\n    -   English (India)\n    -   English (New Zealand)\n    -   Danish\n    -   Dutch\n    -   Portuguese\n    -   Russian\n    -   Swedish\n    -   Thai\n    -   Turkish\n    -   Arabic (Saudi Arabia)\n    -   Arabic (United Arab Emirates)\n    -   Hebrew (Israel)\n-   Improves stability for many system applications\n-   Fixes a bug that caused Slide to Unlock to fail to unlock the device\n-   Fixes a bug that caused time to incorrectly display as 00:00 on Lock Screen^[[120]](https://en.wikipedia.org/wiki/IOS_version_history#cite_note-120)^\n-   Fixes a bug that allowed a malicious application to guess the device's passcode\n-   Fixes a bug that allowed a local attacker to bypass the maximum incorrect passcode attempt limit\n-   Fixes a bug that prevented a device from erasing itself after 10 incorrect passcode inputs",
    "date" : "April 8, 2015"
  },
  {
    "args" : {
      "Build" : "12H143",
      "Supported devices" : "iPhone 4S\niPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPod touch (5th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)\niPad Mini 2\niPad mini 3\niPad Air\niPad Air 2",
      "Initial devices" : "iPod touch (6th gen)"
    },
    "version" : "8.4",
    "logs" : "*Initial release on [iPod touch (6th generation)](https://en.wikipedia.org/wiki/IPod_Touch_(6th_generation) \"IPod Touch (6th generation)\")*\n\n-   Introduces Apple Music, a subscription service for Music\n    -   The Music app icon is redesigned\n    -   Adds the For You tab, where playlist and album recommendations are delivered by music experts\n    -   Adds the New tab, where newly published music is available\n    -   Adds the My Music tab, which shows all iTunes purchases, playlists, Apple Music songs, and more in one place\n    -   Introduces the MiniPlayer\n    -   iTunes Store can still be used to buy music\n    -   Audiobooks are moved to [iBooks](https://en.wikipedia.org/wiki/Apple_Books \"Apple Books\") from Music\n-   The [iBooks](https://en.wikipedia.org/wiki/Apple_Books \"Apple Books\") app is redesigned\n    -   Now Playing is added to iBooks for audiobooks\n    -   Made for iBooks books now work on both iPhone and iPad\n    -   Audiobooks can be downloaded inside iBooks\n    -   Fixes a bug that prevented books from being downloaded from iCloud\n    -   Fixes a bug where deleted Apple Watch apps may reinstall themselves\n    -   Fixes a bug where visiting a maliciously crafted website may allow Apple ID takeover\n    -   Fixes a bug that allowed maliciously crafted SIM cards to execute arbitrary code\n    -   Fixes a bug that allowed maliciously crafted websites to spoof UI elements",
    "date" : "June 30, 2015"
  },
  {
    "args" : {
      "Build" : "12D508",
      "Supported devices" : "iPhone 4S\niPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPod touch (5th gen)\niPod touch (6th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)\niPad Mini 2\niPad mini 3\niPad Air\niPad Air 2"
    },
    "version" : "8.4.1",
    "logs" : "-   Bug fixes for Apple Music\n    -   Fixes multiple bugs that prevented enabling iCloud Music Library\n    -   Fixes a bug that hid added Apple Music if Apple Music was set to show offline music only\n    -   Fixes an issue that may show incorrect artwork\n    -   Fixes multiple issues for artists posting to Connect\n    -   Fixes an issue where tapping Love doesn't work when listening to Beats 1\n    -   Fixes a bug that allowed a maliciously crafted Apple File Conduit, or AFC command to access protected parts of the filesystem\n    -   Fixes a bug that allowed a malicious website to spawn an infinite number of alert messages, preventing iOS from being used without a force restart\n    -   Fixes a bug that allowed FaceTime calls to be forcefully accepted\n    -   Patches security flaws that allowed the TaiG jailbreak to work.",
    "date" : "August 13, 2015"
  },
  {
    "args" : {
      "Builds" : "13A340\n13A343\n13A344",
      "Supported devices" : "iPhone 4S\niPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPod touch (5th gen)\niPod touch (6th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)\niPad Mini 2\niPad mini 3\niPad Air\niPad Air 2",
      "Initial devices" : "iPhone 6S\niPhone 6S Plus\niPad mini 4"
    },
    "version" : "9.0",
    "logs" : "*Initial release on [iPhone 6S](https://en.wikipedia.org/wiki/IPhone_6S \"IPhone 6S\"), [iPhone 6S Plus](https://en.wikipedia.org/wiki/IPhone_6S_Plus \"IPhone 6S Plus\"), and [iPad mini 4](https://en.wikipedia.org/wiki/IPad_Mini_4 \"IPad Mini 4\")*\n\n-   Allows Siri to search personal photos and videos based on dates, locations, album names, etc.\n-   Ask Siri can now remind users about things they have viewed in apps\n-   Siri can now be asked for directions via public transit\n-   Phone calls, FaceTime calls, and Messages conversations can now be initiated from contacts searched in Spotlight Search\n-   iPad Only\n    -   Adds Slide Over, allowing users to switch between apps without exiting the current app, for Apple apps and supported third-party apps\n    -   Split View allows using two apps at once with Apple apps and supported third-party apps, with resizeable windows\n    -   Picture-in-picture video support for Safari video, FaceTime, Videos, Podcasts, and supported third-party apps\n-   Adds support in Maps for public transit, station details, schedules, and directions\n-   Adds indicator for Apple Pay support on place cards\n-   Allows adding photos to Notes from Photo Library or Camera\n-   Can now draw notes with your finger\n-   Redesigns the News app\n-   Adds support for Discover cards with Apple Pay\n-   Apple Pay can be prepared by double-tapping Home and keeping one's finger on Home\n-   Increases battery life\n-   Software updates now take up less space, can be installed later after downloading\n-   Apple apps and the UI now use Metal to render, for better performance\n-   Using a six-digit passcode is now default instead of a four-digit passcode\n-   San Francisco is now the default system font\n-   Wi-Fi assist automatically uses cellular data if Wi-Fi connectivity is poor\n-   Content can be transferred from an Android device to an iOS device with the Move to iOS app",
    "date" : "September 16, 2015"
  },
  {
    "args" : {
      "Build" : "13A404",
      "Supported devices" : "iPhone 4S\niPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPod touch (5th gen)\niPod touch (6th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)\niPad Mini 2\niPad mini 3\niPad mini 4\niPad Air\niPad Air 2"
    },
    "version" : "9.0.1",
    "logs" : "*Initial release on [iPhone 6S](https://en.wikipedia.org/wiki/IPhone_6S \"IPhone 6S\"), [iPhone 6S Plus](https://en.wikipedia.org/wiki/IPhone_6S_Plus \"IPhone 6S Plus\"), and [iPad mini 4](https://en.wikipedia.org/wiki/IPad_Mini_4 \"IPad Mini 4\")*\n\n-   Allows Siri to search personal photos and videos based on dates, locations, album names, etc.\n-   Ask Siri can now remind users about things they have viewed in apps\n-   Siri can now be asked for directions via public transit\n-   Phone calls, FaceTime calls, and Messages conversations can now be initiated from contacts searched in Spotlight Search\n-   iPad Only\n    -   Adds Slide Over, allowing users to switch between apps without exiting the current app, for Apple apps and supported third-party apps\n    -   Split View allows using two apps at once with Apple apps and supported third-party apps, with resizeable windows\n    -   Picture-in-picture video support for Safari video, FaceTime, Videos, Podcasts, and supported third-party apps\n-   Adds support in Maps for public transit, station details, schedules, and directions\n-   Adds indicator for Apple Pay support on place cards\n-   Allows adding photos to Notes from Photo Library or Camera\n-   Can now draw notes with your finger\n-   Redesigns the News app\n-   Adds support for Discover cards with Apple Pay\n-   Apple Pay can be prepared by double-tapping Home and keeping one's finger on Home\n-   Increases battery life\n-   Software updates now take up less space, can be installed later after downloading\n-   Apple apps and the UI now use Metal to render, for better performance\n-   Using a six-digit passcode is now default instead of a four-digit passcode\n-   San Francisco is now the default system font\n-   Wi-Fi assist automatically uses cellular data if Wi-Fi connectivity is poor\n-   Content can be transferred from an Android device to an iOS device with the Move to iOS app",
    "date" : "September 16, 2015"
  },
  {
    "args" : {
      "Build" : "13A452",
      "Supported devices" : "iPhone 4S\niPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPod touch (5th gen)\niPod touch (6th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)\niPad Mini 2\niPad mini 3\niPad mini 4\niPad Air\niPad Air 2"
    },
    "version" : "9.0.2",
    "logs" : "-   Fixes an issue with the setting to turn on or off app cellular data usage\n-   Fixes an issue that prevented iMessage activation for some users\n-   Fixes an issue where an iCloud backup could be interrupted after starting a manual backup\n-   Fixes an issue where the screen could incorrectly rotate when receiving notifications\n-   Fixes an issue where a lock screen issue allowed access to photos and contacts on a locked device\n-   Improved the stability of Podcasts app",
    "date" : "September 30, 2015"
  },
  {
    "args" : {
      "Build" : "13B143",
      "Supported devices" : "iPhone 4S\niPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPod touch (5th gen)\niPod touch (6th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)\niPad Mini 2\niPad mini 3\niPad mini 4\niPad Air\niPad Air 2",
      "Initial devices" : "iPad Pro 12.9\" (1st gen)"
    },
    "version" : "9.1",
    "logs" : "*Initial release on [iPad Pro 12.9\" (1st generation)](https://en.wikipedia.org/wiki/IPad_Pro_(1st_generation) \"IPad Pro (1st generation)\")*\n\n-   Live Photos now intelligently senses when the iPhone is raised or lowered, so that Live Photos will automatically not record these movements\n-   Over 150 new emoji characters with full support for Unicode 7.0 and 8.0 emojis\n-   Improved overall stability, including CarPlay, Music, Photos, Safari and Search\n-   Improved performance while in Multitasking UI\n-   Fixes an issue that could cause Calendar to become unresponsive in Month view\n-   Fixes an issue that prevented Game Center from launching some users\n-   Fixes an issue that zoomed the content of some apps\n-   Fixes an issue that could cause an incorrect unread mail count for POP mail accounts\n-   Fixes an issue that prevented users from removing recent contacts from new mail or messages\n-   Fixes an issue that caused some messages to not appear in Mail search results\n-   Fixes an issue that left a gray bar in the body of an audio message\n-   Fixes an issue that caused activation errors on some carriers\n-   Fixes an issue that prevented some apps from updating from the App Store",
    "date" : "October 21, 2015"
  },
  {
    "args" : {
      "Build" : "13C75",
      "Supported devices" : "iPhone 4S\niPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPod touch (5th gen)\niPod touch (6th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)\niPad Mini 2\niPad mini 3\niPad mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)"
    },
    "version" : "9.2",
    "logs" : "-   Apple Music improvements\n    -   Ability to create a new playlist when adding a song to a playlist\n    -   Most recently changed playlist is now listed at the top when adding songs to playlist\n    -   Ability to download albums or playlists from your iCloud Music Library by tapping the iCloud download button\n    -   New download indicator next to each song in My Music and Playlists\n    -   See works, composers, and performers while browsing Classical music in the Apple Music catalog\n-   iBooks now supports listening to an audiobook while browsing the library, reading other books, or exploring the iBooks Store\n-   iPhone support for USB Camera Adapter to import photos and videos\n-   Siri support for Arabic (Saudi Arabia, United Arab Emirates)\n-   Bug fixes",
    "date" : "December 8, 2015"
  },
  {
    "args" : {
      "Builds" : "13D15\n13D20",
      "Supported devices" : "iPhone 4S\niPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPod touch (5th gen)\niPod touch (6th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)\niPad Mini 2\niPad mini 3\niPad mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)"
    },
    "version" : "9.2.1",
    "logs" : "-   Fixes many bugs that allowed local users to execute arbitrary code with kernel privileges\n-   Fixes multiple bugs where visiting a malicious website led to arbitrary code execution\n-   Fixes a bug that allowed captive web portals to read and write user's cookies\n-   In addition to the re-released build\n    -   Fixes rare Error 53 on certain iPhones and iPads with Touch ID sensor",
    "date" : "January 19, 2016"
  },
  {
    "args" : {
      "Builds" : "13D15\n13D20",
      "Supported devices" : "iPhone 4S\niPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPod touch (5th gen)\niPod touch (6th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)\niPad Mini 2\niPad mini 3\niPad mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)"
    },
    "version" : "9.2.1",
    "logs" : "-   Fixes many bugs that allowed local users to execute arbitrary code with kernel privileges\n-   Fixes multiple bugs where visiting a malicious website led to arbitrary code execution\n-   Fixes a bug that allowed captive web portals to read and write user's cookies\n-   In addition to the re-released build\n    -   Fixes rare Error 53 on certain iPhones and iPads with Touch ID sensor",
    "date" : "January 19, 2016"
  },
  {
    "args" : {
      "Builds" : "13E234\n13E236\n13E237",
      "Supported devices" : "iPhone 4S\niPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPod touch (5th gen)\niPod touch (6th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)\niPad Mini 2\niPad mini 3\niPad mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)",
      "Initial device" : "iPhone SE (1st gen)"
    },
    "version" : "9.3",
    "logs" : "*Initial release on [iPhone SE (1st generation)](https://en.wikipedia.org/wiki/IPhone_SE_(1st_generation) \"IPhone SE (1st generation)\")*\n\n-   Adds support for a new feature named Night Shift which, manually or automatically (based on user preference), makes the display color warmer so it is easier to view at night. Users can adjust the color temperature in the Settings app\n    -   Night Shift works only on 64-bit devices\n-   Adds support for protecting notes inside the Notes app with a passcode or Touch ID\n-   Support for pairing multiple Apple Watches to your iPhone\n-   Support for Spanish (Latin America) display language\n-   Siri support for Finnish, Hebrew and Malay\n-   Fixes an issue where manually changing the date to May 1970 or earlier could prevent 64-bit devices from turning on after a restart\n-   Builds 13E236 and 13E237 were issued to devices that were affected by the Activation Lock bug. These re-issued builds helped correct the issue after the prior builds were withdrawn",
    "date" : "March 21, 2016"
  },
  {
    "args" : {
      "Build" : "13E238",
      "Supported devices" : "iPhone 4S\niPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone SE (1st gen)\niPod touch (5th gen)\niPod touch (6th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)\niPad Mini 2\niPad mini 3\niPad mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)"
    },
    "version" : "9.3.1",
    "logs" : "-   Fixes an issue that caused apps to be unresponsive after tapping on links in Safari or other apps\n-   Fixes an issue where connecting to a fake Apple time server which sets system time to January 1, 1970 can cause 64-bit devices to overheat and become unresponsive after a restart",
    "date" : "March 31, 2016"
  },
  {
    "args" : {
      "Builds" : "13F69\n13F72",
      "Supported devices" : "iPhone 4S\niPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone SE (1st gen)\niPod touch (5th gen)\niPod touch (6th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)\niPad Mini 2\niPad mini 3\niPad mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)"
    },
    "version" : "9.3.2",
    "logs" : "-   Fixes an issue where some Bluetooth accessories could experience audio quality issues when paired to iPhone SE\n-   Fixes an issue where looking up dictionary definitions could fail\n-   Fixes an issue that prevented typing email addresses when using the Japanese Kana keyboard in Mail and Messages\n-   Fixes an issue for VoiceOver users, using the Alex voice, where the device switches to a different voice to announce punctuation or spaces",
    "date" : "May 16, 2016"
  },
  {
    "args" : {
      "Build" : "13G34",
      "Supported devices" : "iPhone 4S\niPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone SE (1st gen)\niPod touch (5th gen)\niPod touch (6th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)\niPad Mini 2\niPad mini 3\niPad mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)"
    },
    "version" : "9.3.3",
    "logs" : "-   Fixes multiple bugs that allow for arbitrary code execution with kernel privileges\n-   Fixes a bug that allowed a local attacker to access contact information\n-   Fixes a bug where visiting a malicious website can allow spoofing UI elements",
    "date" : "July 18, 2016"
  },
  {
    "args" : {
      "Build" : "13G35",
      "Supported devices" : "iPhone 4S\niPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone SE (1st gen)\niPod touch (5th gen)\niPod touch (6th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)\niPad Mini 2\niPad mini 3\niPad mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)"
    },
    "version" : "9.3.4",
    "logs" : "-   Fixes a memory corruption vulnerability in IOMobileFrameBuffer found by Team Pangu that allows arbitrary code execution with kernel privileges",
    "date" : "August 4, 2016"
  },
  {
    "args" : {
      "Build" : "13G36",
      "Supported devices" : "iPhone 4S\niPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone SE (1st gen)\niPod touch (5th gen)\niPod touch (6th gen)\niPad (2nd gen)\niPad (3rd gen)\niPad (4th gen)\niPad mini (1st gen)\niPad Mini 2\niPad mini 3\niPad mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)",
      "Removed devices" : " iPad 2 Wi-Fi\niPad (3rd gen) Wi-Fi\niPad mini (1st gen) Wi-Fi\niPod Touch (5th gen)"
    },
    "version" : "9.3.5",
    "logs" : "*Final release supported on [iPad 2](https://en.wikipedia.org/wiki/IPad_2 \"IPad 2\") Wi-Fi, [iPad (3rd generation)](https://en.wikipedia.org/wiki/IPad_(3rd_generation) \"IPad (3rd generation)\") Wi-Fi, [iPad mini (1st generation)](https://en.wikipedia.org/w/index.php?title=IPad_mini_(1st_generation)&action=edit&redlink=1 \"IPad mini (1st generation) (page does not exist)\") Wi-Fi and [iPod Touch (5th generation)](https://en.wikipedia.org/wiki/IPod_Touch_(5th_generation) \"IPod Touch (5th generation)\")*\n\n-   Fixes bugs with the kernel that allow unrestricted memory access and arbitrary code execution\n-   Last version of iOS for [iPhone 6S](https://en.wikipedia.org/wiki/IPhone_6S \"IPhone 6S\") and later, [iPad (4th generation)](https://en.wikipedia.org/wiki/IPad_(4th_generation) \"IPad (4th generation)\") and later, [iPad mini 2](https://en.wikipedia.org/wiki/IPad_mini_2 \"IPad mini 2\") and later, [iPad Air](https://en.wikipedia.org/wiki/IPad_Air \"IPad Air\") (1st generation) and later and [iPad Pro](https://en.wikipedia.org/wiki/IPad_Pro \"IPad Pro\") models to support [Windows XP](https://en.wikipedia.org/wiki/Windows_XP \"Windows XP\")",
    "date" : "August 25, 2016"
  },
  {
    "args" : {
      "Build" : "13G37",
      "Supported devices" : "iPhone 4S\niPad (3rd gen)\niPad mini (1st gen)",
      "Removed devices" : " iPhone 4S\niPad 2 Wi-Fi + Cellular\niPad (3rd gen) Wi-Fi + Cellular\niPad mini (1st gen) Wi-Fi + Cellular"
    },
    "version" : "9.3.6",
    "logs" : "**[iPhone 4S](https://en.wikipedia.org/wiki/IPhone_4S \"IPhone 4S\"), [iPad 2](https://en.wikipedia.org/wiki/IPad_2 \"IPad 2\") Wi-Fi + Cellular, [iPad (3rd generation)](https://en.wikipedia.org/wiki/IPad_(3rd_generation) \"IPad (3rd generation)\") Wi-Fi + Cellular and [iPad mini (1st generation)](https://en.wikipedia.org/w/index.php?title=IPad_mini_(1st_generation)&action=edit&redlink=1 \"IPad mini (1st generation) (page does not exist)\") Wi-Fi + Cellular only**\n\n*Final release supported on [iPhone 4S](https://en.wikipedia.org/wiki/IPhone_4S \"IPhone 4S\"), [iPad 2](https://en.wikipedia.org/wiki/IPad_2 \"IPad 2\") Wi-Fi + Cellular, [iPad (3rd generation)](https://en.wikipedia.org/wiki/IPad_(3rd_generation) \"IPad (3rd generation)\") Wi-Fi + Cellular and [iPad mini (1st generation)](https://en.wikipedia.org/w/index.php?title=IPad_mini_(1st_generation)&action=edit&redlink=1 \"IPad mini (1st generation) (page does not exist)\") Wi-Fi + Cellular*\n\n-   Fixes an issue that would prevent cellular devices from maintaining an accurate GPS position after November 3, 2019",
    "date" : "July 22, 2019"
  },
  {
    "args" : {
      "Build" : "14A346",
      "Supported devices" : "iPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone SE (1st gen)\niPod touch (6th gen)\niPad (4th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)",
      "Initial devices" : "iPhone 7\niPhone 7 Plus"
    },
    "version" : "10.0",
    "logs" : "*Initial release, preinstalled only on iPhone 7 and 7 Plus*.\n\n*No longer available for download due to bugs that sent devices to the recovery mode.* *Drops support for [iPad 2](https://en.wikipedia.org/wiki/IPad_2 \"IPad 2\"), [iPad (3rd generation)](https://en.wikipedia.org/wiki/IPad_(3rd_generation) \"IPad (3rd generation)\"), [iPad mini (1st generation)](https://en.wikipedia.org/wiki/IPad_Mini_(1st_generation) \"IPad Mini (1st generation)\"), [iPhone 4S](https://en.wikipedia.org/wiki/IPhone_4S \"IPhone 4S\") and [iPod touch (5th generation)](https://en.wikipedia.org/wiki/IPod_Touch_(5th_generation) \"IPod Touch (5th generation)\")*\n\n-   Introduces Expressive Messaging, allowing users to add bubble effects to messages\n-   Messages can be handwritten\n-   More apps can now integrate with Siri, including:\n    -   Messaging apps to send, read back, and search messages\n    -   VoIP apps to place phone calls\n    -   Photos apps to search for images\n    -   Ride services apps to book rides\n    -   Payment apps to make payments\n    -   Fitness apps to start, pause, and stop workouts\n    -   CarPlay apps to control car functions\n-   Maps now has Siri suggestions based on previous behavior\n-   Maps now has the option to avoid tolls and highways\n-   Photos how has face recognition features\n-   Home app is introduced to manage HomeKit accessories\n-   Home can remotely access Apple TV or iPad\n-   The Music app has been redesigned for better ease of access\n-   The For You tab in News has been redesigned\n-   Raise to Wake automatically wakes the screen if iPhone is lifted\n-   3D Touch is now used more within iOS, such as lock screen notification, widgets, Control Center, and Clear All in Notification Center\n-   New emojis, including gender diverse variations, single-parent family variations, and pride flags\n-   Predictive typing is now more accurate\n-   Voicemails now have auto-generated transcripts\n-   Third-party VoIP apps now display received calls on Lock Screen\n-   Apple Pay is now supported in Safari\n-   Two websites can be viewed at the same time using Split View on iPad\n-   US only: the Health app now records health records and organ donations\n-   Magnifier can now use the camera on iPhone or iPad as a digital magnifying glass\n-   Apple Watch can be remotely located with Find My iPhone",
    "date" : "September 13, 2016"
  },
  {
    "args" : {
      "Build" : "14A403",
      "Supported devices" : "iPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone SE (1st gen)\niPod touch (6th gen)\niPad (4th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)"
    },
    "version" : "10.0.1",
    "logs" : "-   Fixes a bug that sent devices into recovery mode after updating\n-   Fixes a bug that allows applications to disclose kernel memory",
    "date" : "September 13, 2016"
  },
  {
    "args" : {
      "Build" : "14A456",
      "Supported devices" : "iPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone SE (1st gen)\niPod touch (6th gen)\niPad (4th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)"
    },
    "version" : "10.0.2",
    "logs" : "-   Fixes an issue that could temporarily prevent headphone audio controls from working\n-   Fixes an issue that caused Photos to unexpectedly close when enabling iCloud Photo Library\n-   Fixes an issue that caused enabling app extensions to fail",
    "date" : "September 23, 2016"
  },
  {
    "args" : {
      "Build" : "14A551",
      "Supported devices" : "iPhone 7\niPhone 7 Plus"
    },
    "version" : "10.0.3",
    "logs" : "**[iPhone 7](https://en.wikipedia.org/wiki/IPhone_7 \"IPhone 7\") and iPhone 7 Plus only**\n\n-   Fixes an issue where cellular connectivity could drop on iPhone 7 and iPhone 7 Plus",
    "date" : "October 17, 2016"
  },
  {
    "args" : {
      "Builds" : "14B72\n14B72c",
      "Supported devices" : "iPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone SE (1st gen)\niPod touch (6th gen)\niPad (4th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)"
    },
    "version" : "10.1",
    "logs" : "-   Portrait Mode is added to the iPhone 7 Plus, allowing photos to create a depth effect where the subject is kept sharp but the background is blurred\n-   Fixes a bug where opening the Camera app caused severe visual glitches\n-   Fixes another issue that caused Photos to unexpectedly close when enabling iCloud Photo Library\n-   Maps now has transit support for every major train, subway, ferry, and national bus line, along with local bus systems for Tokyo, Osaka, and Nagoya\n-   Maps displays transit fare comparison\n-   Bubble and full-screen effects can be replayed in Messages\n-   Fixes a bug where contact names were displayed incorrectly in Messages\n-   Fixes a bug where Messages would open to a blank white screen\n-   Fixes a bug where the Weather widget would fail to load properly\n-   Fixes a bug where iCloud backups would fail to restore\n-   Fixes a bug where a signed application may substitute code from another application with the same team ID\n-   Fixes a bug where an application that was originally granted access to Address Book would be able to continue to access Address Book if said access was removed\n-   Fixes a bug where viewing a maliciously crafted JPEG file led to arbitrary code execution\n-   Fixes a bug where an attacker in a privileged network position may be able to simulated a FaceTime call hangup\n-   Fixes a bug where processing a maliciously crafted font led to arbitrary code execution\n-   Fixes a bug where an attacker in a privileged network position may be able to spoof the other caller in a multi-call situation\n-   Fixes a bug that allowed arbitrary code execution with kernel privileges\n-   Fixes multiple bugs that allowed an application to gain arbitrary code execution with root privileges\n-   Fixes a bug where a maliciously crafted archive may be able to overwrite arbitrary files\n-   Fixes multiple bugs where processing maliciously crafted web content may lead to arbitrary code execution",
    "date" : "October 24, 2016"
  },
  {
    "args" : {
      "Builds" : "14B100\n14B150",
      "Supported devices" : "iPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone SE (1st gen)\niPod touch (6th gen)\niPad (4th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)"
    },
    "version" : "10.1.1",
    "logs" : "-   Fixes an issue where Health data could not be viewed for some users",
    "date" : "October 31, 2016"
  },
  {
    "args" : {
      "Build" : "14C92",
      "Supported devices" : "iPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone SE (1st gen)\niPod touch (6th gen)\niPad (4th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)"
    },
    "version" : "10.2",
    "logs" : "-   New TV app for United States, replacing the Videos app introduced in iOS 5\n-   New emojis are added\n-   Improves stabilization and framerate of Live Photos\n-   Adds support for RAW digital cameras\n-   Playlists, albums, and songs can now be sorted in the Library tab\n-   Adds support for BraillePen14 in VoiceOver\n-   Disables speaking of passwords\n-   Fixes a bug where processing of a maliciously crafted audio file led to arbitrary code execution\n-   Fixes a bug where processing of a maliciously crafted MP4 file led to arbitrary code execution\n-   Fixes multiple bugs where processing of a maliciously crafted font file led to arbitrary code execution\n-   Fixes many bug where applications were able to gain arbitrary code execution with kernel privileges\n-   Fixes a bug where a user with an unlocked device may be able to force disable Find My iPhone\n-   Fixes many bugs where a local user may be able to gain root privileges\n-   Fixes a bug where the passcode attempt limit may be bypassed\n-   Fixes many bugs where processing of maliciously crafted web content led to arbitrary code execution",
    "date" : "December 9, 2016"
  },
  {
    "args" : {
      "Build" : "14D27",
      "Supported devices" : "iPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone SE (1st gen)\niPod touch (6th gen)\niPad (4th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)",
      "Initial devices" : "iPad (5th gen)"
    },
    "version" : "10.2.1",
    "logs" : "*Initial release on [iPad (5th generation)](https://en.wikipedia.org/wiki/IPad_(5th_generation) \"IPad (5th generation)\") and 32 GB [iPhone 6](https://en.wikipedia.org/wiki/IPhone_6 \"IPhone 6\")*\n\n-   Improves power management during peak workloads to avoid unexpected shutdowns\n-   Fixes multiple bugs where an application may gain arbitrary code execution with kernel privileges\n-   Fixes a bug where Apple Watch may Unlock with iPhone when not on the user's wrist\n-   Fixes many bugs where processing maliciously crafted web content may lead to arbitrary code execution\n-   Fixes a bug where an activation-locked device may briefly present the home screen",
    "date" : "January 23, 2017"
  },
  {
    "args" : {
      "Build" : "14E277",
      "Supported devices" : "iPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone SE (1st gen)\niPod touch (6th gen)\niPad (4th gen)\niPad (5th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)"
    },
    "version" : "10.3",
    "logs" : "-   Introduction of [APFS](https://en.wikipedia.org/wiki/Apple_File_System \"Apple File System\"), Apple's new [file system](https://en.wikipedia.org/wiki/File_system \"File system\"). Upon installation, devices are converted from [HFS+](https://en.wikipedia.org/wiki/HFS%2B \"HFS+\") to APFS.\n-   The iCloud account associated with a device is now displayed at the top of Settings. If no iCloud account is associated, a prompt to Sign In will be displayed.\n-   Find My AirPods allows locating of AirPods, and playing a sound to locate them\n-   Siri can display cricket scores from the Indian Premier League and the International Cricket Council\n-   The weather icon in the Maps app includes 3D Touch to show hourly forecasts\n-   CarPlay includes new shortcuts for launching recently used apps\n-   In Settings, when choosing an alphanumeric code with numbers only, passcodes can no longer be shorter than 4 characters in length.\n-   An alert is now displayed to indicate that 32-bit apps need to be updated and will no longer work in iOS 11 and later\n-   Fixes a bug that allowed a local attacker to view the associated Apple ID from Lock Screen\n-   Fixes multiple bugs where processing a maliciously crafted font may lead to denial-of-service, disclosing of kernel memory, unexpected application termination, and arbitrary code execution\n-   Fixes multiple bugs where processing of maliciously crafted web content may lead to arbitrary code execution\n-   Fixes an astonishing number of bugs where processing of maliciously crafted images may lead to arbitrary code execution\n-   Fixes an astonishing number of bugs where applications can gain arbitrary code execution with kernel privileges\n-   Fixes a bug where a third-party phone app may be able to forcefully initiate a phone call\n-   Fixes a bug where web history in Private Browsing was recorded\n-   Fixes a bug that caused address bar spoofing",
    "date" : "March 27, 2017"
  },
  {
    "args" : {
      "Build" : "14E304",
      "Supported devices" : "iPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone SE (1st gen)\niPod touch (6th gen)\niPad (4th gen)\niPad (5th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)"
    },
    "version" : "10.3.1",
    "logs" : "-   Fixes a bug where an attacker in Wi-Fi range can execute arbitrary code in baseband on iPhone 5 or later",
    "date" : "April 3, 2017"
  },
  {
    "args" : {
      "Builds" : "14F89\n14F90\n14F91\n14F8089",
      "Supported devices" : "iPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone SE (1st gen)\niPod touch (6th gen)\niPad (4th gen)\niPad (5th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)",
      "Initial devices" : "iPad Pro (10.5\")\niPad Pro (12.7\") (2nd gen)"
    },
    "version" : "10.3.2",
    "logs" : "*Initial release on [iPad Pro (10.5-inch)](https://en.wikipedia.org/wiki/IPad_Pro_(10.5-inch) \"IPad Pro (10.5-inch)\") and [iPad Pro (12.7-inch) (2nd generation)](https://en.wikipedia.org/wiki/IPad_Pro_(12.9-inch)_(2nd_generation) \"IPad Pro (12.9-inch) (2nd generation)\")*\n\n-   Fixes multiple bugs that allowed an application to gain kernel privileges\n-   Fixes a bug that allowed an application to execute arbitrary code with root privileges\n-   Fixes many bugs where processing of maliciously crafted data allowed for arbitrary code execution\n-   Fixes multiple bugs where maliciously crafted SQL queries led to arbitrary code execution\n-   Fixes an astonishing number of bugs where processing of maliciously crafted web content led to arbitrary code execution\n-   Fixes a bug that allowed an application to execute unsigned code",
    "date" : "May 15, 2017"
  },
  {
    "args" : {
      "Build" : "14G60",
      "Supported devices" : "iPhone 5\niPhone 5C\niPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone SE (1st gen)\niPod touch (6th gen)\niPad (4th gen)\niPad (5th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)\niPad Pro 12.7\" (2nd gen)\niPad Pro 10.5\""
    },
    "version" : "10.3.3",
    "logs" : "*Final release supported on [iPad (4th generation)](https://en.wikipedia.org/wiki/IPad_(4th_generation) \"IPad (4th generation)\") Wi-Fi and iPhone 5C*\n\n-   Adds new wallpapers for 12.9-inch iPad Pro\n-   Fixes multiple bugs that allowed an application to execute arbitrary code with kernel privileges\n-   Fixes a bug that caused notifications to show up on Lock Screen if this toggle was disabled\n-   Fixes multiple address bar spoofing bugs\n-   Fixes many bugs where maliciously crafted web content led to arbitrary code execution\n-   Fixes multiple bugs that allowed arbitrary code execution in baseband\n-   Last version of iOS for [iPhone 7](https://en.wikipedia.org/wiki/IPhone_7 \"IPhone 7\") and later, [iPad (5th generation)](https://en.wikipedia.org/wiki/IPad_(5th_generation) \"IPad (5th generation)\") and later, [iPad mini 2](https://en.wikipedia.org/wiki/IPad_mini_2 \"IPad mini 2\") and later, [iPad Air](https://en.wikipedia.org/wiki/IPad_Air \"IPad Air\") (1st generation) and later and [iPad Pro](https://en.wikipedia.org/wiki/IPad_Pro \"IPad Pro\") models to support [Windows Vista](https://en.wikipedia.org/wiki/Windows_Vista \"Windows Vista\")",
    "date" : "July 19, 2017"
  },
  {
    "args" : {
      "Build" : "14G61",
      "Supported devices" : "iPhone 5\niPad (4th gen)"
    },
    "version" : "10.3.4",
    "logs" : "**[iPhone 5](https://en.wikipedia.org/wiki/IPhone_5 \"IPhone 5\") and [iPad (4th generation)](https://en.wikipedia.org/wiki/IPad_(4th_generation) \"IPad (4th generation)\") Wi-Fi + Cellular only**\n\n*Final release supported on [iPad (4th generation)](https://en.wikipedia.org/wiki/IPad_(4th_generation) \"IPad (4th generation)\") Wi-Fi + Cellular and iPhone 5*\n\n-   Fixes an issue that would prevent some cellular devices from maintaining an accurate GPS position after November 3, 2019",
    "date" : "July 22, 2019"
  },
  {
    "args" : {
      "Build" : "15A372",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone SE (1st gen)\niPod touch (6th gen)\niPad (5th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)\niPad Pro 12.7\" (2nd gen)\niPad Pro 10.5\"",
      "Initial devices" : "iPhone 8\niPhone 8 Plus"
    },
    "version" : "11.0",
    "logs" : "*Initial release on [iPhone 8](https://en.wikipedia.org/wiki/IPhone_8 \"IPhone 8\") and [iPhone 8 Plus](https://en.wikipedia.org/wiki/IPhone_8_plus \"IPhone 8 plus\")*\n\n*Drops support for [iPad (4th generation)](https://en.wikipedia.org/wiki/IPad_(4th_generation) \"IPad (4th generation)\"), [iPhone 5](https://en.wikipedia.org/wiki/IPhone_5 \"IPhone 5\") and [iPhone 5C](https://en.wikipedia.org/wiki/IPhone_5C \"IPhone 5C\")*\n\n-   32-bit iOS applications are now no longer supported\n-   Many app icons are redesigned, becoming more simple\n-   Battery icon is redesigned\n-   Cellular signal strength is displayed with 4 bars in ascending scale, rather than 5 dots\n-   The Music player on Lock Screen is no longer full-screen\n-   Screenshots can be edited via cropping, drawing, and more right after taking by tapping the small window that appears after taking a screenshot\n-   Photos can be encoded with HEIF and HEVC to take up less space\n-   Portrait Mode on supported devices supports [HDR](https://en.wikipedia.org/wiki/High_dynamic_range \"High dynamic range\"), True Tone flash, and [OIS](https://en.wikipedia.org/wiki/Optical_image_stabilisation \"Optical image stabilisation\"), or Optical Image Stabilization\n-   The App Store has been redesigned\n-   Introduces Do Not Disturb while Driving to automatically disable notifications when driving, silence the phone, and keep the display off, and sending an optional autoreply sent to certain contacts via [iMessage](https://en.wikipedia.org/wiki/IMessage \"IMessage\") when they texted.\n-   Dock on iPad shows recently used apps\n-   Files app is introduced which allows browsing, searching, and organizing of both on-device and iCloud Drive files\n-   HomeKit supports sprinklers, faucets, and AirPlay 2 speakers\n-   Augmented Reality apps on the App Store allow placing virtual objects in the real world, such as [PokÃ©mon Go](https://en.wikipedia.org/wiki/Pok%C3%A9mon_Go \"PokÃ©mon Go\")\n-   Control Center is redesigned to have all toggles on one page\n-   Control Center can be customized depending on a user's needs\n-   Screen recording was added, which could be enabled by adding it to the control center\n-   Fixes multiple bugs that allowed an application to execute arbitrary code with kernel privileges\n-   Prevents an attacker in a privileged network position from erasing a device in the process of setting up a Microsoft Exchange account\n-   Fixes many bugs that allowed applications to execute arbitrary code with kernel privileges\n-   Fixes multiple bugs that caused unpacking of a maliciously crafted archive to grant arbitrary code execution\n-   Fixes a multitude of bugs that caused processing maliciously crafted XML to grant arbitrary code execution\n-   Fixes multiple bugs where processing of maliciously crafted images led to denial-of-service\n-   Prevents a remote attacker from executing arbitrary code\n-   Fixes many bugs that caused processing of maliciously crafted web content to lead to arbitrary code execution\n-   Fixes an address bar spoofing bug\n-   Fixes a bug chain that allowed arbitrary code execution on baseband, which led to arbitrary code execution with kernel privileges in userspace",
    "date" : "September 19, 2017"
  },
  {
    "args" : {
      "Builds" : "15A402\n15A403\n15A8391",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone 8\niPhone 8 Plus\niPhone SE (1st gen)\niPod touch (6th gen)\niPad (5th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)\niPad Pro 12.7\" (2nd gen)\niPad Pro 10.5\"",
      "Initial devices" : "iPhone X"
    },
    "version" : "11.0.1",
    "logs" : "*Initial release onÂ [iPhone X](https://en.wikipedia.org/wiki/IPhone_X \"IPhone X\"), preinstalled only*\n\n-   Fixes an issue withÂ [Exchange](https://en.wikipedia.org/wiki/Microsoft_Exchange_Server \"Microsoft Exchange Server\")Â email servers where email would fail to send",
    "date" : "September 26, 2017"
  },
  {
    "args" : {
      "Build" : "15A421",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone 8\niPhone 8 Plus\niPhone SE (1st gen)\niPod touch (6th gen)\niPad (5th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)\niPad Pro 12.7\" (2nd gen)\niPad Pro 10.5\""
    },
    "version" : "11.0.2",
    "logs" : "*Not available for download onÂ [iPhone X](https://en.wikipedia.org/wiki/IPhone_X \"IPhone X\")*\n\n-   Fixes an issue onÂ [iPhone 8](https://en.wikipedia.org/wiki/IPhone_8 \"IPhone 8\")Â andÂ [iPhone 8 Plus](https://en.wikipedia.org/wiki/IPhone_8_plus \"IPhone 8 plus\")Â where a crackling sound would occur during a phone call\n-   Fixes an issue where some photos could end up becoming hidden\n-   Fixes an issue where some email attachments would not open",
    "date" : "October 3, 2017"
  },
  {
    "args" : {
      "Build" : "15A432",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone 8\niPhone 8 Plus\niPhone SE (1st gen)\niPod touch (6th gen)\niPad (5th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)\niPad Pro 12.7\" (2nd gen)\niPad Pro 10.5\""
    },
    "version" : "11.0.3",
    "logs" : "*Not available for download onÂ [iPhone X](https://en.wikipedia.org/wiki/IPhone_X \"IPhone X\")*\n\n-   Fixes an issue where haptic feedback was not working on some devices\n-   Fixes an issue where touch was not working properly due to the displays not being replaced with genuine Apple displays",
    "date" : "October 11, 2017"
  },
  {
    "args" : {
      "Builds" : "15B93\n15B101",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone 8\niPhone 8 Plus\niPhone SE (1st gen)\niPhone X\niPod touch (6th gen)\niPad (5th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)\niPad Pro 12.7\" (2nd gen)\niPad Pro 10.5\""
    },
    "version" : "11.1",
    "logs" : "*Initial IPSW release forÂ [iPhone X](https://en.wikipedia.org/wiki/IPhone_X \"IPhone X\")*\n\n-   Added over 70 new emoji characters\n-   Fixes and improvements to VoiceOver rotor\n-   Fixes an issue where some photos could become blurry\n-   Fixes an issue where Live Photo effects would play slowly\n-   Fixes an issue where already cleared notifications sent from the Mail app could reappear on the Lock Screen\n-   Fixes an issue on Apple Watch where app icons would refuse to appear in notifications",
    "date" : "October 31, 2017"
  },
  {
    "args" : {
      "Build" : "15B150",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone 8\niPhone 8 Plus\niPhone SE (1st gen)\niPhone X\niPod touch (6th gen)\niPad (5th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)\niPad Pro 12.7\" (2nd gen)\niPad Pro 10.5\""
    },
    "version" : "11.1.1",
    "logs" : "-   Fixes an issue with keyboard auto-correct\n-   Fixes an issue where Hey Siri would stop working",
    "date" : "November 9, 2017"
  },
  {
    "args" : {
      "Build" : "15B202",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone 8\niPhone 8 Plus\niPhone SE (1st gen)\niPhone X\niPod touch (6th gen)\niPad (5th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)\niPad Pro 12.7\" (2nd gen)\niPad Pro 10.5\""
    },
    "version" : "11.1.2",
    "logs" : "-   Fixes an issue where a rapid drop in temperature caused problems with the touch screen of the iPhone X\n-   Fixes an issue where distortion could be caused in Live Photos and videos captured on the iPhone X",
    "date" : "November 16, 2017"
  },
  {
    "args" : {
      "Build" : "15C114",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone 8\niPhone 8 Plus\niPhone SE (1st gen)\niPhone X\niPod touch (6th gen)\niPad (5th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)\niPad Pro 12.7\" (2nd gen)\niPad Pro 10.5\""
    },
    "version" : "11.2",
    "logs" : "-   Added support for Apple Pay Cash (USA only)\n-   Improved wireless charging on the iPhone 8, iPhone 8 Plus and iPhone X\n-   Added three new Live Wallpapers for the iPhone X\n-   Fixes an issue that could cause the keyboard to appear slowly\n-   Fixes an issue in Calculator app where rapidly typing numbers could lead to incorrect calculation results",
    "date" : "December 2, 2017"
  },
  {
    "args" : {
      "Build" : "15C153",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone 8\niPhone 8 Plus\niPhone SE (1st gen)\niPhone X\niPod touch (6th gen)\niPad (5th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)\niPad Pro 12.7\" (2nd gen)\niPad Pro 10.5\""
    },
    "version" : "11.2.1",
    "logs" : "Fixes an issue where remote access could unexpectedly be disabled for shared users in the Home app",
    "date" : "December 13, 2017"
  },
  {
    "args" : {
      "Build" : "15C202",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone 8\niPhone 8 Plus\niPhone SE (1st gen)\niPhone X\niPod touch (6th gen)\niPad (5th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)\niPad Pro 12.7\" (2nd gen)\niPad Pro 10.5\""
    },
    "version" : "11.2.2",
    "logs" : "Improves security of Safari and WebKit to mitigate the effects of Spectre",
    "date" : "January 8, 2018"
  },
  {
    "args" : {
      "Build" : "15D60",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone 8\niPhone 8 Plus\niPhone SE (1st gen)\niPhone X\niPod touch (6th gen)\niPad (5th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)\niPad Pro 12.7\" (2nd gen)\niPad Pro 10.5\""
    },
    "version" : "11.2.5",
    "logs" : "-   Adds support for HomePod\n-   Siri can now read the News, with options for a general overview and more specific categories (US, UK, and Australia only)\n-   Fixes a bug that caused Messages conversations to appear out of order\n-   Fixes a bug that caused the CarPlay Now Playing controls to not respond if a track change button was pressed rapidly multiple times\n-   Fixes an issue that caused Mail notifications fromÂ [Exchange](https://en.wikipedia.org/wiki/Microsoft_Exchange_Server \"Microsoft Exchange Server\")Â accounts to vanish fromÂ [iPhone X](https://en.wikipedia.org/wiki/IPhone_X \"IPhone X\")Â if unlocked withÂ [Face ID](https://en.wikipedia.org/wiki/Face_ID \"Face ID\")",
    "date" : "January 23, 2018"
  },
  {
    "args" : {
      "Build" : "15D100",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone 8\niPhone 8 Plus\niPhone SE (1st gen)\niPhone X\niPod touch (6th gen)\niPad (5th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)\niPad Pro 12.7\" (2nd gen)\niPad Pro 10.5\""
    },
    "version" : "11.2.6",
    "logs" : "-   Fixes a bug that caused rendering the character \"à°œà±à°žà°¾\" to crash Messages\n-   Fixes an issue where third-party apps failed to connect to external accessories",
    "date" : "February 19, 2018"
  },
  {
    "args" : {
      "Builds" : "15E216\n15E218",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone 8\niPhone 8 Plus\niPhone SE (1st gen)\niPhone X\niPod touch (6th gen)\niPad (5th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)\niPad Pro 12.7\" (2nd gen)\niPad Pro 10.5\"",
      "Initial devices" : "iPad (6th gen)"
    },
    "version" : "11.3",
    "logs" : "*Initial release onÂ [iPad (6th generation)](https://en.wikipedia.org/wiki/IPad_(6th_generation) \"IPad (6th generation)\")*\n\n-   Augmented Reality\n    -   Introduces ARKit 1.5, granting developers the ability to place virtual objects on vertical surfaces, such as walls or doors, in addition to horizontal surfaces\n    -   Adds the ability to detect and implement images, such as movie posters or artwork, into Augmented Reality experiences\n-   iPhone Battery Health (Beta)\n    -   Displays information about an iPhone's battery, such as its current maximum capacity and if the battery is still supporting peak performance capabilities\n    -   Indicates if the iPhone Performance Management feature is turned on, while including the option to disable the feature is desired\n    -   Gives a recommendation if the battery inside of the iPhone should be replaced\n-   iPad Charge Management\n    -   Maintains the health of the battery when it has been connected to power for extended periods of time\n-   Animoji\n    -   Introduces four new Animoji characters: Lion, Bear, Dragon and a Skull\n-   Safari\n    -   Warnings are now shown when accessing unencrypted webpages\n-   Keyboard\n    -   Introduces two new Shuangpin keyboard layouts\n    -   Improves the Japanese and Chinese keyboards on 4.7-inch and 5.5-inch devices\n    -   Users can now switch back to the keyboard from dictation mode with one tap\n-   Adds support for using AML for Emergency SOS\n-   Podcasts episodes can now be played with a single tap\n-   Fixes a bug where the Lock Screen would blank itself except for the wallpaper\n-   Fixes a bug where parents were prevented from using Face ID to approve Ask to Buy requests\n-   Fixes a bug where audio would fail to play in cars if the app was in the background",
    "date" : "March 29, 2018"
  },
  {
    "args" : {
      "Build" : "15E302",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone 8\niPhone 8 Plus\niPhone SE (1st gen)\niPhone X\niPod touch (6th gen)\niPad (5th gen)\niPad (6th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)\niPad Pro 12.7\" (2nd gen)\niPad Pro 10.5\""
    },
    "version" : "11.3.1",
    "logs" : "-   Fixes an issue where on iPhone 8 devices where touch input would not register due to the displays being services with non-genuine\n-   Fixes a bug that allowed applications to elevate privileges\n-   Fixes two bugs where processing of maliciously crafted web content led to arbitrary code execution",
    "date" : "April 24, 2018"
  },
  {
    "args" : {
      "Build" : "15F79",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone 8\niPhone 8 Plus\niPhone SE (1st gen)\niPhone X\niPod touch (6th gen)\niPad (5th gen)\niPad (6th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)\niPad Pro 12.7\" (2nd gen)\niPad Pro 10.5\""
    },
    "version" : "11.4",
    "logs" : "-   Adds support for AirPlay 2\n-   Adds support for pairing of HomePod Stereo\n-   Allows storing of messages, photos, and more in iCloud\n-   Allows teachers to assign students reading activities in iBooks via the Schoolwork app\n-   Fixes a bug where health data failed to sync\n-   Fixes an issue where app icons may appear in the wrong locations\n-   Fixes a bug that caused CarPlay audio to distort\n-   Fixes a bug where an application may be able to elevate privileges\n-   Fixes multiple bugs where processing of maliciously crafted web content led to arbitrary code execution\n-   Fixes many bugs where applications could gain arbitrary code execution with kernel privileges\n-   Fixes bugs where local users could read persistent account identifiers\n-   Fixes a bug that allowed Siri to be enabled from lock screen, and thus display notifications that would be otherwise hidden",
    "date" : "May 29, 2018"
  },
  {
    "args" : {
      "Build" : "15G77",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone 8\niPhone 8 Plus\niPhone SE (1st gen)\niPhone X\niPod touch (6th gen)\niPad (5th gen)\niPad (6th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)\niPad Pro 12.7\" (2nd gen)\niPad Pro 10.5\""
    },
    "version" : "11.4.1",
    "logs" : "-   Fixes a bug that caused users to not read the last known location of AirPods in Find My iPhone\n-   Improves reliability ofÂ [Exchange](https://en.wikipedia.org/wiki/Microsoft_Exchange_Server \"Microsoft Exchange Server\")Â account services\n-   Fixes a bug that caused cookies to fail to delete\n-   Fixes a bug that allowed an application to elevate privileges\n-   Fixes multiple bugs that allowed for arbitrary code execution with kernel privileges\n-   Fixes a bug that allowed a phone call to be forcefully initiated\n-   Fixes multiple bugs that allowed for address bar spoofing\n-   Fixes multiple bugs that caused processing of maliciously crafted web content to lead to arbitrary code execution\n-   Fixes an app sandbox escape",
    "date" : "July 9, 2018"
  },
  {
    "args" : {
      "Builds" : "16A366\n16A367",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone 8\niPhone 8 Plus\niPhone SE (1st gen)\niPhone X\niPod touch (6th gen)\niPad (5th gen)\niPad (6th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)\niPad Pro 12.7\" (2nd gen)\niPad Pro 10.5\"",
      "Initial devices" : "iPhone XS\niPhone XS Max\niPhone XR"
    },
    "version" : "12.0",
    "logs" : "Initial release onÂ [iPhone XR](https://en.wikipedia.org/wiki/IPhone_XR \"IPhone XR\"), [iPhone XS](https://en.wikipedia.org/wiki/IPhone_XS \"IPhone XS\")Â andÂ [XS Max](https://en.wikipedia.org/wiki/IPhone_XS \"IPhone XS\")\n\n-   Allows searching for photos based on their geotag information\n-   Introduces Memoji, a customizable Animoji\n-   Adds a Deliver Quietly feature for the Do Not Disturb feature, which silently delivers notifications\n-   Adds the Siri Suggestions panel to Lock Screen and Search\n-   Enables Siri to turn on the flashlight\n-   Introduces the Measure app, which uses Augmented Reality to measure objects and spaces\n-   Speed and performance improvements.\n-   Fixes a bug that allows applications to read the user's Apple ID\n-   Fixes a bug that allows maliciously crafted iBooks file to access user information\n-   Fixes a bug that allowed local users to recover deleted messages\n-   Fixes a bug that prevented a user from deleting browser history",
    "date" : "September 17, 2018"
  },
  {
    "args" : {
      "Builds" : "16A404\n16A405",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone 8\niPhone 8 Plus\niPhone SE (1st gen)\niPhone X\niPhone XS\niPhone XS Max\niPhone XR\niPod touch (6th gen)\niPad (5th gen)\niPad (6th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)\niPad Pro 12.7\" (2nd gen)\niPad Pro 10.5\""
    },
    "version" : "12.0.1",
    "logs" : "-   Fixes an issue where some iPhone XS devices did not immediately start charging when connected to a Lightning cable that was capable of charging.\n-   Resolves an issue that caused some iPhone XS units to rejoin Wi-Fi networks at 2.4 GHz instead of 5 GHz.\n-   Restores the original position of the \".?123\" key on the iPad.\n-   Fixes an issue where subtitles failed to appear in some 3rd party video apps.\n-   Fixes an issue where Bluetooth could become unavailable.\n-   Strengthens the security on the lock screen due to local attackers being able to access photos, contacts, and the share function on a locked device.",
    "date" : "October 8, 2018"
  },
  {
    "args" : {
      "Builds" : "16B92\n16B93\n16B94",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone 8\niPhone 8 Plus\niPhone SE (1st gen)\niPhone X\niPhone XS\niPhone XS Max\niPhone XR\niPod touch (6th gen)\niPad (5th gen)\niPad (6th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)\niPad Pro 12.7\" (2nd gen)\niPad Pro 10.5\"",
      "Initial devices" : "iPad Pro (3rd gen)"
    },
    "version" : "12.1",
    "logs" : "*Initial release onÂ [iPad Pro (3rd generation)](https://en.wikipedia.org/wiki/IPad_Pro_(3rd_generation) \"IPad Pro (3rd generation)\")*\n\n-   Introduces Group FaceTime support, which allows up to 32 simultaneous participants in a call.\n-   Adds dual SIM support using eSIMs for the iPhone XS, iPhone XS Max, and iPhone XR.\n-   Introduces Depth Control in Camera preview for iPhone XS, iPhone XS Max, and iPhone XR.\n-   Fixes a bug where messages were merged into one thread if two users were signed into the same Apple ID on separate devices,\n-   Resolves an issue where a contact name could fail to appear alongside a phone number.\n-   Fixes a bug where no family members could be added or removed from Family Sharing.\n-   Adds the ability for an iPhone XS, iPhone XS Max, or iPhone XR to detect if the battery installed is a genuine Apple battery\n-   Adds a performance management feature to prevent sudden shutdowns for an iPhone 8, iPhone 8 Plus, or iPhone X, with the ability to disable this.\n-   Fixes bug that allows a remote attacker to forcefully initiate a FaceTime call.",
    "date" : "October 30, 2018"
  },
  {
    "args" : {
      "Build" : "16C50",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone 8\niPhone 8 Plus\niPhone SE (1st gen)\niPhone X\niPhone XS\niPhone XS Max\niPhone XR\niPod touch (6th gen)\niPad (5th gen)\niPad (6th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)\niPad Pro 12.7\" (2nd gen)\niPad Pro (3rd gen)\niPad Pro 10.5\""
    },
    "version" : "12.1.1",
    "logs" : "-   Adds the ability to use separate carriers with dual SIM functionality.\n-   Allows Live Photo capture during one-to-one FaceTime calls.\n-   Allows switching between front and rear cameras with one tap in FaceTime.\n-   Fixes an issue where Face ID may become unavailable.\n-   Fixes issue where time zones did not update automatically.\n-   Fixes issue in Messages that prevented predictive text suggestions when using Chinese or Japanese keyboards.\n-   Increased lock screen security to prevent local attackers from accessing Contacts from the lock screen.\n-   Fixes bug that prevents fully deleting browser history.",
    "date" : "December 5, 2018"
  },
  {
    "args" : {
      "Builds" : "16C101\n16C104",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone 8\niPhone 8 Plus\niPhone SE (1st gen)\niPhone X\niPhone XS\niPhone XS Max\niPhone XR"
    },
    "version" : "12.1.2",
    "logs" : "Only for iPhones\n\n-   Fixes bugs with eSIM activation for iPhone XS, iPhone XS Max, and iPhone XR.\n-   Fixes an issue where cellular connectivity was affected in Turkey for iPhone XS, iPhone XS Max, and iPhone XR.",
    "date" : "December 17, 2018"
  },
  {
    "args" : {
      "Builds" : "16D39\n16D40",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone 8\niPhone 8 Plus\niPhone SE (1st gen)\niPhone X\niPhone XS\niPhone XS Max\niPhone XR\niPod touch (6th gen)\niPad (5th gen)\niPad (6th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)\niPad Pro 12.7\" (2nd gen)\niPad Pro (3rd gen)\niPad Pro 10.5\""
    },
    "version" : "12.1.3",
    "logs" : "-   Fixes issue that may cause artifacting in images sent from the Share Sheet.\n-   Fixes issue that caused some CarPlay systems to disconnect from iPhone XS, iPhone XS Max, and iPhone XR.\n-   Fixes another issue that allowed a remote attacker to forcefully initiate a FaceTime call.",
    "date" : "January 22, 2019"
  },
  {
    "args" : {
      "Build" : "16D57",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone 8\niPhone 8 Plus\niPhone SE (1st gen)\niPhone X\niPhone XS\niPhone XS Max\niPhone XR\niPod touch (6th gen)\niPad (5th gen)\niPad (6th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)\niPad Pro 12.7\" (2nd gen)\niPad Pro (3rd gen)\niPad Pro 10.5\""
    },
    "version" : "12.1.4",
    "logs" : "-   Fixes a bug where the initiator of a Group FaceTime call can force all of the recipients to answer.",
    "date" : "February 7, 2019"
  },
  {
    "args" : {
      "Build" : "16E227",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone 8\niPhone 8 Plus\niPhone SE (1st gen)\niPhone X\niPhone XS\niPhone XS Max\niPhone XR\niPod touch (6th gen)\niPad (5th gen)\niPad (6th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Air\niPad Air 2\niPad Pro 12.9\" (1st gen)\niPad Pro 12.7\" (2nd gen)\niPad Pro (3rd gen)\niPad Pro 10.5\"",
      "Initial devices" : "iPad Air (3rd gen)\niPad Mini (5th gen)"
    },
    "version" : "12.2",
    "logs" : "Initial release onÂ [iPad Air (3rd gen)](https://en.wikipedia.org/wiki/IPad_Air_(3rd_generation) \"IPad Air (3rd gen)\")Â andÂ [iPad Mini (5th gen)](https://en.wikipedia.org/wiki/IPad_Mini_(5th_generation) \"IPad Mini (5th generation)\")\n\n-   Introduces Apple News+, a subscription service for Apple news.\n-   Enables Ask Siri to allow play any video, show, movie, sports game, or channel on a Apple TV.\n-   Introduces four new Animoji faces - owl, boar, giraffe, shark, for iPhone X and later.\n-   Adds AirPlay controls into Control Center\n-   Adds support for the AirPods (2nd generation).\n-   Adds support for Air Quality Index in theÂ [US](https://en.wikipedia.org/wiki/United_States \"United States\"),Â [UK](https://en.wikipedia.org/wiki/United_Kingdom \"United Kingdom\"), andÂ [India](https://en.wikipedia.org/wiki/India \"India\").\n-   Fixes bug where the reported size of large apps, System, and Other could be reported incorrectly in the iPhone Storage section of settings.\n-   Fixes a bug where an attacker could intercept network traffic.\n-   Fixes a bug where websites could access sensor information without user consent.\n-   Fixes a bug where websites could access the microphone without the microphone usage indicator being shown.",
    "date" : "March 25, 2019"
  },
  {
    "args" : {
      "Builds" : "16F156\n16F8155",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone 8\niPhone 8 Plus\niPhone SE (1st gen)\niPhone X\niPhone XS\niPhone XS Max\niPhone XR\niPod touch (6th gen)\niPad (5th gen)\niPad (6th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Mini (5th gen)\niPad Air\niPad Air 2\niPad Air (3rd gen)\niPad Pro 12.9\" (1st gen)\niPad Pro 12.7\" (2nd gen)\niPad Pro (3rd gen)\niPad Pro 10.5\"",
      "Initial devices" : " iPod Touch (7th gen)"
    },
    "version" : "12.3",
    "logs" : "Initial release onÂ [iPod Touch (7th generation)](https://en.wikipedia.org/wiki/IPod_Touch_(7th_generation) \"IPod Touch (7th generation)\")\n\n-   Introduces AirPlay 2\n-   Introduces the Apple TV app, which lets users access Apple TV shows from their iPhone or iPad.\n-   Fixes bugs where apps could cause unexpected shutdowns\n-   the TV app was removed and replaced by apple TV.",
    "date" : "May 13, 2019"
  },
  {
    "args" : {
      "Builds" : "16F203\n16F8202",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone 8\niPhone 8 Plus\niPhone SE (1st gen)\niPhone X\niPhone XS\niPhone XS Max\niPhone XR\niPod touch (6th gen)\niPod Touch (7th gen)\niPad (5th gen)\niPad (6th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Mini (5th gen)\niPad Air\niPad Air 2\niPad Air (3rd gen)\niPad Pro 12.9\" (1st gen)\niPad Pro 12.7\" (2nd gen)\niPad Pro (3rd gen)\niPad Pro 10.5\""
    },
    "version" : "12.3.1",
    "logs" : "-   Fixes bug preventing use of VoLTE calls\n-   Fixes issue that allowed messages from unknown senders to appear in Messages despite Filter Unknown Senders being enabled\n-   Fixes issue that prevented the Report Junk link from appearing in a message from an unknown sender",
    "date" : "May 24, 2019"
  },
  {
    "args" : {
      "Build" : "16F250",
      "Supported devices" : "iPhone 8 Plus"
    },
    "version" : "12.3.2",
    "logs" : " - Exclusive to the iPhone 8 Plus, resolving an issue that could cause Camera to capture Portrait mode photos without depth effect on some devices",
    "date" : "June 10, 2019"
  },
  {
    "args" : {
      "Build" : "16G77",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone 8\niPhone 8 Plus\niPhone SE (1st gen)\niPhone X\niPhone XS\niPhone XS Max\niPhone XR\niPod touch (6th gen)\niPod Touch (7th gen)\niPad (5th gen)\niPad (6th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Mini (5th gen)\niPad Air\niPad Air 2\niPad Air (3rd gen)\niPad Pro 12.9\" (1st gen)\niPad Pro 12.7\" (2nd gen)\niPad Pro (3rd gen)\niPad Pro 10.5\""
    },
    "version" : "12.4",
    "logs" : "-  Adds support for theÂ [Apple Card](https://en.wikipedia.org/wiki/Apple_Card \"Apple Card\").\n-   Adds the ability to wirelessly transfer data between iPhones running iOS 12.4 or newer in Setup.\n-   Makes all of the downloaded magazines in News available offline.",
    "date" : "July 22, 2019"
  },
  {
    "args" : {
      "Build" : "16G102",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone 8\niPhone 8 Plus\niPhone SE (1st gen)\niPhone X\niPhone XS\niPhone XS Max\niPhone XR\niPod touch (6th gen)\niPod Touch (7th gen)\niPad (5th gen)\niPad (6th gen)\niPad Mini 2\niPad Mini 3\niPad Mini 4\niPad Mini (5th gen)\niPad Air\niPad Air 2\niPad Air (3rd gen)\niPad Pro 12.9\" (1st gen)\niPad Pro 12.7\" (2nd gen)\niPad Pro (3rd gen)\niPad Pro 10.5\""
    },
    "version" : "12.4.1",
    "logs" : " - Undoes a vulnerability fix reversal from the previous release",
    "date" : "August 26, 2019"
  },
  {
    "args" : {
      "Build" : "16G114",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPod touch (6th gen)\niPad Mini 2\niPad Mini 3\niPad Air"
    },
    "version" : "12.4.2",
    "logs" : " - Fixes bug that allows applications to read restricted memory",
    "date" : "September 26, 2019"
  },
  {
    "args" : {
      "Build" : "16G130",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPod touch (6th gen)\niPad Mini 2\niPad Mini 3\niPad Air"
    },
    "version" : "12.4.3",
    "logs" : " - Fixes bug that allows AirDrop transfers to be forcefully accepted when the receiver is in Everyone mode",
    "date" : "October 28, 2019"
  },
  {
    "args" : {
      "Build" : "16G140",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPod touch (6th gen)\niPad Mini 2\niPad Mini 3\niPad Air"
    },
    "version" : "12.4.4",
    "logs" : " - Fixes bug that allows a malicious video sent by FaceTime to lead to arbitrary code execution",
    "date" : "December 10, 2019"
  },
  {
    "args" : {
      "Build" : "16G161",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPod touch (6th gen)\niPad Mini 2\niPad Mini 3\niPad Air"
    },
    "version" : "12.4.5",
    "logs" : " - Security fixes, no published CVE entries",
    "date" : "January 28, 2020"
  },
  {
    "args" : {
      "Build" : "16G183",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPod touch (6th gen)\niPad Mini 2\niPad Mini 3\niPad Air"
    },
    "version" : "12.4.6",
    "logs" : " - Security fixes, no published CVE entries",
    "date" : "March 24, 2020"
  },
  {
    "args" : {
      "Build" : "16G192",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPod touch (6th gen)\niPad Mini 2\niPad Mini 3\niPad Air"
    },
    "version" : "12.4.7",
    "logs" : " - Fixes bugs in the Mail app that allowed kernel corruption and panics",
    "date" : "May 20, 2020"
  },
  {
    "args" : {
      "Build" : "16G201",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPod touch (6th gen)\niPad Mini 2\niPad Mini 3\niPad Air"
    },
    "version" : "12.4.8",
    "logs" : " - Security fixes, no published CVE entries",
    "date" : "July 15, 2020"
  },
  {
    "args" : {
      "Build" : "16H5",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPod touch (6th gen)\niPad Mini 2\niPad Mini 3\niPad Air"
    },
    "version" : "12.4.9",
    "logs" : "-   Fixes bug that allowed users in Group FaceTime to enable video without being notified of it.\n-   Fixes bug that allowed maliciously crafted font to gain arbitrary code execution.\n-   Fixes bugs with the kernel that allows disclosing of kernel memory and arbitrary code execution with kernel privileges.",
    "date" : "November 5, 2020"
  },
  {
    "args" : {
      "Build" : "16H20",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPod touch (6th gen)\niPad Mini 2\niPad Mini 3\niPad Air"
    },
    "version" : "12.5",
    "logs" : "-   Adds opt-in forÂ [COVID-19](https://en.wikipedia.org/wiki/COVID-19 \"COVID-19\")Â exposure notifications onÂ [iPhone 5S](https://en.wikipedia.org/wiki/IPhone_5S \"IPhone 5S\")Â andÂ [iPhone 6/6 Plus](https://en.wikipedia.org/wiki/IPhone_6 \"IPhone 6\").\n-   Fixes bug where unauthorized code execution led to violation of authentication policy.",
    "date" : "December 14, 2020"
  },
  {
    "args" : {
      "Build" : "16H22",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPod touch (6th gen)\niPad Mini 2\niPad Mini 3\niPad Air"
    },
    "version" : "12.5.1",
    "logs" : " - Fixes an issue where Exposure Notifications could incorrectly display logging profile language on the iPhone 5S and the iPhone 6/6 Plus.",
    "date" : "January 11, 2021"
  },
  {
    "args" : {
      "Build" : "16H30",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPod touch (6th gen)\niPad Mini 2\niPad Mini 3\niPad Air"
    },
    "version" : "12.5.2",
    "logs" : " - Fixes bug where processing of maliciously crafted web content may lead to universal cross-site scripting",
    "date" : "March 26, 2021"
  },
  {
    "args" : {
      "Build" : "16H41",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPod touch (6th gen)\niPad Mini 2\niPad Mini 3\niPad Air"
    },
    "version" : "12.5.3",
    "logs" : " - Fixes bugs where processing of maliciously crafted web content may lead to arbitrary code execution.",
    "date" : "May 3, 2021"
  },
  {
    "args" : {
      "Build" : "16H50",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPod touch (6th gen)\niPad Mini 2\niPad Mini 3\niPad Air"
    },
    "version" : "12.5.4",
    "logs" : "-   Fixes bugs where processing of maliciously crafted web content may lead to arbitrary code execution.\n-   Fixes bug where processing of maliciously crafted security certificate may lead to arbitrary code execution.",
    "date" : "June 14, 2021"
  },
  {
    "args" : {
      "Build" : "16H62",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPod touch (6th gen)\niPad Mini 2\niPad Mini 3\niPad Air"
    },
    "version" : "12.5.5",
    "logs" : "-   Fixes bug where processing a maliciously crafted PDF leads to arbitrary code execution.\n-   Fixes bug where processing maliciously crafted web content may lead to arbitrary code execution.\n-   Fixes bug where a malicious application is able to gain arbitrary code execution with kernel privileges.",
    "date" : "September 23, 2021"
  },
  {
    "args" : {
      "Build" : "16H71",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPod touch (6th gen)\niPad Mini 2\niPad Mini 3\niPad Air"
    },
    "version" : "12.5.6",
    "logs" : "-   Fixes bug where processing maliciously crafted web content may lead to arbitrary code execution.",
    "date" : "August 31, 2022"
  },
  {
    "args" : {
      "Build" : "16H81",
      "Supported devices" : "iPhone 5S\niPhone 6\niPhone 6 Plus\niPod touch (6th gen)\niPad Mini 2\niPad Mini 3\niPad Air"
    },
    "version" : "12.5.7",
    "logs" : "-   Fixes a vulnerability where processing maliciously crafted web content may lead to arbitrary code execution.",
    "date" : "January 23, 2023"
  },
  {
    "args" : {
      "Build" : "17A577",
      "Supported devices" : "iPhone 6S\niPhone 6S Plus\niPhone 7\niPhone 7 Plus\niPhone 8\niPhone 8 Plus\niPhone SE (1st gen)\niPhone X\niPhone XS\niPhone XS Max\niPhone XR\niPod Touch (7th gen)\niPad (5th gen)\niPad (6th gen)\niPad Mini 4\niPad Mini (5th gen)\niPad Air 2\niPad Air (3rd gen)\niPad Pro 12.9\" (1st gen)\niPad Pro 12.7\" (2nd gen)\niPad Pro (3rd gen)\niPad Pro 10.5\"",
      "Initial devices" : "iPhone 11\niPhone 11 Pro\niPhone 11 Pro Max"
    },
    "version" : "13.0",
    "logs" : "Initial release onÂ [iPhone 11](https://en.wikipedia.org/wiki/IPhone_11 \"IPhone 11\"),Â [iPhone 11 Pro](https://en.wikipedia.org/wiki/IPhone_11_Pro \"IPhone 11 Pro\"), andÂ [iPhone 11 Pro Max](https://en.wikipedia.org/wiki/IPhone_11_Pro_Max \"IPhone 11 Pro Max\")\n\n-   Introduces Dark Mode\n-   Introduces \"Sign in with Apple\", allowing users to link accounts to their Apple ID\n-   Introduces Apple Arcade\n-   Integrates Siri and Shortcuts\n-   Adds more Memoji customization options\n-   Redesigns the CarPlay Dashboard\n-   Adds custom fonts to the App Store\n-   Enables external drive support in the Files app\n-   Enables SMB support in the Files app\n-   Enables extraction and compression of .zip archives\n-   Adds \"Allow Once\" location permission\n-   Redesigns volume control in the upper-left corner to be less unobtrusive\n-   Adds 38 more keyboard languages\n-   Adds Voice Control\n-   Introduces Low Data Mode, to reduce data usage over cellular networks\n-   Introduces Optimized Battery Charging, which learns from your charging behavior to only charge your device when you need it\n-   Find My iPhone and Find My Friends are combined into one app",
    "date" : "September 19, 2019"
  }
]