[
  {
    "name": "A",
    "api": 1,
    "date": "September 23, 2008",
    "v": "1.0",
    "cl": "Android Market allowed application downloads and updates through the Market application.\nWeb browser to show, zoom and pan full HTML and XHTML web pages – multiple pages show as windows (\"cards\").[36][37]\nCamera support – however, this version lacked the option to change the camera's resolution, white balance, quality, etc.[38]\nFolders allowing the grouping of a number of application icons into a single folder icon on the Home screen.[39]\nAccess to web email servers, supporting POP3, IMAP4, and SMTP.[37]\nGmail synchronization with the Gmail application.\nGoogle Contacts synchronization with the People application.\nGoogle Calendar synchronization with the Calendar application.\nGoogle Maps with Street View to view maps and satellite imagery, as well as find local businesses and obtain driving directions using GPS.[38]\nGoogle Sync, allowing management of over-the-air synchronization of Gmail, People, and Calendar.\nGoogle Search, allowing users to search the Internet and phone applications, contacts, calendar, etc.\nGoogle Talk instant messaging.\nInstant messaging, text messaging, and MMS.\nMedia Player, enabling management, importing, and playback of media files – however, this version lacked video and stereo Bluetooth support.[37][38]\nNotifications appear in the Status bar, with options to set ringtone, LED or vibration alerts.[36][37][40]\nVoice Dialer allows dialing and placing of phone calls without typing a name or number.[37]\nWallpaper allows the user to set the background image or photo behind the Home screen icons and widgets.\nYouTube video player.[41]\nOther applications include: Alarm Clock, Calculator, Dialer (Phone), Home screen (Launcher), Pictures (Gallery), and Settings.\nWi-Fi and Bluetooth support."
  },
  {
    "name": "B",
    "api": 2,
    "date": "February 9, 2009",
    "v": "1.1",
    "cl": "Details and reviews available when a user searches for businesses on Maps.\nLonger in-call screen timeout by default when using the speakerphone, plus the ability to show/hide the dialpad.\nAbility to save attachments in messages.\nSupport added for marquee in system layouts."
  },{
    "name": "Cupcake",
    "api": 3,
    "date": "April 27, 2009",
    "v": "1.5",
    "cl": "Support for third-party virtual keyboards with text prediction and a user dictionary for custom words.\nSupport for Widgets – miniature application views that can be embedded in other applications (such as the Home screen) and receive periodic updates.[47]\nVideo recording and playback in MPEG-4 and 3GP formats.\nAuto-pairing and stereo support for Bluetooth (A2DP and AVRCP profiles).\nCopy and paste features in web browser.\nUser pictures shown for Favorites in Contacts.\nSpecific date/time stamp shown for events in call log, and one-touch access to a contact card from a call log event.\nAnimated screen transitions.\nAuto-rotation option.\nNew stock boot animation.\nAbility to upload videos to YouTube.\nAbility to upload photos to Picasa.\nAbility to check phone usage history.[48]"
  },{
    "name": "Donut",
    "api": 4,
    "date": "September 15, 2009",
    "v": "1.6",
    "cl": "Voice and text entry search enhanced to include bookmark history, contacts, and the web.\nAbility for developers to include their content in search results.\nMulti-lingual speech synthesis engine to allow any Android application to \"speak\" a string of text.\nEasier searching and the ability to view app screenshots in Android Market.\nGallery, Camera and camcorder more fully integrated, with faster camera access.\nAbility for users to select multiple photos for deletion.\nUpdated technology support for CDMA/EVDO, 802.1x, VPNs, and a text-to-speech engine.\nSupport for WVGA screen resolutions.\nSpeed improvements in searching and camera applications.\nExpanded Gesture framework and a new GestureBuilder development tool."
  },
  {
    "name": "Eclair",
    "api": 5,
    "date": "October 26, 2009",
    "v": "2.0",
    "cl": "Expanded Account sync, allowing users to add multiple accounts to a device for synchronization of an email and contacts.\nMicrosoft Exchange email support, with a combined inbox to browse an email from multiple accounts in one page.\nBluetooth 2.1 support.\nAbility to tap a Contacts photo and select to call, SMS, or email the person.\nAbility to search all saved SMS and MMS messages, with the added ability to delete the oldest messages in a conversation automatically deleted when a defined limit is reached.\nNumerous new camera features, including flash support, digital zoom, scene mode, white balance, color effect and macro focus.\nImproved typing speed on a virtual keyboard, with a smarter dictionary that learns from word usage and includes contact names as suggestions.\nRefreshed browser UI with bookmark thumbnails, double-tap zoom and support for HTML5.\nCalendar agenda view enhanced, showing attending status for each invitee, and the ability to invite new guests to events.\nOptimized hardware speed and revamped UI.\nSupport for more screen sizes and resolutions, with better contrast ratio.\nImproved Google Maps 3.1.2.\nMotionEvent class enhanced to track multi-touch events.[54]\nAddition of live wallpapers, allowing the animation of home-screen background images to show movement."
  },
  {
    "name": "Eclair",
    "api": 6,
    "date": "December 3, 2009",
    "v": "2.0.1",
    "cl": "Minor API changes, bug fixes and framework behavioral changes."
  },
  {
    "name": "Eclair",
    "api": 7,
    "date": "January 12, 2010",
    "v": "2.1",
    "cl": "Minor amendments to the API and bug fixes."
  },
  {
    "name": "Froyo",
    "api": 8,
    "date": "May 20, 2010",
    "v": "2.2",
    "cl": "Speed, memory, and performance optimizations.[58]\nAdditional application speed improvements, implemented through JIT compilation.[59]\nIntegration of Chrome's V8 JavaScript engine into the Browser application.\nSupport for the Android Cloud to Device Messaging (C2DM) service, enabling push notifications.\nImproved Microsoft Exchange support, including security policies, auto-discovery, GAL look-up, calendar synchronization and remote wipe.\nImproved application launcher with shortcuts to Phone and Browser applications.\nUSB tethering and Wi-Fi hotspot functionality[60]\nOption to disable data access over a mobile network.\nUpdated Market application with batch and automatic update features.[58]\nQuick switching between multiple keyboard languages and their dictionaries.\nSupport for Bluetooth-enabled car and desk docks.\nSupport for numeric and alphanumeric passwords.\nSupport for file upload fields in the Browser application.[61]\nThe browser now shows all frames of animated GIFs instead of just the first frame only.\nSupport for installing applications to expandable memory.\nAdobe Flash support.[62]\nSupport for high-PPI displays (up to 320 ppi), such as four-inch 720p screens.[63]\nGallery allows users to view picture stacks using a zoom gesture."
  },
  {
    "name": "Froyo",
    "api": 8,
    "date": "January 18, 2011",
    "v": "2.2.1",
    "cl": "Bug fixes, security updates and performance improvements."
  },
  {
    "name": "Froyo",
    "api": 8,
    "date": "January 22, 2011",
    "v": "2.2.2",
    "cl": "Minor bug fixes, including SMS routing issues that affected the Nexus One.[64]"
  },
  {
    "name": "Froyo",
    "api": 8,
    "date": "November 21, 2011",
    "v": "2.2.3",
    "cl": "Two security updates."
  },
  {
    "name": "Gingerbread",
    "api": 9,
    "date": "December 6, 2010",
    "v": "2.3",
    "cl": "Updated user interface design with increased simplicity and speed.\nSupport for extra-large screen sizes and resolutions (WXGA and higher).[63]\nNative support for SIP VoIP internet telephones.\nFaster, more intuitive text input on a virtual keyboard, with improved accuracy, better suggested text and voice input mode.\nEnhanced copy/paste functionality, allowing users to select a word by press-holding, copying, and pasting.\nSupport for Near Field Communication (NFC), allowing the user to read an NFC tag embedded in a poster, sticker, or advertisement.\nNew audio effects such as reverb, equalization, headphone virtualization, and bass boost.\nNew Download Manager, giving users easy access to any file downloaded from the browser, email, or another application.\nSupport for multiple cameras on the device, including a front-facing camera, if available.\nSupport for WebM/VP8 video playback, and AAC audio encoding.\nImproved power management with a more active role in managing applications that are keeping the device awake for too long.\nEnhanced support for native code development.\nSwitched from YAFFS to ext4 on newer devices.[68][69]\nAudio, graphical, and input enhancements for game developers.\nConcurrent garbage collection for increased performance.\nNative support for more sensors (such as gyroscopes and barometers).\nFirst Android version to feature an Easter egg. It was an image of the Bugdroid standing next to a zombie gingerbread man, with many more zombies in the background."
  },
  {
    "name": "Gingerbread",
    "api": 9,
    "date": "December 2010",
    "v": "2.3.1",
    "cl": "Improvements and bug fixes for the Nexus S."
  },
  {
    "name": "Gingerbread",
    "api": 9,
    "date": "January 2011",
    "v": "2.3.2",
    "cl": "Improvements and bug fixes for the Nexus S."
  },
  {
    "name": "Gingerbread",
    "api": 10,
    "date": "February 9, 2011",
    "v": "2.3.3",
    "cl": "Several improvements and API fixes.[70]"
  },
  {
    "name": "Gingerbread",
    "api": 10,
    "date": "April 28, 2011",
    "v": "2.3.4",
    "cl": "Support for voice or video chat using Google Talk.[72]\nOpen Accessory Library support. Open Accessory was introduced in 3.1 (Honeycomb) but the Open Accessory Library grants 2.3.4 added support when connecting to a USB peripheral with compatible software and a compatible application on the device.[73]\nSwitched the default encryption for SSL from AES256-SHA to RC4-MD5.[74][75]\nFixed a spontaneous reboot on Samsung Galaxy S Plus."
  },
  {
    "name": "Gingerbread",
    "api": 10,
    "date": "July 25, 2011",
    "v": "2.3.5",
    "cl": "Improved network performance for the Nexus S 4G, among other fixes and improvements.\nFixed a Bluetooth bug on Samsung Galaxy S.\nFixed a Wi-Fi crash on Samsung Galaxy S Plus.\nImproved the Gmail application.\nShadow animations for list scrolling.\nCamera software enhancements.[76]\nImproved battery efficiency."
  },
  {
    "name": "Gingerbread",
    "api": 10,
    "date": "September 2, 2011",
    "v": "2.3.6",
    "cl": "Fixed a voice search bug."
  },
  {
    "name": "Gingerbread",
    "api": 10,
    "date": "September 21, 2011",
    "v": "2.3.7",
    "cl": "Google Wallet support for the Nexus S 4G."
  },
  {
    "name": "Honeycomb",
    "api": 11,
    "date": "February 22, 2011",
    "v": "3.0",
    "cl": "Optimized tablet support with a new “holographic” user interface (removed again the following year with version 4.2).[85]\nNew Easter egg, an image of a Tron-themed bumblebee.\nAdded System Bar, featuring quick access to notifications, status, and soft navigation buttons, available at the bottom of the screen.\nAdded the Action Bar, giving access to contextual options, navigation, widgets, or other types of content at the top of the screen.\nSimplified multitasking – tapping Recent Applications in the System Bar allows users to see snapshots of the tasks underway and quickly jump from one application to another.\nRedesigned the keyboard, making typing fast, efficient and accurate on larger screen sizes\nSimplified, more intuitive copy/paste interface.\nMultiple browser tabs replacing browser windows, plus form auto-fill and a new “incognito” mode allowing anonymous browsing.\nQuick access to camera exposure, focus, flash, zoom, front-facing camera, time-lapse, and other camera features.\nAbility to view albums and other collections in full-screen mode in Gallery, with easy access to thumbnails for other photos.\nNew two-pane Contacts UI and Fast Scroll to let users easily organize and locate contacts.\nNew two-pane Email UI to make viewing and organizing messages more efficient, allowing users to select one or more messages.\nHardware acceleration.\nSupport for multi-core processors.\nAbility to encrypt all user data.\nHTTPS stack improved with Server Name Indication (SNI).\nFilesystem in Userspace (FUSE; kernel module).\nDisallows applications from having to write access to secondary storage (memory cards on devices with internal primary storage) outside of designated, application-specific directories. Full access to primary internal storage is still allowed through a separate application-level permission.[86][87]"
  },
  {
    "name": "Honeycomb",
    "api": 12,
    "date": "May 10, 2011",
    "v": "3.1",
    "cl": "UI refinements.\nConnectivity for USB accessories (USB On-The-Go).\nExpanded Recent Applications list.\nResizable Home screen widgets.\nSupport for external keyboards and pointing devices.\nSupport for joysticks and gamepads.\nSupport for FLAC audio playback.[89][90]\nHigh-performance Wi-Fi lock, maintaining high-performance Wi-Fi connections when the device screen is off.\nSupport for HTTP proxy for each connected Wi-Fi access point."
  },
  {
    "name": "Honeycomb",
    "api": 13,
    "date": "July 15, 2011",
    "v": "3.2",
    "cl": "Improved hardware support, including optimizations for a wider range of tablets.\nIncreased ability of applications to access files on the SD card, e.g. for synchronization.\nCompatibility display mode for applications that have not been optimized for tablet screen resolutions.\nNew display support functions, giving developers more control over display appearance on different Android devices.[92]"
  },
  {
    "name": "Honeycomb",
    "api": 13,
    "date": "September 20, 2011",
    "v": "3.2.1",
    "cl": "Bug fixes and minor security, stability and Wi-Fi improvements.\nUpdate to Android Market with automatic updates and easier-to-read Terms and Conditions text.\nUpdate to Google Books.\nImproved Adobe Flash support in browser.\nImproved Chinese handwriting prediction.\n"
  },
  {
    "name": "Honeycomb",
    "api": 13,
    "date": "August 30, 2011",
    "v": "3.2.2",
    "cl": "Bug fixes and other minor improvements for the Motorola Xoom 4G."
  },
  {
    "name": "Honeycomb",
    "api": 13,
    "date": "August 30, 2011",
    "v": "3.2.3",
    "cl": "Bug fixes and other minor improvements for the Motorola Xoom and Motorola Xoom 4G."
  },
  {
    "name": "Honeycomb",
    "api": 13,
    "date": "December 2011",
    "v": "3.2.4",
    "cl": "Pay As You Go for 3G and 4G tablets."
  },
  {
    "name": "Honeycomb",
    "api": 13,
    "date": "January 2012",
    "v": "3.2.5",
    "cl": "Bug fixes and other minor improvements for the Motorola Xoom and Motorola Xoom 4G."
  },
  {
    "name": "Honeycomb",
    "api": 13,
    "date": "February 2012",
    "v": "3.2.6",
    "cl": "Fixed data connectivity issues when coming out of Airplane mode on the US 4G Motorola Xoom."
  },
  {
    "name": "Ice Cream Sandwich",
    "api": 14,
    "date": "October 18, 2011",
    "v": "4.0",
    "cl": "Major refinements to the \"Holo\" interface with the new Roboto font family.\nSoft buttons from Android 3.x are now available for use on phones.\nSeparation of widgets in a new tab, listed in a similar manner to applications.\nEasier-to-create folders, with a drag-and-drop style.\nImproved visual voicemail with the ability to speed up or slow down voicemail messages.\nPinch-to-zoom functionality in the Calendar.\nIntegrated screenshot capture (accomplished by holding down the Power and Volume-Down buttons).\nImproved error correction on the keyboard.\nAbility to access applications directly from the lock screen.\nImproved copy-and-paste functionality.\nBetter voice integration and continuous, real-time speech-to-text dictation.\nFace Unlock, a feature that allows users to unlock handsets using facial recognition software.[85]\nAutomatic syncing of browser with users' Chrome bookmarks.\nData Usage section in settings that lets users set warnings when they approach a certain usage limit, and disable data use when the limit is exceeded.\nAbility to shut down applications from the recent apps list with a swipe.[101]\nImproved camera application with zero shutter lag, time lapse settings, panorama mode, and the ability to zoom while recording.\nBuilt-in photo editor.\nNew gallery layout, organized by location and person.\nRefreshed the \"People\" application with social network integration, status updates and hi-res images.\nAndroid Beam, a near-field communication feature allowing the rapid short-range exchange of web bookmarks, contact info, directions, YouTube videos and other data.[85]\nSupport for the WebP image format.[89]\nHardware acceleration of the UI.[102]\nWi-Fi Direct.[103]\n1080p video recording for stock Android devices.\nAndroid VPN Framework (AVF), and TUN (but not TAP) kernel module. Prior to 4.0, VPN software required a rooted Android device."
  },
  {
    "name": "Ice Cream Sandwich",
    "api": 14,
    "date": "October 21, 2011",
    "v": "4.0.1",
    "cl": "Fixed minor bugs for the Samsung Galaxy Nexus."
  },
  {
    "name": "Ice Cream Sandwich",
    "api": 14,
    "date": "November 28, 2011",
    "v": "4.0.2",
    "cl": "Fixed minor bugs on the Verizon Galaxy Nexus, the US launch of which was later delayed until December 2011.[b]"
  },
  {
    "name": "Ice Cream Sandwich",
    "api": 15,
    "date": "December 16, 2011",
    "v": "4.0.3",
    "cl": "Numerous bug fixes and optimizations.\nImprovements to graphics, databases, spell-checking and Bluetooth functionality.\nNew APIs for developers, including a social stream API in the Contacts provider.\nCalendar provider enhancements.\nNew camera applications enhancing video stabilization and QVGA resolution.\nAccessibility refinements such as improved content access for screen readers.[107]\n"
  },
  {
    "name": "Ice Cream Sandwich",
    "api": 15,
    "date": "March 29, 2012",
    "v": "4.0.4",
    "cl": "Stability improvements.\nBetter camera performance.\nSmoother screen rotation.\nImproved phone number recognition.[109]"
  },
  {
    "name": "Jelly Bean",
    "api": 16,
    "date": "July 9, 2012",
    "v": "4.1",
    "cl": "Smoother user interface:\nVsync timing across all drawing and animation done by the Android framework, including application rendering, touch events, screen composition and display refresh.\nTriple buffering in the graphics pipeline.\nCPU input boost.\nSynchronizing touch to vsync timing.\nEnhanced accessibility.\nBi-directional text and other language support.\nUser-installable keyboard maps.\nExpandable notifications.\nAbility to turn off notifications on an application-specific basis.\nShortcuts and widgets can automatically be re-arranged or re-sized to allow new items to fit on home screens.\nBluetooth data transfer for Android Beam.\nTablets with smaller screens now use an expanded version of the interface layout and home screen used by phones.[112]\nImproved camera application.\nMultichannel audio.[110]\nThe Fraunhofer FDK AAC codec becomes standard in Android, adding AAC 5.1 channel encoding/decoding.\nUSB audio (for external sound DACs).[110]\nAudio chaining (also known as gapless playback).[110][113][114]\nAbility for other launchers to add widgets from the application drawer without requiring root access."
  },
  {
    "name": "Jelly Bean",
    "api": 16,
    "date": "July 11, 2012",
    "v": "4.1.1",
    "cl": "Fixed a bug on the Nexus 7 regarding the inability to change screen orientation in any application."
  },
  {
    "name": "Jelly Bean",
    "api": 16,
    "date": "October 9, 2012",
    "v": "4.1.2",
    "cl": "Lock/home screen rotation support.[117]\nOne-finger gestures to expand/collapse notifications.[118]\nBug fixes and performance enhancements."
  },
  {
    "name": "Jelly Bean",
    "api": 17,
    "date": "November 13, 2012",
    "v": "4.2",
    "cl": "Lock screen improvements, including widget support (removed again in 2014)[85] and the ability to swipe directly to the camera.[123]\nNotification power controls (\"Quick Settings\").\n\"Daydream\" screensavers, showing information when idle or docked (later renamed to \"screen saver\" following the launch of the unrelated Google Daydream VR platform in 2016).[85]\nMultiple user accounts (tablets only).\nRewritten Bluetooth stack, switching from Bluez to Broadcom open source BlueDroid,[124] allowing improved support for multiple displays and wireless display (Miracast).\nNative right-to-left, always-on VPN and application verification.[125] A new NFC stack was added at the same time.[124]\nAccessibility improvements: triple-tap to magnify the entire screen, pan and zoom with two fingers. Speech output and Gesture Mode navigation for blind users.\nNew clock application with a built-in world clock, stop watch and timer.\nAll devices now use the same interface layout, previously adapted from phones on 4.1 for smaller tablets (with centered software buttons, the system bar at the top of the screen, and a home screen with a dock and centered application menu), regardless of screen size.\nIncreased number of extended notifications and Actionable Notifications for more applications, allowing users to respond to certain notifications within the notification bar and without launching the application directly.\nSELinux support.\nPremium SMS confirmation.[126]\nGroup Messaging support."
  },
  {
    "name": "Jelly Bean",
    "api": 17,
    "date": "November 27, 2012",
    "v": "4.2.1",
    "cl": "Fixed a bug in the People application where December was not displayed on the date selector when adding an event to a contact.[128]\nAdded Bluetooth gamepads and joysticks as supported HIDs (Human interface devices)."
  },
  {
    "name": "Jelly Bean",
    "api": 17,
    "date": "February 11, 2013",
    "v": "4.2.2",
    "cl": "Fixed Bluetooth audio streaming bugs.[130]\nLong-pressing the Wi-Fi and Bluetooth icons in Quick Settings now toggles the on/off state.\nNew download notifications, which now show the percentage and estimated time remaining for active application downloads.\nNew sounds for wireless charging and low battery.\nNew Gallery application animation allows faster loading.\nUSB debug whitelist.\nBug fixes and performance enhancements."
  },
  {
    "name": "Jelly Bean",
    "api": 18,
    "date": "July 24, 2013",
    "v": "4.3",
    "cl": "Bluetooth low energy support.[134]\nBluetooth Audio/Video Remote Control Profile (AVRCP) 1.3 support.\nOpenGL ES 3.0 support, allowing improved game graphics.[134]\nRestricted access mode for new user profiles.[134]\nFilesystem performance improvement by running the fstrim command while a device is idle.[135]\nDial pad auto-complete in the Phone application.[134]\nVolume for incoming calls (ringtone) and notification alerts is no longer adjustable separately.\nImprovements to Photo Sphere.[136]\nReworked camera UI, previously introduced on Google Play edition phones.[137]\nAddition of \"App Ops\", a fine-grained application permissions control system (hidden by default).[138]\nSELinux enabled by default.\n4K resolution support.[139]\nNumerous security updates, performance enhancements, and bug fixes.[140]\nSystem-level support for geofencing and Wi-Fi scanning APIs.\nBackground Wi-Fi location still runs even when Wi-Fi is turned off.\nDeveloper logging and analyzing enhancements.\nAdded support for five more languages.\nChanged digital rights management (DRM) APIs.\nRight-to-left (RTL) languages now supported.[134]\nClock in the status bar disappears if it is selected as a lockscreen widget.\nNative emoji support.[141]"
  },
  {
    "name": "Jelly Bean",
    "api": 18,
    "date": "October 3, 2013",
    "v": "4.3.1",
    "cl": "Bug fixes and small tweaks for the Nexus 7 LTE.[143]"
  },
  {
    "name": "KitKat",
    "api": 19,
    "date": "October 31, 2013",
    "v": "4.4",
    "cl": "Refreshed interface with white elements instead of blue.\nClock no longer shows bold hours; all digits are thin. The H, M, and S markings for the stopwatch and timer have been removed, leaving just the numbers.\nAbility for applications to trigger translucency in the navigation and status bars.[150]\nAbility for applications to use \"immersive mode\" to keep the navigation and status bars hidden while maintaining user interaction.[151]\nAction overflow menu buttons are always visible, even on devices with a \"Menu\" key, which was officially deprecated by Android 4.0.[152]\nWrite access disabled for user-installed applications om external storage (i.e. MicroSD), except for their own directories inside Android/data.[153][154]\nPurging of app data directories in user storage (internal user storage and MicroSD) upon uninstallation[154]\nOptimizations for performance on devices with lower specifications, including zRAM support and \"low RAM\" device API.[146]\nWireless printing capability.[146]\nNFC host card emulation, enabling a device to replace smart cards.[146]\nWebViews are now based on the Chromium engine (feature parity with Chrome for Android 30).\nExpanded functionality for notification listener services.[146]\nPublic API for developing and managing text messaging clients.[155]\nStorage Access Framework, an API allowing apps to retrieve files in a consistent manner. As part of the framework, a new system file picker allows users to access files from various sources (including those exposed by apps, such as online storage services).[86]\nNew framework for UI transitions.\nSensor batching, step detector and counter APIs.[146]\nSettings application now makes it possible to select default text messaging and the home (launcher) application.\nAudio tunneling, audio monitoring and loudness enhancer.[156]\nBuilt-in screen recording feature (primarily for developers, as usage of ADB is required).[157]\nNative infrared blaster API.\nVerified boot.\nEnforcing SELinux.\nExpanded accessibility APIs and system-level closed captioning settings.\nAndroid Runtime (ART) introduced as a new experimental application runtime environment, not enabled by default, as a replacement for the Dalvik virtual machine.[158]\nBluetooth Message Access Profile (MAP) support.[159]\nDisabled access to battery statistics by third-party applications.[160]\nSettings application no longer uses a multi-pane layout on devices with larger screens.\nWi-Fi and mobile data activity (TX/RX) indicators are moved to quick settings.[161]\nDisables text wrapping in the WebView browser component.[162]"
  },
  {
    "name": "KitKat",
    "api": 19,
    "date": "December 5, 2013",
    "v": "4.4.1",
    "cl": "Better application compatibility for the experimental Android Runtime (ART).\nCamera application now loads Google+ Photos instead of Gallery when swiping away from the camera view.\nMiscellaneous improvements and bug fixes."
  },
  {
    "name": "KitKat",
    "api": 19,
    "date": "December 9, 2013",
    "v": "4.4.2",
    "cl": "Further security enhancements and bug fixes.\nRemoval of the \"App Ops\" application permissions control system, introduced in Android 4.3.[165]\n"
  },
  {
    "name": "KitKat",
    "api": 19,
    "date": "June 2 , 2014",
    "v": "4.4.3",
    "cl": "Refreshed the Dialer app's interface.[167]\nUpdated the Chromium-based WebView to version 33 (screencasting to DevTools, HTML5 Canvas hardware acceleration performance improvements, vibration API, HTML5 form validation, and an HTML5 datalist).[168]\nMiscellaneous improvements and bug fixes."
  },
  {
    "name": "KitKat",
    "api": 19,
    "date": "June 19 , 2014",
    "v": "4.4.4",
    "cl": "CVE-2014-0224 fixed, eliminating an OpenSSL man-in-the-middle vulnerability.[170]"
  },
  {
    "name": "Lollipop",
    "api": 20,
    "date": "November 12, 2014",
    "v": "5.0",
    "cl": "Android Runtime (ART) with ahead-of-time (AOT) compilation and improved garbage collection (GC), replacing Dalvik that combines bytecode interpretation with trace-based just-in-time (JIT) compilation.[181][183]\nSupport for 64-bit CPUs.\nOpenGL ES 3.1 and Android Extension Pack (AEP) on supported GPU configurations.\nRecent activities screen with tasks instead of applications, up to a configured maximum of tasks per application.\nVector drawables, which scale without losing definition.\nSupport for print previews.\nMaterial design, bringing a restyled user interface and “ripple effect” for buttons.\nRefreshed lock screen, no longer supporting widgets.[184]\nRefreshed notification tray and quick settings pull-down.\nProject Volta, for battery life improvements.\nSearches can be performed within the system settings for quicker access to particular settings.\nLock screen provides shortcuts to application and notification settings.[185]\nGuest logins and multiple user accounts are available on more devices, such as phones.[186]\nAudio input and output through USB devices.\nThird-party applications regain the ability to read and modify data located anywhere on external storage, such as on SD cards. However, those must be adapted to the storage access framework of Android API level 21 or higher.[187][188]\nPinning of an application's screen for restricted user activity.[185]\nRecently used applications are remembered even after restarting the device.[185]\nWebViews receive updates independently through Google Play for security reasons, instead of relying on system-wide vendor updates.[189]\nAddition of 15 new languages: Basque, Bengali, Burmese, Chinese (Hong Kong), Galician, Icelandic, Kannada, Kyrgyz, Macedonian, Malayalam, Marathi, Nepali, Sinhala, Tamil and Telugu.[190]\nTap and Go allows users to quickly migrate to a new Android device, using NFC and Bluetooth to transfer Google Account details, configuration settings, user data and installed applications.[185]\nA flashlight-style application is included, working on supported devices with a camera flash.[185]\nUser-customizable priorities for application notifications.[191]\nSmart lock feature.[192]\nSELinux in enforcing mode for all domains.\nUpdated emoji.[193]\nImproved accessibility support (e.g. switch access support).[194][194]\nBlock-based over-the-air (OTA) updates for new devices.[195]\nTask listing access disabled for third-party applications"
  },
  {
    "name": "Lollipop",
    "api": 20,
    "date": "December 2, 2014",
    "v": "5.0.1",
    "cl": "A few bug fixes, including resolving issues with video playback and password failures handling."
  },
  {
    "name": "Lollipop",
    "api": 20,
    "date": "December 19, 2014",
    "v": "5.0.2",
    "cl": "Fixes a bug with TRIM support (introduced in Version 4.3), which prevented devices from running on-charger cleanups of file system allocations if the device was turned off at midnight, or if it was charged only when in use.[198]\nChanges how alarms wake the CPU, and how alarms compete for system resources.[199]"
  },
  {
    "name": "Lollipop",
    "api": 21,
    "date": "March 9, 2015",
    "v": "5.1",
    "cl": "Improvements and bug fixes to the Overview screen.\nAbility to join Wi-Fi networks and control paired Bluetooth devices from quick settings.\nOfficial support for multiple SIM cards.[201]\nDevice protection: if a device is lost or stolen it will remain locked until the owner signs into their Google account, even if the device is reset to factory settings.\nHigh-definition voice calls, available between compatible 4G LTE devices running Android 5.1.[201]\nImprovements to the notification priority system, to more closely replicate the silent mode that was removed from Android 5.0.[202]\n"
  },
  {
    "name": "Marshmallow",
    "api": 22,
    "date": "October 5, 2015",
    "v": "6.0",
    "cl": "Contextual search from keywords within apps.[209]\nIntroduction of Doze mode, which reduces CPU speed while the screen is off in order to save battery life.[210]\nApp Standby feature.\nAlphabetically accessible vertical application drawer.[211]\nApplication search bar and favorites.\nNative fingerprint reader support.\nDirect Share feature for target-specific sharing between apps.[212]\nRenamed \"Priority\" mode to \"Do Not Disturb\" mode.\nApp Linking for faster instinctive opening of links with corresponding applications.[213][214]\nLarger Application folders with multiple pages.\nPost-install/run-time permission requests.\nUSB-C support.\nDemo Mode feature for screenshot-capture usage.[215]\nAutomatic full data backup and restore for apps.[216]\n4K display mode for apps.[217]\nAdoptable External storage to behave like Internal Storage.[218] (However, this causes more actual problems than the hypothetical ones it was probably designed to solve.)[219]\nMIDI support for musical instruments.[220]\nExperimental multi-window feature.[221][222]\nSupport for actions by third-party apps in the text selection menu.[85]\nApp permissions now granted individually at run-time, not all-or-nothing at install time. Similar to App Ops.[223]\nMiracast support dropped.[85]\nMany new essential commands supported by Android's Linux shell (/bin/sh).\nNo screen rotation during touch."
  },
  {
    "name": "Marshmallow",
    "api": 22,
    "date": "December 7, 2015",
    "v": "6.0.1",
    "cl": "Unicode 7.0 & 8.0 emoji support.[225]\nDescriptions for USB connection options.\nDouble-press the power button to open the camera."
  },
  {
    "name": "Nougat",
    "api": 23,
    "date": "August 22, 2016",
    "v": "7.0",
    "cl": "Support for file-based encryption.[227]\nUnicode 9.0 emoji and skin tone modifier support (and exposes a subset of ICU4J APIs).[228]\nAbility to display color calibration.\nAbility to zoom in the screen.\nAbility to switch to the last opened app by double-tapping the overview button.\nAdded an Emergency information part.\nAdded the \"Clear All\" button to the Overview screen.\nAnother system partition, which gets updated when not in use, allowing for seamless system updates.\nDaydream virtual reality platform (VR interface).\nImproved Doze functionality, which aims to prolong battery life.\nImprovements to the file browser.\nMore Quick Settings options.\nMulti-window support, which supports floating apps on a desktop layout.\nNew Data Saver mode, which can force apps to reduce bandwidth usage.\nNew JIT Compiler, making for 75 percent faster app installations and a 50 percent reduction in compiled code size.\nJust in Time (JIT) compiler with code profiling to ART, which lets it constantly improve the performance of Android apps as they run.[229]\nPicture-in-picture support for Android TV.\nRedesigned notification shade, featuring instant access to certain settings.\nRedesigned Overview screen.\nReplaced notification cards with notification sheets.\nSettings app navigation drawer.\nVulkan 3D rendering API.\nMultiple Device Locales[230]\nDiscontinuation of Android Camera V1 API[231]\nRestricted file system access[232]"
  },
  {
    "name": "Nougat",
    "api": 25,
    "date": "October 4, 2016",
    "v": "7.1",
    "cl": "Rearranged notification shade.\nTouch/display performance improvements.\nMoves (Fingerprint swipe down gesture – opt-in).\nOpt-in with new hardware required:\nSeamless A/B system updates.\nDaydream VR mode.\nDeveloper features:\nShortcut manager APIs.\nCircular app icons support.\nKeyboard image insertion.\nFingerprint sensor gesture to open/close notification shade.\nManual storage manager Intent for apps.\nImproved VR thread scheduling.\nEnhanced wallpaper metadata.\nMulti-endpoint call support.\nSupport for various MNO requirements.\nPCDMA voice privacy property.\nSource type support for Visual Voicemail.\nCarrier config options for managing telephone videos.\nManual storage manager – identifies files and apps using storage."
  },
  {
    "name": "Nougat",
    "api": 25,
    "date": "December 5, 2016",
    "v": "7.1.1",
    "cl": "New set of emojis adding different skin tones and haircuts to existing ones.\nSend GIFs directly from the default keyboard.\nApp shortcuts: Launch actions on apps by long pressing the app icon.\nDeveloper Options: Show CPU Usage feature removed."
  },
  {
    "name": "Nougat",
    "api": 25,
    "date": "April 4, 2017",
    "v": "7.1.2",
    "cl": "Battery usage alerts."
  },
  {
    "name": "Oreo",
    "api": 26,
    "date": "August 21, 2017",
    "v": "8.0",
    "cl": "Project Treble, the biggest change to the foundations of Android to date: a modular architecture that makes it easier and faster for hardware makers to deliver Android updates.\nPicture-in-picture support.\nSupport for Unicode 10.0 emoji (5.0) and replacement of all blob-shaped emojis by round ones with gradients and outlines.\nRedesigned Quick Settings and Settings with a white background and respectively black and Accent font colors.\nRestructured Settings by regrouping sections into similar entries.\nAdaptive icons\nNotification improvements.\nNotification channels.\nNotification dots (badges).\nNotification snoozing.\nNotification shade multi-colors (for music album art, messengers, etc.).\nSystem-wide Autofill framework.\nSupport for AAC, Sony's LDAC and Qualcomm's aptX and aptX HD codecs.[238]\nApp-specific unknown sources.\nMulti-display support.\n2 times faster boot time compared to Nougat according to Google, testing on their Pixel devices.[237]\nApps background execution and location limits.\nGoogle Play Protect.\nDownloadable fonts.\nIntegrated printing support.\nColor management (deep color and wide color gamut).\nWi-Fi Assistant."
  },
  {
    "name": "Oreo",
    "api": 27,
    "date": "December 5, 2017",
    "v": "8.1.0",
    "cl": "Neural networks API.\nShared memory API.\nWallpaperColors API.\nBluetooth battery level for connected devices, accessible in Quick Settings.\nAndroid Oreo Go Edition, a lightweight distribution of Android that runs better than normal Android on devices with less than 1 GB of RAM.[243]\nAutofill framework updates.\nProgrammatic Safe Browsing actions.\nNavigation buttons dim when not in use.\nVisual changes to 'Power Off' and 'Restart', including a new screen and floating toolbar.\nToast messages are now white with the same existing transparency.\nAutomatic light and dark themes.\nNew Easter egg in the form of an official Oreo cookie picture.[244]"
  },
  {
    "name": "Pie",
    "api": 28,
    "date": "August 6, 2018",
    "v": "9.0",
    "cl": "New user interface for the quick settings menu.[245]\nThe clock has moved to the left of the notification bar.[246]\nThe \"dock\" now has a semi-transparent background.[246]\nBattery Saver no longer shows an orange overlay on the notification and status bars.[245]\nA \"screenshot\" button has been added to the power options.[246]\nA new \"Lockdown\" mode which disables biometric authentication once activated.\nRounded corners across the UI.\nNew transitions for switching between apps, or activities within apps.\nRicher messaging notifications, where a full conversation can be seen within a notification, full-scale images, and smart replies akin to Google's new app, Reply.\nSupport for display cutouts.\nRedesigned volume slider.\nBattery percentage now shown in Always-On Display.\nLock screen security changes include the possible return of an improved NFC Unlock.\nExperimental features (which are currently hidden within a menu called Feature Flags) such as a redesigned About Phone page in settings, and automatic Bluetooth enabling while driving.\nDNS over TLS.[247]\nA new optional gesture-based system interface, allowing users to navigate the OS using swipes more often than the traditional UI.\nRedesigned multitask app switcher with the Google search bar and app drawer built-in.\nAndroid Dashboard, which tells the user how much time they are spending on their device and in apps, and allows the user to set time limits on apps.\n\"Shush\", an enhanced version of Do Not Disturb mode activated by placing the phone face down, which mutes standard notifications.\n\"Adaptive Battery\" prediction, which makes use of Doze to hibernate user apps the OS determines the user will not use.\nAuto-Brightness feature modifies screen brightness based on user habits.\nWind Down option lets Android users set a specific bedtime that enables Do Not Disturb and turns the entire phone's interface gray to discourage further use at night.\nVulkan 1.1 support.\nCall recording options fully disabled[248]"
  },
  {
    "name": "Q",
    "api": 29,
    "date": "ASeptember 3, 2019",
    "v": "10.0",
    "cl": "New permissions required to access location in background and to access photo, video and audio files.[249]\nBackground apps can no longer jump into the foreground.[249]\nLimited access to non-resettable device identifiers.[249]\nBackground (idle) access to camera, microphone and sensors disabled for more privacy protection with the side effect of disabling antitheft software.[250][251][252]\nSharing shortcuts, which allow sharing content with a contact directly.[249]\nFloating settings panel, that allows changing system settings directly from apps.[249]\nDynamic depth format for photos, which allow changing background blur after taking a photo.[249]\nSupport for the AV1 video codec, the HDR10+ video format and the Opus audio codec.[249]\nSupport for aptX Adaptive, LHDC, LLAC, CELT and AAC LATM codecs[253][254]\nA native MIDI API, allowing interaction with music controllers.[249]\nBetter support for biometric authentication in apps.[249]\nSupport for the WPA3 Wi-Fi security protocol.[249]\nSupport for foldable phones.[249]\nSupport for Notification Bubbles.[255][256]\nNew system-wide dark theme/mode[257][258]\nProject Mainline, allows core OS components to be updated via the Google Play Store, without requiring a complete system update[259]"
  },
  {
    "name": "R",
    "api": 30,
    "date": "September , 2020",
    "v": "R",
    "cl": "New permissions controls.\nAPI distinction between standalone"
  }
]